[
  {
    "country": "Türkiye",
    "country_image": "turkey",
    "animals": [
      {
        "id": 0,
        "3d_model": "https://sketchfab.com/models/723309708e9e403c8808617386594851/embed",
        "type": "fish",
        "animal_name": "Хамсия",
        "max_size": 20,
        "max_weight": 0.2,
        "max_depth": 200,
        "other_names": ["Engraulis encrasicolus", "Черноморска хамсия"],
        "colors": ["#607D8B", "#B0BEC5"],
        "family": "Engraulidae",
        "habitat": "Черноморски брегове, миграционни маршрути в открито море",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "мигрира на ята",
        "locations": ["Черно море", "Мраморно море"],
        "locations_description": "Често срещана по бреговете на Турция и околните морета. Хамсията е жизненоважна в морската хранителна верига, служейки като плячка за по-големи риби и морски птици, и е широко консумирана от хората поради нейната хранителна стойност.",
        "description": "Хамсията (Engraulis encrasicolus) е малка, мазна риба, често срещана в Черно море, Мраморно море и Егейско море. Обикновено с дължина 10–20 см и тегло около 0,1–0,2 кг, хамсията има тънко, сребристо тяло със синьо-зелен гръб. Обикновено плува на големи ята и се храни с планктон и малки ракообразни.\n\nХамсията е богата на омега-3 мастни киселини, протеини, витамини и минерали, подпомагайки сърдечното здраве и общото хранене. В турската кухня тя е особено популярна през есента и зимата, често печена на скара, пържена или използвана за туршия. Пресната хамсия предлага най-добрия вкус и хранителна стойност. Устойчивите практики за риболов са важни за запазване на естествената й популация.",
        "distribution_habitat": "Намира се в крайбрежни и открити води на Черно море, Мраморно море и Егейско море. Предпочита плитки области с изобилен планктон за хранене, често формирайки големи ята за защита и ефективно събиране на храна.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1pHXHM179a8zu6XR9cS3tHqokq0wa0gWf",
          "https://drive.google.com/uc?export=view&id=1zqZFDOT8keqhheRJJqjuezqUDpQ1wyah"
        ]
      },
      {
        "id": 1,
        "3d_model": "https://sketchfab.com/models/e59ba168962348acaa739a000249b534/embed",
        "type": "fish",
        "animal_name": "Европейски лаврак",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Dicentrarchus labrax", "Лаврак"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Егейски и средиземноморски брегове, заливи, лагуни",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "самотен или в малки групи",
        "locations": ["Егейско море", "Средиземно море"],
        "locations_description": "Често срещан по западните брегове на Турция, както чрез дивен риболов, така и чрез аквакултура.",
        "description": "Лавракът (Dicentrarchus labrax) е популярна и питателна риба, намираща се в Средиземно море, Егейско море и по бреговете на Европа. Обикновено с дължина 30–60 см и тегло 0,5–3 кг, лавракът има елегантно, сребристо-сиво тяло с леко по-тъмен гръб. Това е хищна риба, хранеща се с по-малки риби и ракообразни.\n\nЛавракът е богат на висококачествени протеини, омега-3 мастни киселини, витамини и минерали, което го прави полезен за сърдечното здраве и общото благосъстояние. В турската и средиземноморската кухня обикновено се пече на скара, пече се или се приготвя на пара. Пресният лаврак предлага най-добрия вкус и хранителна стойност. Устойчивият риболов гарантира, че този ценен вид остава изобилен за бъдещите поколения.",
        "distribution_habitat": "Крайбрежни скалисти и пясъчни райони, устия, плитки до средни дълбочини.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1Jvyd4iPpBe3yRXRhAB3jdKIof6o8TuWI",
          "https://drive.google.com/uc?export=view&id=1KoQ8Jv_6zeL4jf_2DDB0NpkNwGaBVRv-"
        ]
      },
      {
        "id": 3,
        "3d_model": "https://sketchfab.com/models/9597628972c144f4a166a53c142cd9ca/embed",
        "type": "fish",
        "animal_name": "Паламуд",
        "max_size": 90,
        "max_weight": 6,
        "max_depth": 300,
        "other_names": ["Sarda sarda", "Паламудова риба"],
        "colors": ["#1E90FF", "#C0C0C0"],
        "family": "Scombridae",
        "habitat": "Открито море, миграционни маршрути",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "мигрира и ловува на ята",
        "locations": ["Мраморно море", "Егейско море"],
        "locations_description": "Мигриращ вид, интензивно ловен по турските брегове през есенните месеци.",
        "description": "Паламудът (Sarda sarda) е вкусна и питателна мазна риба, често срещана в Черно море, Мраморно море и Егейско море. Обикновено с дължина 20–60 см и тегло 0,2–3 кг, паламудът има тъмносиньо-зелена горна част и сребристо-бяла долна част. Обикновено плува на ята и се храни с планктон и малки риби.\n\nБогат на омега-3 мастни киселини, протеини, витамини и минерали, редовната консумация на паламуд подпомага сърдечното здраве и укрепва имунната система. В турската кухня той се радва на особена популярност през есента и зимата, приготвен на скара, пържен или на пара. Пресният паламуд предлага най-добрия вкус и хранене. Устойчивите практики за риболов са от съществено значение за запазване на естествената му популация.",
        "distribution_habitat": "Открито море и крайбрежни преходни зони, средни до дълбоки води.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1zaMhXPO4AtI1MIbu55zBfnaERO_Apd5-",
          "https://drive.google.com/uc?export=view&id=16VlhQGqjLkbKQ5SRmFVghawkc4m"
        ]
      },
      {
        "id": 13,
        "3d_model": "https://sketchfab.com/models/3cfe9d4021b14a5fad8372bcb490956b/embed",
        "type": "creature",
        "animal_name": "Медуза",
        "max_size": 30,
        "max_weight": 0.5,
        "max_depth": 50,
        "other_names": ["Aurelia aurita"],
        "colors": ["#FFFFFF", "#FFC0CB"],
        "family": "Ulmaridae",
        "habitat": "Открито море и крайбрежни води",
        "poisonous": true,
        "edible": false,
        "danger_to_human": true,
        "social_behaviour": "образува групи и плава колективно",
        "locations": ["Черно море", "Егейско море"],
        "locations_description": "Често срещана в Средиземно и Егейско море. Популациите на медузи често се увеличават през лятото, играейки роли както на хищник, така и на плячка в морските екосистеми.",
        "description": "Медузите са fascinating морски животни, намиращи се в океаните по целия свят, включително Средиземно море, Егейско море и Черно море. Те имат мека, желатинова структура, често под формата на чадър, с tentacles, които могат да жилят, за да уловят плячка. Медузите варират значително по размер, от няколко сантиметра до над метър в диаметър.\n\nВъпреки че не са типично консумирани в много западни диети, медузите са източник на протеин и се ядат в някои азиатски кухни. Те играят важна роля в морските екосистеми, контролирайки популациите на планктон и служейки като храна за по-големи морски животни. Наблюдението на медузи може да бъде хипнотизиращо, но се препоръчва внимание поради техните жилещи способности.",
        "distribution_habitat": "Обитава открити морета и крайбрежни води, плувайки с океанските течения. Предпочита умерени до топли региони с изобилен планктон.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1SVHv7w7LKfaFsxzhz_2la7JaZgRttbSZ"
        ]
      },
      {
        "id": 14,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Корал",
        "max_size": 15,
        "max_weight": 1,
        "max_depth": 10,
        "other_names": ["Корал"],
        "colors": ["#FF0000", "#FFA500", "##FFC0CB"],
        "family": "Scleractinia",
        "habitat": "Плитки тропически морета",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "живее в колонии",
        "locations": ["Средиземно море"],
        "locations_description": "Често срещан в части на Средиземно море и Червено море. Морските корали изграждат сложни местообитания, които приютяват широк спектър от морски видове и защитават бреговете от ерозия.",
        "description": "Коралите са цветни и разнообразни морски организми, които обитават коралови рифове в тропически и субтропически морета. Те варират значително по размер, форма и цвят, често показвайки ярки модели, които им помагат да се смесят със средата на рифа. Коралите се хранят с планктон и разчитат на симбиотични водорасли за хранителни вещества, играейки решаваща роля в поддържането на екосистемите на рифовете.\n\nВъпреки че не се консумират като храна, коралите са жизненоважни за биоразнообразието, осигурявайки подслон и места за размножаване на безброй морски видове. Защитата на кораловите рифове е от съществено значение за запазване на морския живот и поддържане на здрави океански екосистеми.",
        "distribution_habitat": "Намира се в топли, плитки тропически и субтропически морета, често формирайки рифове на скалисти субстрати.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1HJHlC3eQc_xQFkK7JsmrwD-1DJYY8Xjc"
        ]
      },
      {
        "id": 16,
        "3d_model": "https://sketchfab.com/models/caeca42dbdaf4895aa69a88a2a1bbb72/embed",
        "type": "fish",
        "animal_name": "Сафрид",
        "max_size": 35,
        "max_weight": 0.5,
        "max_depth": 250,
        "other_names": ["Trachurus trachurus", "Черноморски сафрид"],
        "colors": ["#C0C0C0", "#6B8E23"],
        "family": "Carangidae",
        "habitat": "Открити води на Черно море, Мраморно море и Егейско море",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "живее и мигрира на ята",
        "locations": ["Черно море", "Мраморно море"],
        "locations_description": "Често срещан по бреговете на Турция и съседните морета. Сафридът играе ключова роля в морската хранителна верига, служейки като плячка за по-големи риби и морски птици, и е широко консуміран от хората поради неговата хранителна стойност.",
        "description": "Сафридът (Trachurus trachurus) е широко разпространена мазна риба, намираща се в Черно море, Мраморно море и Егейско море. Обикновено с дължина 20–40 см и тегло 0,2–1 кг, сафридът има аеродинамично сребристо тяло с леко по-тъмен гръб. Обикновено плува на големи ята и се храни с малки риби, ракообразни и планктон.\n\nСафридът е богат на омега-3 мастни киселини, протеини, витамини и минерали, което го прави полезен за сърдечното здраве и общото хранене. В турската кухня обикновено се пече на скара, пържи или се използва в яхнии. Пресният сафрид предлага най-добрия вкус и хранителна стойност. Устойчивите практики за риболов са от съществено значение за поддържане на естествените му популации.",
        "distribution_habitat": "Крайбрежни води и миграционни маршрути със средна дълбочина.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1LQLDFOtTVF_Ne1qffc4-R4hLK4_lIMND"
        ]
      },
      {
        "id": 17,
        "3d_model": "https://sketchfab.com/models/3c007d219b704a8abd5a8f3bd302642e/embed",
        "type": "fish",
        "animal_name": "Луфер",
        "max_size": 110,
        "max_weight": 14,
        "max_depth": 200,
        "other_names": ["Pomatomus saltatrix"],
        "colors": ["#1E90FF", "#C0C0C0"],
        "family": "Pomatomidae",
        "habitat": "Открити води на Мраморно, Егейско и Черно море",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "ловува на ята",
        "locations": ["Проливите (Босфора и Дарданелите)", "Егейско море"],
        "locations_description": "Известен с преминаването си през Проливите (Босфора и Дарданелите) по време на миграционни периоди.",
        "description": "Луферът (Pomatomus saltatrix) е популярна и питателна хищна риба, намираща се в Черно море, Мраморно море и Егейско море. Обикновено с дължина 30–50 см и тегло 0,5–2 кг, луферът има аеродинамично сребристо-синьо тяло с леко по-тъмен гръб. Плува на ята и се храни с по-малки риби и ракообразни.\n\nЛуферът е богат на омега-3 мастни киселини, висококачествени протеини, витамини и минерали, подпомагайки сърдечното здраве и общото хранене. В турската кухня обикновено се пече на скара, пържи или пече, особено през есента, когато е най-изобилен. Пресният луфер предлага най-добрия вкус и хранителна стойност. Устойчивият риболов е важен за поддържане на здрави популации за бъдещите поколения.",
        "distribution_habitat": "Открито море и крайбрежни региони.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1keiLq5vR5RNBz9roh4xmkKYEIwJJ_Oqr"
        ]
      },
      {
        "id": 18,
        "3d_model": "https://sketchfab.com/models/645b4a2217ef452581428e0510d7e607/embed",
        "type": "creature",
        "animal_name": "Морска звезда",
        "max_size": 25,
        "max_weight": 0.3,
        "max_depth": 100,
        "other_names": ["Asteroidea"],
        "colors": ["#FFA500", "#800080", "#FF0000"],
        "family": "Asteroidea",
        "habitat": "Скалисти морски дъна на Егейско и Средиземно море",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "живее самотно",
        "locations": ["Егейско море"],
        "locations_description": "Често срещана на скалисти дъна.",
        "description": "Морските звезди са морски безгръбначни, намиращи се в океаните по целия свят, включително Средиземно море, Егейско море и Черно море. Те обикновено имат звездообразно тяло с пет или повече ръце, които използват за движение и улавяне на плячка като мекотели. Морските звезди имат уникална водна съдова система, която им помага при движението и храненето.\n\nВъпреки че не са често консумирани като храна, морските звезди играят важна роля в морските екосистеми, контролирайки популациите на други безгръбначни и допринасяйки за здравето на рифовете. Тяхната fascinating външност и регенеративни способности—някои видове могат да регенерират изгубени ръце—ги правят предмет на интерес за морската биология и любителите на аквариумите.",
        "distribution_habitat": "Крайбрежни скали и морско дъно.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1CQpLXxHjvlf7WTXHQ4OPOaJjWep872Sv"
        ]
      },
      {
        "id": 28,
        "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
        "type": "other",
        "animal_name": "Морски водорасли",
        "max_size": 50,
        "max_weight": 1,
        "max_depth": 30,
        "other_names": ["Водорасли", "Морска мъх"],
        "colors": ["#008000", "#8B4513"],
        "family": "Phaeophyceae",
        "habitat": "Брегове на Егейско и Средиземно море, скалисти дъна",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "в колонии",
        "locations": ["Егейско море", "Средиземно море"],
        "locations_description": "Гъсто видими на крайбрежни скали.",
        "description": "Морските водорасли са разнообразни морски растения, намиращи се в океаните по целия свят, включително Средиземно море, Егейско море и Черно море. Те растат в плитки води и се прикрепят към скали или морското дъно. Морските водорасли идват в различни цветове—зелени, кафяви и червени—и осигуряват местообитание и храна за много морски видове.\n\nМорските водорасли са високо питателни, богати на витамини, минерали, фибри и антиоксиданти. Те се консумират в много кухни, особено в Азия, и също се използват в добавки, козметика и торове. Отвъд хранителната си стойност, морските водорасли играят жизненоважна роля в морските екосистеми, произвеждайки кислород, намалявайки въглеродния диоксид и подпомагайки биоразнообразието.",
        "distribution_habitat": "Плитки крайбрежни райони, скалисти и пясъчни дъна.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      },
      {
        "id": 29,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Корал",
        "max_size": 20,
        "max_weight": 1,
        "max_depth": 15,
        "other_names": ["Corallium rubrum"],
        "colors": ["#FF0000", "#FFA500"],
        "family": "Scleractinia",
        "habitat": "Средиземноморски брегове, скали",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "в колонии",
        "locations": ["Средиземно море"],
        "locations_description": "Образува гъсти колонии на крайбрежни скали.",
        "description": "Коралите (Морски корали) са морски безгръбначни, намиращи се в тропически и субтропически океани, формиращи ярки екосистеми на рифове. Те имат твърд калциев карбонатен скелет и живеят в колонии, създавайки сложни структури, които осигуряват подслон и храна за многобройни морски видове.\n\nКораловите рифове подпомагат биоразнообразието и защитават бреговете от ерозия. Въпреки че не са типично консумирани като храна, коралите са високо ценени за тяхната екологична важност, красота и употреба в бижутерия. Защитата на кораловите рифове е от решаващо значение, тъй като климатичните промени, замърсяването и прекомерния риболов застрашават тяхното оцеляване и безбройните видове, които зависят от тях.",
        "distribution_habitat": "Плитки и защитени скалисти райони.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1CTGsUj276H5Cx-28Gnc6xfCyVC_RmGgp"]
      }
    ]
  },
  {
    "country": "България",
    "country_image": "bulgaria",
    "animals": [
      {
        "id": 4,
        "3d_model": "https://sketchfab.com/models/ef0c406d4ca84242a0464abecb7d7037/embed",
        "type": "fish",
        "animal_name": "Обикновен шаран (Cyprinus carpio)",
        "max_size": 120,
        "max_weight": 30,
        "max_depth": 10,
        "other_names": ["Централен сладководен шаран", "Cyprinus carpio"],
        "colors": ["#8B4513", "#FFD700", "#A0522D"],
        "family": "Cyprinidae",
        "habitat": "Сладководни езера, реки, язовири",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "на ята когато е млад, по-индивидуален като възрастен",
        "locations": ["Речна система Долината", "Български езера"],
        "locations_description": "Един от обикновените сладководни видове в България за аквакултура и риболов.",
        "description": "Обикновеният шаран (Cyprinus carpio) е сладководна риба, широко намираща се в реки, езера и язовири в цяла Европа, Азия и други региони. Обикновено с дължина 40–80 см и тегло 2–14 кг, обикновеният шаран има здраво, удължено тяло, покрито с големи люспи, обикновено златисто-кафяви или зеленикави на цвят. Това е всеядна риба, хранеща се с растения, насекоми и малки безгръбначни.\n\nОбикновеният шаран се цени за високото си съдържание на протеин и обикновено се отглежда или улавя за храна. В много култури се приготвя печен на скара, печен или пушен. Устойчивите практики за риболов и аквакултура са важни за поддържане на здрави популации, тъй като този адаптивен вид играе ключова роля в сладководните екосистеми.",
        "distribution_habitat": "Бавно течащи реки, езера, язовири, брегове, богати на растителност.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1kGxpZaSBrNpuwl_Fq9U0HRcNhKNinR8J",
          "https://drive.google.com/uc?export=view&id=1ofPUNU6cVELQciQBXkHNfWr5dzDdsU1y"
        ]
      },
      {
        "id": 5,
        "3d_model": "https://sketchfab.com/models/caeca42dbdaf4895aa69a88a2a1bbb72/embed",
        "type": "fish",
        "animal_name": "Скумрия (Scomber scombrus)",
        "max_size": 60,
        "max_weight": 2,
        "max_depth": 200,
        "other_names": ["Макрел", "Scomber scombrus"],
        "colors": ["#008080", "#C0C0C0"],
        "family": "Scombridae",
        "habitat": "Открити морски брегове на Черно море",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "мигрира на ята",
        "locations": ["Български бряг на Черно море"],
        "locations_description": "Един от мигриращите и мазни видове риби, често консумирани в България.",
        "description": "Скумрията (Scomber scombrus / Scomber japonicus) е популярна мазна риба, намираща се в Атлантическия океан, Средиземно море и други умерени води. Обикновено с дължина 20–60 см и тегло 0,2–3 кг, скумрията има аеродинамично, сребристо тяло с тъмносиньо-зелен гръб. Плува на ята и се храни с планктон, малки риби и ракообразни.\n\nБогата на омега-3 мастни киселини, протеини, витамини и минерали, скумрията подпомага сърдечното здраве, мозъчната функция и общото хранене. В кулинарията обикновено се пече на скара, пуши или пече. Пресната скумрия предлага най-добрия вкус и хранителна стойност, а устойчивите практики за риболов са от съществено значение за запазване на естествените й популации.",
        "distribution_habitat": "Крайбрежно открито море, миграционни маршрути, умерени дълбочини.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1sB7adgM2bpufrcEy4-YDBxxB7e1b_YF6",
          "https://drive.google.com/uc?export=view&id=1FqCZO5pP8DCILMqN-LOYG19Q3tJU_zVE"
        ]
      },
      {
        "id": 6,
        "3d_model": "https://sketchfab.com/models/df09d2c1e3f34ebeb7dc957b3/embed",
        "type": "fish",
        "animal_name": "Черноморски калкан (Psetta maxima maeotica)",
        "max_size": 70,
        "max_weight": 5,
        "max_depth": 100,
        "other_names": ["Калкан (Черно море)", "Psetta maxima"],
        "colors": ["#A52A2A", "#FFFFFF"],
        "family": "Scophthalmidae",
        "habitat": "Черноморско дъно, пясъчни и калови дъна",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "живее самотно",
        "locations": ["Български бряг на Черно море"],
        "locations_description": "Вид плоска риба, ловена по българския бряг на Черно море.",
        "description": "Черноморският калкан (Scophthalmus maeoticus) е плоска риба, живееща на дъното, намираща се в Черно море и Мраморно море. Обикновено с дължина 30–70 см и тегло 1–5 кг, калканът има широко, диамантено тяло с пясъчно-кафява горна страна, която му помага да се слее с морското дъно, и бяла долна страна. Храни се с малки риби, ракообразни и други безгръбначни.\n\nКалканът е високо ценен за твърдото си, бяло месо, богато на протеин и с ниско съдържание на мазнини. Обикновено се приготвя печен на скара, печен или на пара в средиземноморската и турската кухня. Пресният калкан предлага отличен вкус и хранителна стойност, а устойчивият риболов е важен за запазване на популацията му за бъдещите поколения.",
        "distribution_habitat": "Пясъчно-калови дъна, умерени дълбочини близо до брега, не в открито море.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rv06PB5pI8MqmS0Mu3idkn9EV5nKjY-U"]
      },
      {
        "id": 15,
        "3d_model": "https://sketchfab.com/models/2adc33a3a8c74a3c8759745c46c612ff/embed",
        "type": "creature",
        "animal_name": "Морски таралеж",
        "max_size": 10,
        "max_weight": 0.2,
        "max_depth": 25,
        "other_names": ["Морски таралеж"],
        "colors": ["#800080", "#A52A2A"],
        "family": "Echinoidea",
        "habitat": "Крайбрежни скали и морско дъно",
        "poisonous": true,
        "edible": true,
        "danger_to_human": true,
        "social_behaviour": "живее самотно",
        "locations": ["Български бряг на Черно море"],
        "locations_description": "Широко разпространен в Средиземно и Егейско море. Морските таралежи са важни пасачи, които помагат за контролиране на растежа на водорасли и поддържане на екологичния баланс.",
        "description": "Морският таралеж е малък, бодлив морски безгръбначен, намиращ се в океаните по целия свят, включително Средиземно море, Егейско море и Черно море. Те имат кръгла, твърда черупка, покрита с подвижни бодли за защита и придвижване. Морските таралежи се хранят главно с водорасли и играят важна роля в поддържането на баланса на морските екосистеми.\n\nМорските таралежи се считат за деликатес в много кухни, особено в средиземноморски и японски ястия, ценени за богатия им, солен вкус и високо съдържание на протеин. Те също допринасят за морското биоразнообразие, осигурявайки местообитание и храна за други видове. Устойчивата добив е от съществено значение за защита на техните популации и запазване на здравето на екосистемата.",
        "distribution_habitat": "Намира се на скалисти морски дъна и коралови рифове в плитки води. Предпочита чисти, добре осветени области, където водораслите са изобилни.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1mhBTx13dz2-S2hl2u_WU0lv7EVCxxEBK"]
      },
      {
        "id": 19,
        "3d_model": "https://sketchfab.com/models/8974457120d143029d44bac83ffb273b/embed",
        "type": "fish",
        "animal_name": "Щука (Северна щука)",
        "max_size": 150,
        "max_weight": 25,
        "max_depth": 15,
        "other_names": ["Esox lucius"],
        "colors": ["#008000", "#FFFFFF"],
        "family": "Esocidae",
        "habitat": "Сладководни езера и речни устия",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "живее самотно",
        "locations": ["Български реки", "Сладководни езера"],
        "locations_description": "Един от хищните видове, ловени във вътрешните води на България.",
        "description": "Щуката (Esox lucius) е сладководна хищна риба, често срещана в реки, езера и язовири в цяла Европа, Азия и Северна Америка. Обикновено с дължина 40–120 см и тегло 1–20 кг, щуката има удължено тяло, остра муцуна и остри зъби, които използва за улавяне на по-малки риби. Оцветяването й обикновено е зеленикаво с по-светли, жълтеникави модели за камуфлаж.\n\nЩуката се цени за твърдото си, бяло месо, богато на протеин и с ниско съдържание на мазнини. Обикновено се приготвя печена на скара, печена или пушена. Като топ хищник в сладководните екосистеми, щуката играе важна роля в поддържането на баланса на рибните популации. Устойчивите практики за риболов са от съществено значение за запазване на здрави популации на щука за бъдещето.",
        "distribution_habitat": "Бавно течащи сладки води, райони с буренаци.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1agiLwwHniyY8xUjlc5zBg6dPM03DWERg"]
      },
      {
        "id": 20,
        "3d_model": "https://sketchfab.com/models/21fd636ec9a94092b0a39c9f4f0428b5/embed",
        "type": "fish",
        "animal_name": "Костур (Европейски костур)",
        "max_size": 60,
        "max_weight": 4,
        "max_depth": 20,
        "other_names": ["Perca fluviatilis"],
        "colors": ["#3CB371", "#FFA500"],
        "family": "Percidae",
        "habitat": "Сладководни езера, реки",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "в малки групи",
        "locations": ["Български езера"],
        "locations_description": "Вид, често срещан в местния риболов.",
        "description": "Костурът (Perca fluviatilis) е сладководна риба, често срещана в реки, езера и язовири в цяла Европа и части на Азия. Обикновено с дължина 15–50 см и тегло 0,2–2 кг, костурът има странично сплеснато тяло със зеленикаво-кафяво оцветяване и характерни тъмни вертикални ивици. Храни се с малки риби, насекоми и безгръбначни.\n\nКостурът се цени за меката си, бяла плът и високо съдържание на протеин. Обикновено се приготвя печен на скара, пържен или печен в много кухни. Като хищна риба, костурът играе ключова роля в поддържането на баланса на сладководните екосистеми. Устойчивият риболов помага да се гарантират здрави популации на костур за бъдещите поколения.",
        "distribution_habitat": "Сладководни езера и райони без течение.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1O2BdQI7DuFdgO00G6d_77hKD9zH2GBVH"]
      },
      {
        "id": 21,
        "3d_model": "https://sketchfab.com/models/c710d5a183a547d8a999c721a2d906cf/embed",
        "type": "creature",
        "animal_name": "Сладководна мида",
        "max_size": 10,
        "max_weight": 0.1,
        "max_depth": 5,
        "other_names": ["Anodonta cygnea"],
        "colors": ["#000000", "#A52A2A"],
        "family": "Unionidae",
        "habitat": "Сладководни езера и потоци",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "живее в групи",
        "locations": ["Български езера"],
        "locations_description": "Играе филтрираща роля в сладководните екосистеми.",
        "description": "Сладководната мида е двустворест мекотел, намиращ се в реки, езера и язовири по целия свят. Обикновено мидите се прикрепят към скали или седименти, използвайки силни бисусни нишки. Те се хранят чрез филтриране на планктон и органични частици, играейки важна роля в поддържането на качеството на водата и баланса на екосистемата.\n\nСладководните миди са богати на протеин и минерали, въпреки че са по-малко консумирани от морските миди. Те също се ценят за екологичната си роля, осигурявайки местообитание за други водни видове и допринасяйки за биоразнообразието. Защитата на сладководните местообитания е от съществено значение за запазване на популациите на миди и общото здраве на водните екосистеми.",
        "distribution_habitat": "Сладководни дъна, калови терени.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Pmy-CTIY3FyxAkdy8dJRsaEnwICSkOfI"]
      },
      {
        "id": 30,
        "3d_model": "https://sketchfab.com/models/4cd0e97040c9404e90d9645fc0f69aab/embed",
        "type": "other",
        "animal_name": "Морска гъба",
        "max_size": 40,
        "max_weight": 0.8,
        "max_depth": 50,
        "other_names": ["Porifera"],
        "colors": ["#FFFF00", "#A52A2A"],
        "family": "Porifera",
        "habitat": "Брегове на Черно море, скалисти дъна",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "в колонии",
        "locations": ["Български бряг на Черно море"],
        "locations_description": "Намира се на крайбрежни скали и дънни пещери.",
        "description": "Морската гъба е просто, порьозно морско животно, намиращо се в океаните по целия свят, включително Средиземно море, Егейско море и Черно море. Те се прикрепят към скали или морското дъно и филтрират вода за получаване на хранителни вещества, играейки важна роля в поддържането на здравето на морската екосистема. Морските гъби идват в различни форми, размери и цветове, осигурявайки местообитание и подслон за много малки морски организми.\n\nМорските гъби са използвани от хората в продължение на векове, основно за къпане, почистване и козметични цели. Те са богати на естествени съединения, които също се изследват за потенциални медицински приложения. Защитата на морските местообитания гарантира оцеляването на популациите на гъби и видовете, които зависят от тях.",
        "distribution_habitat": "Скалисти и калови дънни райони.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rjP7JFadGU4u366K3cBYzzoxFgv4FUUR"]
      },
      {
        "id": 31,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Морска трева",
        "max_size": 60,
        "max_weight": 1.5,
        "max_depth": 10,
        "other_names": ["Zostera marina"],
        "colors": ["#008000"],
        "family": "Zosteraceae",
        "habitat": "Плитки крайбрежни райони, пясъчно дъно",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "в колонии",
        "locations": ["Български бряг на Черно море"],
        "locations_description": "Гъсто видима в крайбрежни плитчини, източник на храна за риби.",
        "description": "Морските растения са фотосинтезиращи организми, намиращи се в океаните и моретата по целия свят, включително Средиземно море, Егейско море и Черно море. Те включват морски треви, водорасли и други водни растения, които растат в плитки води, закотвяйки се към морското дъно или плувайки свободно. Морските растения осигуряват храна, подслон и кислород за многобройни морски видове.\n\nМорските растения са богати на хранителни вещества и играят решаваща роля в поддържането на здрави морски екосистеми. Те помагат за предотвратяване на крайбрежната ерозия, абсорбират въглероден диоксид и подпомагат биоразнообразието. Защитата на морските растения е от съществено значение за поддържане на здравето на океана и безбройните видове, които зависят от тях.",
        "distribution_habitat": "Плитки и спокойни морски райони.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      }
    ]
  },
  {
    "country": "Гърция",
    "country_image": "greece",
    "animals": [
      {
        "id": 7,
        "3d_model": "https://sketchfab.com/models/a3d0e1a597794a9bb74739a13cfc8b77/embed",
        "type": "fish",
        "animal_name": "Ципура (Sparus aurata)",
        "max_size": 70,
        "max_weight": 7,
        "max_depth": 80,
        "other_names": ["Златоглава ципура", "Sparus aurata"],
        "colors": ["#C0C0C0", "#FFD700"],
        "family": "Sparidae",
        "habitat": "Скалисти и пясъчни брегове на Егейско и Средиземно море, лагуни",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "на ята когато е млада, по-индивидуална като възрастна",
        "locations": ["Брегове на гръцките острови", "Егейско море"],
        "locations_description": "Риба, често намирана и ловена в ресторанти в Гърция.",
        "description": "Ципурата (Sparus aurata) е популярна крайбрежна риба, намираща се в Средиземно море, Егейско море и източната част на Атлантическия океан. Обикновено с дължина 20–50 см и тегло 0,3–2 кг, ципурата има сребристо тяло с характерна златна ивица между очите. Храни се с малки безгръбначни, ракообразни и водорасли.\n\nБогата на протеини, витамини и минерали, ципурата е високо ценена за твърдата си, ароматна плът. В средиземноморската кухня обикновено се пече на скара, пече или приготвя на пара. Пресната ципура предлага най-добрия вкус и хранителни ползи. Устойчивият риболов е от съществено значение за запазване на естествените й популации за бъдещите поколения.",
        "distribution_habitat": "Крайбрежни скалисти и пясъчни райони, устия на лагуни.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1yIXZXGjKKIsXpRLADY00k9G8OyASw6jA",
          "https://drive.google.com/uc?export=view&id=1_AkVeoIi2nt68BYwAPvlBj7Ym0NUEkVi"
        ]
      },
      {
        "id": 8,
        "3d_model": "https://sketchfab.com/models/fc781bee9c0e4378a109acc8b728a86b/embed",
        "type": "fish",
        "animal_name": "Европейски лаврак (Dicentrarchus labrax)",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Лаврак", "Dicentrarchus labrax"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Крайбрежни морета, заливи, лагуни",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "предимно индивидуален",
        "locations": ["Гръцки брегове", "Егейско море"],
        "locations_description": "Популярен вид риба в Гърция, който се лови и отглежда.",
        "description": "Европейският лаврак (Dicentrarchus labrax) е широко ценена крайбрежна риба, намираща се в Средиземно море, Черно море и източната част на Атлантическия океан. Обикновено с дължина 30–60 см и тегло 0,5–3 кг, има аеродинамично сребристо-сиво тяло с леко по-тъмен гръб. Европейският лаврак е хищна риба, хранеща се с по-малки риби, ракообразни и мекотели.\n\nБогат на висококачествени протеини, омега-3 мастни киселини, витамини и минерали, подпомага сърдечното здраве и общото хранене. Обикновено се пече на скара, пече или приготвя на пара в средиземноморската кухня. Пресният европейски лаврак предлага отличен вкус и хранителна стойност, а устойчивите практики за риболов са от съществено значение за поддържане на здрави популации.",
        "distribution_habitat": "Крайбрежни скалисти и пясъчни райони, плитки до умерени дълбочини.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1q70Dggz_KoCODH27L_54BOJCYYk30kVk",
          "https://drive.google.com/uc?export=view&id=1VzCRvcoXi8JQJkMplm3l5vmF1-ssyw9x"
        ]
      },
      {
        "id": 9,
        "3d_model": "https://sketchfab.com/models/1ea0e1c187d743039463aa1477acb71e/embed",
        "type": "fish",
        "animal_name": "Средиземноморски папагал-риба (Sparisoma cretense)",
        "max_size": 50,
        "max_weight": 3,
        "max_depth": 50,
        "other_names": ["Средиземноморска папагал-риба", "Sparisoma cretense"],
        "colors": ["#00CED1", "#FF0000"],
        "family": "Scaridae",
        "habitat": "Скалисти рифови райони, региони, богати на макроводорасли",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "живее в малки групи",
        "locations": ["Скалисти брегове на Егейско море", "Източно Средиземноморие"],
        "locations_description": "Рифова риба, намираща се особено в скалисти крайбрежни системи в Средиземноморието.",
        "description": "Средиземноморските папагал-риби са цветни морски риби, намиращи се в Средиземно море. Те са известни със силните си зъби, подобни на човка, които използват за паша на водорасли и стържене на повърхности на скали и коралови рифове. Обикновено достигат 15–35 см дължина и показват ярки цветове, които им помагат да се слеят със средата.\n\nПапагал-рибите играят решаваща роля в поддържането на здравето на рифовете, контролирайки растежа на водораслите и допринасяйки за производството на пясък чрез хранителните си навици. Въпреки че не са често консумирани като храна, те са възхищавани за красотата и екологичната си важност. Защитата на техните местообитания е от съществено значение за запазване на биоразнообразието на средиземноморските морски екосистеми.",
        "distribution_habitat": "Скалисти и гъсти с водорасли секции, плитки до умерени дълбочини.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1AhAqpVxf7HBZafEwJGSvQKP6pQvG1swU",
          "https://drive.google.com/uc?export=view&id=183FJzwM5VBTnI3nzFqMjSm-36GR8lShF"
        ]
      },
      {
        "id": 22,
        "3d_model": "https://sketchfab.com/models/59f8a232fd794318bfff79bfe4e01213/embed",
        "type": "fish",
        "animal_name": "Червена барбуня (Барбуни)",
        "max_size": 40,
        "max_weight": 1,
        "max_depth": 150,
        "other_names": ["Mullus barbatus", "Червена барбуня"],
        "colors": ["#B22222", "#FFFFFF"],
        "family": "Mullidae",
        "habitat": "Брегове на Егейско море и пясъчни дъна",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "в малки групи",
        "locations": ["Егейско море"],
        "locations_description": "Често срещана в Средиземноморието и източните атлантически брегове. Червената барбуня е популярен вид в регионалните кухни, ценен за нежното си, ароматно месо.",
        "description": "Червената барбуня (Mullus barbatus / Mullus surmuletus) е малка риба, живееща на дъното, намираща се в Средиземно море, Егейско море и източната част на Атлантическия океан. Обикновено с дължина 15–30 см, червената барбуня има червеникаво-розово тяло с две характерни мустаци под брадичката, които използва за откриване на храна на морското дъно. Храни се с малки безгръбначни, ракообразни и червеи.\n\nЧервената барбуня е високо ценена за деликатната си, ароматна плът и високо съдържание на протеин. В средиземноморската кухня обикновено се пече на скара, пече или пържи. Пресната червена барбуня предлага най-добрия вкус и хранителна стойност. Устойчивите практики за риболов са важни за запазване на естествените й популации и здравето на морските екосистеми.",
        "distribution_habitat": "Живее в пясъчни и калови морски дъна на Средиземно и Черно море, обикновено на дълбочини между 10 и 100 метра.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1qCrfny8Obe07Sw3hNsomTy__lZRNLepu"]
      },
      {
        "id": 23,
        "3d_model": "https://sketchfab.com/models/2e7c02b1826a407dafc65be285fb3684/embed",
        "type": "fish",
        "animal_name": "Меч-риба",
        "max_size": 450,
        "max_weight": 600,
        "max_depth": 800,
        "other_names": ["Xiphias gladius"],
        "colors": ["#191970", "#C0C0C0"],
        "family": "Xiphiidae",
        "habitat": "Открито море, Егейско и Средиземно море",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "живее самотно",
        "locations": ["Край брега на Крит", "Егейско море"],
        "locations_description": "Широко разпространена в тропически и умерени морета. Меч-рибите са върхови хищници, известни с дългите си човки, използвани за прорязване на плячка, и играят съществена роля в пелагичните екосистеми.",
        "description": "Меч-рибата (Xiphias gladius) е голяма, мигрираща хищна риба, намираща се в океаните по целия свят, включително Средиземно море и Атлантическия океан. Обикновено с дължина 1,5–3 метра и тегло 30–200 кг, меч-рибата има дълга, плоска човка, подобна на меч, и аеродинамично тяло, което използва за лов на по-малки риби и калмари.\n\nМеч-рибата е високо ценена за твърдата си, месеста плът, богата на протеин и с ниско съдържание на мазнини. Обикновено се пече на скара, пече или запича в средиземноморските и международни кухни. Пресната меч-риба предлага отличен вкус и хранителни ползи. Устойчивите практики за риболов са от съществено значение за защита на популациите на меч-риба и поддържане на баланса на океанската екосистема.",
        "distribution_habitat": "Намира се в открити води на Атлантическия, Средиземноморския и Индийския океан. Предпочита топли, дълбоки води и мигрира сезонно.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Mcm71LNeIIO7KZggGx2GPPy3pUh60GE3"]
      },
      {
        "id": 24,
        "3d_model": "https://sketchfab.com/models/6515f625857041ad87bb6e2e5e5f6206/embed",
        "type": "creature",
        "animal_name": "Морски охлюв",
        "max_size": 8,
        "max_weight": 0.1,
        "max_depth": 30,
        "other_names": ["Gastropoda"],
        "colors": ["#A52A2A", "#F5F5DC"],
        "family": "Gastropoda",
        "habitat": "Крайбрежни скали и морско дъно",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "живее самотно",
        "locations": ["Егейско море"],
        "locations_description": "Често срещан в цялото Средиземноморие и Егейско море. Морските охлюви играят важна роля в почистването на морското дъно и рециклирането на хранителни вещества в морските екосистеми.",
        "description": "Морският охлюв е малък, бавно движещ се морски мекотел, намиращ се в океаните по целия свят, включително Средиземно море, Егейско море и Черно море. Има спирална черупка, която осигурява защита от хищници, и мека структура, която използва за движение и хранене с водорасли, детрит или малки безгръбначни.\n\nМорските охлюви се консумират в различни кухни, особено в средиземноморските региони, за нежната си, ароматна плът. Те също играят важна екологична роля, пасейки водорасли и допринасяйки за баланса на морските екосистеми. Защитата на техните местообитания е от съществено значение за поддържане на здрави популации и запазване на морското биоразнообразие.",
        "distribution_habitat": "Живее в плитки крайбрежни зони, скалисти брегове и пясъчни морски дъна, хранейки се с водорасли и детрит.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1hczsTgmq4_EjXk-zcpH30hiwaYYZB9Bj"]
      },
      {
        "id": 32,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Корал",
        "max_size": 25,
        "max_weight": 1,
        "max_depth": 20,
        "other_names": ["Corallium rubrum"],
        "colors": ["#FF0000", "#FFA500"],
        "family": "Scleractinia",
        "habitat": "Брегове на Егейско море, скалисти рифове",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "в колонии",
        "locations": ["Егейско море"],
        "locations_description": "Гъсто видим в скалисти рифове.",
        "description": "Кораловите риби са цветни и разнообразни видове, които обитават коралови рифове в тропически и субтропически морета. Те варират значително по размер, форма и цвят, често показвайки ярки модели, които им помагат да се слеят със средата на рифа. Кораловите риби се хранят с водорасли, планктон и малки безгръбначни, играейки решаваща роля в поддържането на здравето на рифа.\n\nБогати на протеин и често с ниско съдържание на мазнини, някои видове коралови риби се консумират местно, въпреки че са по-често възхищавани за красотата си в морските екосистеми и аквариумите. Защитата на кораловите рифове е от съществено значение, тъй като те разчитат на здрави местообитания на рифове за подслон, размножаване и храна.",
        "distribution_habitat": "Плитки скалисти и рифови райони.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1CTGsUj276H5Cx-28Gnc6xfCyVC_RmGgp"]
      },
      {
        "id": 33,
        "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
        "type": "other",
        "animal_name": "Морски водорасли",
        "max_size": 45,
        "max_weight": 1.2,
        "max_depth": 25,
        "other_names": ["Водорасли"],
        "colors": ["#008000", "#A52A2A"],
        "family": "Phaeophyceae",
        "habitat": "Крайбрежни скали, плитки морски райони",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "в колонии",
        "locations": ["Егейско море"],
        "locations_description": "Намират се в цялото Средиземноморие, Егейско и Черно море. Морските растения осигуряват кислород, подслон и храна за безброй морски организми и помагат за стабилизиране на седиментите на морското дъно.",
        "description": "Морските водорасли са разнообразни морски растения, намиращи се в океаните по целия свят, включително Средиземно море, Егейско море и Черно море. Те растат прикрепени към скали или морски дъна и идват в различни цветове, включително зелени, кафяви и червени. Морските водорасли осигуряват храна, подслон и кислород за многобройни морски видове.\n\nБогати на витамини, минерали, фибри и антиоксиданти, морските водорасли се консумират в много кухни, особено в Азия, и също се използват в добавки, козметика и торове. Отвъд хранителната си стойност, морските водорасли играят жизненоважна роля в морските екосистеми, подпомагайки биоразнообразието и поддържайки качеството на водата.",
        "distribution_habitat": "Расте в плитки крайбрежни води с изобилие от слънчева светлина. Включва морски треви и водорасли, които процъфтяват в среди, богати на хранителни вещества.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=17kDgX91KiYj9IN8LgtsMCP2TWn2tpqFc"]
      }
    ]
  },
  {
    "country": "Португалия",
    "country_image": "portugal",
    "animals": [
      {
        "id": 10,
        "3d_model": "https://sketchfab.com/models/d7a2d0bd2a524d35b01e0d898b026479/embed",
        "type": "fish",
        "animal_name": "Сардина",
        "max_size": 30,
        "max_weight": 0.3,
        "max_depth": 100,
        "other_names": ["Sardina pilchardus", "Сардина"],
        "colors": ["#008080", "#C0C0C0"],
        "family": "Clupeidae",
        "habitat": "На ята в открито море и крайбрежни води",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "миграция и хранене в гъсти ята",
        "locations": ["Португалски атлантически бряг"],
        "locations_description": "Една от най-консумираните риби в Португалия",
        "description": "Сардината (Sardina pilchardus / Sardinops sagax) е малка, мазна риба, често срещана в Средиземно море, Атлантическия океан и други умерени води. Обикновено с дължина 15–25 см и тегло около 0,1–0,2 кг, сардините имат тънко, сребристо тяло със синьо-зелен гръб. Обикновено плуват на големи ята и се хранят с планктон и малки ракообразни.\n\nСардините са богати на омега-3 мастни киселини, протеини, витамини и минерали, подпомагайки сърдечното здраве и общото хранене. В кулинарията обикновено се пекат на скара, консервират или пушат. Пресните сардини предлагат най-добрия вкус и хранителни ползи, а устойчивите практики за риболов са от съществено значение за запазване на техните популации.",
        "distribution_habitat": "Крайбрежно открито море, миграционни маршрути на ята, плитки и умерени дълбочини.",
        "image_paths": ["images/sardine_pt1.png", "images/sardine_pt2.png"]
      },
      {
        "id": 11,
        "3d_model": "https://sketchfab.com/models/a3d0e1a597794a9bb74739a13cfc8b77/embed",
        "type": "fish",
        "animal_name": "Ципура (Дорада)",
        "max_size": 60,
        "max_weight": 5,
        "max_depth": 40,
        "other_names": ["Sparus aurata", "Дорада"],
        "colors": ["#C0C0C0", "#FFD700"],
        "family": "Sparidae",
        "habitat": "Крайбрежни лагуни, устия на естуари, плитко море",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "на ята по време на юношеска фаза",
        "locations": ["Португалски брегове"],
        "locations_description": "Често срещана в цялото Средиземноморие и по европейските атлантически брегове. Ципурата е ключов вид в местния риболов и аквакултура, допринасяйки както за икономиката, така и за крайбрежните морски екосистеми.",
        "description": "Ципурата (Sparus aurata) е популярна крайбрежна риба, намираща се в Средиземно море, Егейско море и източната част на Атлантическия океан. Обикновено с дължина 20–50 см и тегло 0,3–2 кг, има сребристо тяло с характерна златна ивица между очите. Ципурата се храни с малки безгръбначни, ракообразни и водорасли.\n\nБогата на протеини, витамини и минерали, тя е високо ценена за твърдата си, ароматна плът. В средиземноморската кухня обикновено се пече на скара, пече или приготвя на пара. Пресната ципура предлага отличен вкус и хранителни ползи. Устойчивият риболов е от съществено значение за запазване на естествените й популации за бъдещите поколения.",
        "distribution_habitat": "Намира се в плитки крайбрежни води, лагуни и естуари на Средиземно море, Егейско море и източната част на Атлантическия океан. Предпочита пясъчни или калови дъна, където може да търси малки безгръбначни, ракообразни и водорасли.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1yIXZXGjKKIsXpRLADY00k9G8OyASw6jA",
          "https://drive.google.com/uc?export=view&id=1_AkVeoIi2nt68BYwAPvlBj7Ym0NUEkVi"
        ]
      },
      {
        "id": 12,
        "3d_model": "https://sketchfab.com/models/fc781bee9c0e4378a109acc8b728a86b/embed",
        "type": "fish",
        "animal_name": "Европейски лаврак (Робало)",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Dicentrarchus labrax", "Робало"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Крайбрежни морета, речни устия",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "индивидуален или в малки групи",
        "locations": ["Португалски атлантически брегове"],
        "locations_description": "Широко разпространен в цялото Средиземноморие, Черно море и по европейските атлантически брегове. Европейският лаврак е важен вид както за комерсиалния, така и за рекреативния риболов и играе ключова роля като хищник в крайбрежните екосистеми.",
        "description": "Европейският лаврак (Dicentrarchus labrax) е широко ценена крайбрежна риба, намираща се в Средиземно море, Черно море и източната част на Атлантическия океан. Обикновено с дължина 30–60 см и тегло 0,5–3 кг, има аеродинамично сребристо-сиво тяло с леко по-тъмен гръб. Европейският лаврак е хищна риба, хранеща се с по-малки риби, ракообразни и мекотели.\n\nБогат на висококачествени протеини, омега-3 мастни киселини, витамини и минерали, подпомага сърдечното здраве и общото хранене. Обикновено се пече на скара, пече или приготвя на пара в средиземноморската кухня. Пресният европейски лаврак предлага отличен вкус и хранителна стойност, а устойчивите практики за риболов са от съществено значение за поддържане на здрави популации.",
        "distribution_habitat": "Намира се в крайбрежни води, естуари и лагуни на Средиземно море, Черно море и източната част на Атлантическия океан. Предпочита плитки, защитени райони с пясъчни или скалисти дъна, където може да ловува по-малки риби и ракообразни.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1q70Dggz_KoCODH27L_54BOJCYYk30kVk",
          "https://drive.google.com/uc?export=view&id=1VzCRvcoXi8JQJkMplm3l5vmF1-ssyw9x"
        ]
      },
      {
        "id": 25,
        "3d_model": "https://sketchfab.com/models/e3860feecc4f4247826a2542f1770e92/embed",
        "type": "fish",
        "animal_name": "Атлантическа треска (Бакаляу)",
        "max_size": 150,
        "max_weight": 40,
        "max_depth": 600,
        "other_names": ["Gadus morhua", "Бакаляу"],
        "colors": ["#D2B48C", "#FFFFFF"],
        "family": "Gadidae",
        "habitat": "Дълбоки води на Атлантическия океан",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "в малки ята",
        "locations": ["Край брега на Португалия"],
        "locations_description": "Често срещана по бреговете на Норвегия, Исландия и Канада. Атлантическата треска е един от най-важните икономически видове риби и крайъгълен камък на морските екосистеми на Северния Атлантик.",
        "description": "Атлантическата треска (Gadus morhua) е студеноводна риба, често срещана в Северния Атлантически океан. Обикновено с дължина 50–100 см и тегло 2–20 кг, атлантическата треска има здраво, удължено тяло със светлокафяво до зеленикаво оцветяване и характерна бяла странична линия. Храни се с по-малки риби, ракообразни и безгръбначни.\n\nАтлантическата треска е високо ценена за меката си, люспеста бяла плът, богата на протеин и с ниско съдържание на мазнини. Обикновено се приготвя печена, печена на скара или пържена. Трескaта играе важна роля в морските екосистеми като хищник, а устойчивите практики за риболов са от решаващо значение за поддържане на здрави популации и защита на океанското биоразнообразие.",
        "distribution_habitat": "Живее в студени и умерени води на Северния Атлантик, близо до морското дъно в пясъчни или калови райони. Предпочита дълбочини между 20 и 200 метра.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Kk3xifAZ9iSkh2FSgnkAprLqv-IVdFGM"]
      },
      {
        "id": 26,
        "3d_model": "https://sketchfab.com/models/6dbfc4b0a1dd4f20b628475383cc11bc/embed",
        "type": "fish",
        "animal_name": "Петльо (Пейше-гало)",
        "max_size": 70,
        "max_weight": 5,
        "max_depth": 200,
        "other_names": ["Zeus faber", "Пейше-гало"],
        "colors": ["#FFD700", "#000000"],
        "family": "Zeidae",
        "habitat": "Атлантически крайбрежни региони",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "скита самотно",
        "locations": ["Западен бряг на Португалия"],
        "locations_description": "Често срещан в Средиземноморието, Атлантика и някои умерени морета. Петльото намира идеални условия както за риболов, така и за размножаване в тези региони и играе важна роля като хищник в морската екосистема.",
        "description": "Петльото (Zeus faber) е крайбрежна риба, намираща се в Средиземно море, Атлантическия океан и други умерени води. Обикновено с дължина 30–65 см и тегло 0,5–3 кг, петльото има странично сплеснато, маслиненозелено до кафяво тяло с характерно тъмно петно от всяка страна. Храни се с по-малки риби и безгръбначни.\n\nПетльото се цени за деликатната си, бяла плът, богата на протеин и с ниско съдържание на мазнини. Обикновено се приготвя печено на скара, печено или на пара в средиземноморската кухня. Пресното петльо предлага отличен вкус и хранителна стойност. Устойчивият риболов е важен за запазване на естествените му популации за бъдещите поколения.",
        "distribution_habitat": "Намира се в крайбрежни плитчини и райони на открито море; обикновено предпочита райони близо до пясъчни или калови морски дъна. Това местообитание осигурява среда, където може лесно да улавя плячка и да се камуфлира.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1uts6OHif0EpFz2hogdZOEpdipZFr85fi"]
      },
      {
        "id": 27,
        "3d_model": "https://sketchfab.com/3d-models/deep-sea-sponge-4cd0e97040c9404e90d9645fc0f69aab",
        "type": "creature",
        "animal_name": "Морска гъба",
        "max_size": 50,
        "max_weight": 1,
        "max_depth": 100,
        "other_names": ["Porifera"],
        "colors": ["#FFFF00", "#A52A2A"],
        "family": "Porifera",
        "habitat": "Скалисти дъна, крайбрежни пещери",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "живее в колонии",
        "locations": ["Атлантически бряг", "Скали в открито море"],
        "locations_description": "Често срещана по средиземноморските и егейските брегове, особено близо до Португалия и Гърция. Морските гъби филтрират вода, осигурявайки основни екосистемни услуги и подслон за малки морски видове.",
        "description": "Морската гъба е просто, порьозно морско животно, намиращо се в океаните по целия свят, включително Средиземно море, Егейско море и Черно море. Морските гъби се прикрепят към скали или морското дъно и филтрират вода за получаване на хранителни вещества, играейки важна роля в поддържането на здрави морски екосистеми. Те идват в различни форми, размери и цветове, осигурявайки подслон за много малки морски организми.\n\nХората са използвали морските гъби в продължение на векове за къпане, почистване и козметични цели. Те също съдържат естествени съединения, които се изследват за потенциални медицински приложения. Защитата на морските местообитания гарантира оцеляването на популациите на гъби и видовете, които зависят от тях.",
        "distribution_habitat": "Обитава скалисти крайбрежни райони и морското дъно, прикрепяйки се към твърди повърхности. Предпочита чисти, добре окислени води с постоянни течения.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rjP7JFadGU4u366K3cBYzzoxFgv4FUUR"]
      },
      {
        "id": 35,
        "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
        "type": "other",
        "animal_name": "Морска трева",
        "max_size": 60,
        "max_weight": 1.5,
        "max_depth": 15,
        "other_names": ["Zostera marina"],
        "colors": ["#008000"],
        "family": "Zosteraceae",
        "habitat": "Плитки крайбрежни райони, лагуни",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "в колонии",
        "locations": ["Португалски брегове"],
        "locations_description": "Намира се в крайбрежни плитчини и формира важно местообитание за риби и различни безгръбначни. Тези райони осигуряват идеална среда както за хранене, така и за размножаване. Ливадите от морска трева предлагат както подслон, така и помагат за скриване на малки организми във подводната екосистема, като по този начин подпомагат биоразнообразието.",
        "description": "Морските растения са фотосинтезиращи организми, намиращи се в океаните и моретата по целия свят, включително Средиземно море, Егейско море и Черно море. Те включват морски треви, водорасли и други водни растения, които растат в плитки води, или закотвени към морското дъно, или плуващи свободно. Морските растения осигуряват храна, кислород и подслон за многобройни морски видове.\n\nБогати на хранителни вещества, морските растения играят решаваща роля в поддържането на здрави морски екосистеми. Те помагат за предотвратяване на крайбрежната ерозия, абсорбират въглероден диоксид и подпомагат биоразнообразието. Защитата на морските растения е от съществено значение за поддържане на здравето на океана и безбройните видове, които зависят от тях.",
        "distribution_habitat": "Намира се в плитки и спокойни морски райони; обикновено расте в крайбрежни региони на скалисти или пясъчни дъна. Тези райони са подходящи за получаване на достатъчно светлина и лесно получаване на хранителни вещества. Морските растения както произвеждат кислород, така и осигуряват подслон за много малки морски създания във подводната екосистема.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      }
    ]
  }
]