[
  {
    "id": 0,
    "sea_image" : "mediterranean_image",
    "sea_name": "Средиземно море (Турски бряг)",
    "area": "2.500.000 km² (общо Средиземно море)",
    "max_depth": 5267,
    "location": "Южното и Югозападното крайбрежие на Турция, простиращо се от Мугла до Хатай",
    "main_fishes": [
      "Европейска аншоа (Engraulis encrasicolus)",
      "Луфер (Pomatomus saltatrix)",
      "Червена барабуля (Mullus surmuletus)",
      "Ципура (Sparus aurata)"
    ],
    "main_species": [
      "Обикновен октопод (Octopus vulgaris)",
      "Европейска калмара (Loligo vulgaris)",
      "Обикновена сепия (Sepia officinalis)",
      "Ядлив морски таралеж (Paracentrotus lividus)"
    ],
    "temperature_range": "13°C - 29°C",
    "salinity": "37 PSU",
    "currents": "Доминирано от Източносредиземноморското течение и мащабните, постоянни Кипърски вихри в Левантийския басейн",
    "ecosystem": "Богата, топла умерена морска екосистема, характеризираща се с жизненоважни крайбрежни лагуни, гъсти ливади от морска трева Posidonia oceanica и сложни скалисти рифове, подкрепящи високо биоразнообразие",
    "coastline_features": "Драматични, стръмни скалисти скали, широки участъци от пясъчни плажове, множество речни устия и защитени заливи (напр. залив Анталия)",
    "important_ports": [
      "Измир (Голям търговски център)",
      "Мерсин (Най-голямото пристанище в региона)",
      "Анталия (Водещо туристическо и търговско пристанище)"
    ],
    "economic_activities": [
      "Търговски и любителски риболов (предимно за пелагични видове)",
      "Международен и крайбрежен туризъм (жизненоважен за регионалната икономика)",
      "Корабоплаване и международен морски транспорт"
    ],
    "description": "Турското средиземноморско крайбрежие е глобална гореща точка на биоразнообразието, постоянно изправяща се пред натиск от свръхизловаване и крайбрежно развитие. Неговите уникални местообитания, като ливадите от морска трева Posidonia и общностите от дълбоководни корали, са от решаващо значение за многобройни ендемични и търговски видове, подкрепящи сложна морска хранителна мрежа. Регионът също е склонен към пристигането на инвазивни лесепсиански видове от Червено море.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1IuQP92XbL-EO0iAjmKF9n3WidvW7TK_D&export=view&authuser=0"
    ]
  },
  {
    "id": 1,
    "sea_image" : "black_sea_image",
    "sea_name": "Егейско море (Турция, Гръцки бряг)",
    "area": "214.000 km²",
    "max_depth": 3543,
    "location": "Разположено между турската mainland и гръцкия полуостров, осеяно с хиляди острови",
    "main_fishes": [
      "Сардина (Sardina pilchardus)",
      "Европейски мерлуза (Merluccius merluccius)",
      "Ципура (Sparus aurata)",
      "Червена барабуля (Mullus surmuletus)"
    ],
    "main_species": [
      "Обикновен октопод (Octopus vulgaris)",
      "Обикновена сепия (Sepia officinalis)",
      "Морска звезда (Echinodermata видове)",
      "Бодлив омар (Palinurus видове)"
    ],
    "temperature_range": "12°C - 27°C",
    "salinity": "36-38 PSU",
    "currents": "Характеризира се с циклоничния модел на циркулация в Егейско море и силни, сезонни, вятърно задвижвани повърхностни течения, влияещи на разпределението на хранителни вещества",
    "ecosystem": "Много разнообразна, умерена морска екосистема с множество острови, обширни скалисти рифове и критични ливади от морска трева (Posidonia)",
    "coastline_features": "Назъбени, скалисти брегове, множество големи и малки острови (архипелагова структура), дълбоки защитени заливи и речни устия (напр. Меандър)",
    "important_ports": [
      "Измир (Голям терминал за износ/внос за Турция)",
      "Солун (Северен гръцки пристанищен град)",
      "Атина (Пирея) (Най-голямото пристанище за пътници и товари в Егейско море)"
    ],
    "economic_activities": [
      "Търговски риболов (особено малки пелагични видове като сардини)",
      "Интензивен крайбрежен и островен туризъм (жизненоважен за местните икономики)",
      "Корабоплаване и ферибот транспорт между островите и сушата"
    ],
    "description": "Сложната батиметрия на Егейско море и високият брой острови създават отделни микроекосистеми. То подкрепя критични запаси от малки пелагични риби и е значителна област за традиционен и малък риболов. Неговата емблематична красота води до значителен крайбрежен туризъм, водещ до предизвикателства за опазването.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1rjfxsGj7Jm15a-BvHEgJzjagCqex_Xod&export=view&authuser=0"
    ]
  },
  {
    "id": 2,
    "sea_image" : "black_sea_image",
    "sea_name": "Черно море (Турция, Български бряг)",
    "area": "436.000 km²",
    "max_depth": 2212,
    "location": "Северното крайбрежие на Турция, граничещо с България, Румъния, Украйна, Русия и Грузия",
    "main_fishes": [
      "Хамсия (Engraulis encrasicolus)",
      "Цаца (Sprattus sprattus)",
      "Кефал (Mugilidae видове)",
      "Калкан (Psetta maxima)"
    ],
    "main_species": [
      "Октопод (Octopus видове, по-рядък поради соленост)",
      "Калмар (Loligo видове, по-малко изобилен)",
      "Морски краставица (Holothuroidea видове)",
      "Есетра (Acipenser видове, критично застрашена)"
    ],
    "temperature_range": "7°C - 27°C",
    "salinity": "17-18 PSU",
    "currents": "Доминирано от енергичното, обхващащо целия басейн обратно на часовниковата стрелка Крайбрежно течение, течащо по крайбрежията, изолиращо централните вихри",
    "ecosystem": "Полузатворено море, уникално дефинирано от постоянна халоклина, създаваща аноксичен (без кислород) дълбок слой под 150-200м. Биологично продуктивните повърхностни води подкрепят основни търговски рибарства.",
    "coastline_features": "Дълги участъци от пясъчни плажове, значителни речни делти (напр. Дунав) и варираши крайбрежни скали (напр. турски бряг)",
    "important_ports": [
      "Варна (Основно морско пристанище на България)",
      "Бургас (Ключово петролно и промишлено пристанище)",
      "Истанбул (чрез протока Босфор, свързващ се с Мраморно море)"
    ],
    "economic_activities": [
      "Масов търговски риболов (Риболовът на хамсия е най-важната регионална дейност)",
      "Международно корабоплаване и енергиен транспорт",
      "Крайбрежен туризъм (популярен в България, Румъния и Турция)"
    ],
    "description": "Черно море е екологично чувствително поради своята уникална ниска соленост, аноксични дълбоки води и силно влияние от големи европейски реки. Рибарствата на хамсия са икономически от първостепенно значение, но подлежат на висока променливост. Замърсяването и деградацията на местообитанията от речен отток и корабоплаване представляват основни екологични заплахи.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1H5yw63uKr0lomlEqY-oU2BEU2ehvJhA5&export=view&authuser=0"
    ]
  },
  {
    "id": 3,
    "sea_name": "Атлантически океан (Португалски бряг)",
    "sea_image" : "atlantic_image",
    "area": "Открит Атлантик край западна Португалия",
    "max_depth": 8486,
    "location": "Цялото западно и южно крайбрежие на Португалия, граничещо със Северния Атлантически океан",
    "main_fishes": [
      "Атлантическа треска (Gadus morhua - исторически важна)",
      "Сардина (Sardina pilchardus - краеъгълен камък на местната кухня)",
      "Скумрия (Scomber scombrus)",
      "Син перка тон (Thunnus thynnus - високо мигриращ и ценен)"
    ],
    "main_species": [
      "Обикновен октопод (Octopus vulgaris)",
      "Европейска калмара (Loligo vulgaris)",
      "Ядлив морски таралеж (Paracentrotus lividus)",
      "Европейски омар (Homarus gammarus)"
    ],
    "temperature_range": "12°C - 22°C",
    "salinity": "35 PSU",
    "currents": "Повлиян от студеното Португалско течение, течащо на юг, и по-топлия Северноатлантически дрифт, създаващи динамични условия",
    "ecosystem": "Високо продуктивна умерена шелфова екосистема, характеризираща се с обширни скалисти рифове, разнообразни пясъчни дъна и сезонни крайбрежни зони на upwelling, които донасят студена, богата на хранителни вещества вода на повърхността, подкрепяща масивни рибни запаси",
    "coastline_features": "Драматични, обдухвани от вятъра скалисти скали (напр. Cabo da Roca), обширни пясъчни плажове и важни речни устия (напр. Тахо и Дуеро)",
    "important_ports": [
      "Лисабон (Най-голямото и най-важното пристанище за търговия и круизи)",
      "Порто (Ключов индустриален и корабен център на север)",
      "Сетубал (Важен за риболов и корабостроене)"
    ],
    "economic_activities": [
      "Интензивен риболов (особено за пелагични видове като сардина и тон)",
      "Международно корабоплаване и морски услуги (поради стратегическото атлантическо местоположение)",
      "Крайбрежен и сърф туризъм (по цялото крайбрежие)"
    ],
    "description": "Атлантическото крайбрежие на Португалия е известно със своята високо продуктивна морска среда, задвижвана от сезонен upwelling, което го прави една от най-богатите риболовни зони в Европа. Дългата традиция на консумация на треска (Bacalhau), въпреки че треската се лови предимно в Северния Атлантик, е определящ културен елемент. Устойчивото управление на местните запаси от сардина и тон е постоянен приоритет.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1wD-UGo_hVK3Jc2XUmw9GIll11CJuv5CU&export=view&authuser=0"
    ]
  }
]