[
  {
    "country": "Türkiye",
    "animals": [
      {
        "id": 0,
        "3d_model": "https://sketchfab.com/models/723309708e9e403c8808617386594851/embed",
        "type": "fish",
        "animal_name": "Anchovy",
        "max_size": 20,
        "max_weight": 0.2,
        "max_depth": 200,
        "other_names": ["Engraulis encrasicolus", "Black Sea anchovy"],
        "colors": ["#607D8B", "#B0BEC5"],
        "family": "Engraulidae",
        "habitat": "Black Sea coasts, open sea migration routes",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "migrates in schools",
        "locations": ["Black Sea", "Sea of Marmara"],
        "locations_description": "Commonly seen along the coasts of Turkey and surrounding seas. Anchovies are vital in the marine food web, serving as prey for larger fish and seabirds, and are widely consumed by humans due to their nutritional value.",
        "description": "Anchovy (Engraulis encrasicolus) is a small, oily fish commonly found in the Black Sea, Marmara, and Aegean Seas. Typically measuring 10–20 cm in length and weighing around 0.1–0.2 kg, anchovies have a slender, silver body with a bluish-green back. They usually swim in large schools and feed on plankton and small crustaceans.\n\nAnchovies are rich in omega-3 fatty acids, protein, vitamins, and minerals, supporting heart health and overall nutrition. In Turkish cuisine, they are especially popular in autumn and winter, often grilled, fried, or used in pickles. Fresh anchovies offer the best taste and nutritional value. Sustainable fishing practices are important to preserve their natural population.",
        "distribution_habitat": "Found in coastal and offshore waters of the Black Sea, Marmara, and Aegean Seas. Prefers shallow areas with abundant plankton for feeding, often forming large schools for protection and efficient foraging.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1pHXHM179a8zu6XR9cS3tHqokq0wa0gWf",
          "https://drive.google.com/uc?export=view&id=1zqZFDOT8keqhheRJJqjuezqUDpQ1wyah"
        ]
      },
      {
        "id": 1,
        "3d_model": "https://sketchfab.com/models/e59ba168962348acaa739a000249b534/embed",
        "type": "fish",
        "animal_name": "European Sea Bass",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Dicentrarchus labrax", "Sea bass"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Aegean and Mediterranean coasts, bays, lagoons",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "solitary or in small groups",
        "locations": ["Aegean Sea", "Mediterranean Sea"],
        "locations_description": "Common along Turkey’s western coasts, both through wild fishing and aquaculture.",
        "description": "Sea Bass (Dicentrarchus labrax) is a popular and nutritious fish found in the Mediterranean Sea, Aegean Sea, and along the coasts of Europe. Typically measuring 30–60 cm in length and weighing 0.5–3 kg, sea bass has a sleek, silver-gray body with a slightly darker back. It is a predatory fish, feeding on smaller fish and crustaceans.\n\nSea bass is rich in high-quality protein, omega-3 fatty acids, vitamins, and minerals, making it beneficial for heart health and overall well-being. In Turkish and Mediterranean cuisine, it is commonly grilled, baked, or steamed. Fresh sea bass offers the best flavor and nutritional value. Sustainable fishing ensures that this valuable species remains abundant for future generations.",
        "distribution_habitat": "Coastal rocky and sandy areas, estuaries, shallow to mid-depth waters.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1Jvyd4iPpBe3yRXRhAB3jdKIof6o8TuWI",
          "https://drive.google.com/uc?export=view&id=1KoQ8Jv_6zeL4jf_2DDB0NpkNwGaBVRv-"
        ]
      },
      {
        "id": 3,
        "3d_model": "https://sketchfab.com/models/9597628972c144f4a166a53c142cd9ca/embed",
        "type": "fish",
        "animal_name": "Bonito",
        "max_size": 90,
        "max_weight": 6,
        "max_depth": 300,
        "other_names": ["Sarda sarda", "Bonito fish"],
        "colors": ["#1E90FF", "#C0C0C0"],
        "family": "Scombridae",
        "habitat": "Open sea, migration routes",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "migrates and hunts in schools",
        "locations": ["Sea of Marmara", "Aegean Sea"],
        "locations_description": "A migratory species heavily fished along the Turkish coasts during the autumn months.",
        "description": "Bonito (Sarda sarda) is a tasty and nutritious oily fish commonly found in the Black Sea, Marmara, and Aegean Seas. Typically measuring 20–60 cm in length and weighing 0.2–3 kg, bonito has a dark blue-green upper body and a silvery-white underside. It usually swims in schools and feeds on plankton and small fish.\n\nRich in omega-3 fatty acids, protein, vitamins, and minerals, consuming bonito regularly supports heart health and boosts the immune system. In Turkish cuisine, it is especially enjoyed during autumn and winter, prepared grilled, fried, or steamed. Fresh bonito offers the best flavor and nutrition. Sustainable fishing practices are essential to preserve its natural population.",
        "distribution_habitat": "Open sea and coastal transition zones, medium to deep waters.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1zaMhXPO4AtI1MIbu55zBfnaERO_Apd5-",
          "https://drive.google.com/uc?export=view&id=16VlhQGqjLkbKQ5SRmFCykwFVghawkc4m"
        ]
      },

      {
        "id": 13,
        "3d_model" : "https://sketchfab.com/models/3cfe9d4021b14a5fad8372bcb490956b/embed",
        "type": "creature",
        "animal_name": "Jellyfish",
        "max_size": 30,
        "max_weight": 0.5,
        "max_depth": 50,
        "other_names": ["Aurelia aurita"],
        "colors": ["#FFFFFF", "#FFC0CB"],
        "family": "Ulmaridae",
        "habitat": "Open sea and coastal waters",
        "poisonous": true,
        "edible": false,
        "danger_to_human": true,
        "social_behaviour": "forms groups and drifts collectively",
        "locations": ["Black Sea", "Aegean Sea"],
        "locations_description": "Common in the Mediterranean and Aegean Seas. Jellyfish populations often increase in summer, playing both predator and prey roles within marine ecosystems.",
        "description": "Jellyfish are fascinating marine animals found in oceans worldwide, including the Mediterranean, Aegean, and Black Seas. They have a soft, gelatinous body, often umbrella-shaped, with tentacles that can sting to capture prey. Jellyfish vary greatly in size, from a few centimeters to over a meter in diameter.\n\nAlthough not typically consumed in many Western diets, jellyfish are a source of protein and are eaten in some Asian cuisines. They play an important role in marine ecosystems by controlling plankton populations and serving as food for larger marine animals. Observing jellyfish can be mesmerizing, but caution is advised due to their stinging capabilities.",
        "distribution_habitat": "Inhabits open seas and coastal waters, drifting with ocean currents. Prefers temperate to warm regions with abundant plankton.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1SVHv7w7LKfaFsxzhz_2la7JaZgRttbSZ"
        ]
      },
      {
        "id": 14,
        "3d_model" : "https://sketchfab.com/3d-models/corals-d521ba70ae54457faea69294757b75b5",
        "type": "other",
        "animal_name": "Coral",
        "max_size": 15,
        "max_weight": 1,
        "max_depth": 10,
        "other_names": ["Coral"],
        "colors": ["#FF0000", "#FFA500", "#FFC0CB"],
        "family": "Scleractinia",
        "habitat": "Shallow tropical seas",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "lives in colonies",
        "locations": ["Mediterranean Sea"],
        "locations_description": "Common in parts of the Mediterranean and Red Sea. Sea corals build complex habitats that host a wide range of marine species and protect coastlines from erosion.",
        "description": "Corals are colorful and diverse marine organisms that inhabit coral reefs in tropical and subtropical seas. They vary widely in size, shape, and color, often displaying vibrant patterns that help them blend into the reef environment. Corals feed on plankton and rely on symbiotic algae for nutrients, playing a crucial role in maintaining reef ecosystems.\n\nAlthough not consumed as food, corals are vital for biodiversity, providing shelter and breeding grounds for countless marine species. Protecting coral reefs is essential to preserve marine life and maintain healthy ocean ecosystems.",
        "distribution_habitat": "Found in warm, shallow tropical and subtropical seas, often forming reefs on rocky substrates.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1HJHlC3eQc_xQFkK7JsmrwD-1DJYY8Xjc"
        ]
      },
      {
        "id": 16,
        "3d_model": "https://sketchfab.com/models/caeca42dbdaf4895aa69a88a2a1bbb72/embed",
        "type": "fish",
        "animal_name": "Horse Mackerel",
        "max_size": 35,
        "max_weight": 0.5,
        "max_depth": 250,
        "other_names": ["Trachurus trachurus", "Black Sea horse mackerel"],
        "colors": ["#C0C0C0", "#6B8E23"],
        "family": "Carangidae",
        "habitat": "Open waters of the Black Sea, Sea of Marmara, and Aegean Sea",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "lives and migrates in schools",
        "locations": ["Black Sea", "Sea of Marmara"],
        "locations_description": "Commonly found along the coasts of Turkey and neighboring seas. Horse mackerel play a key role in the marine food web, serving as prey for larger fish and seabirds, and are widely consumed by humans for their nutritional value.",
        "description": "Horse Mackerel (Trachurus trachurus) is a widely distributed oily fish found in the Black Sea, Marmara, and Aegean Seas. Typically measuring 20–40 cm in length and weighing 0.2–1 kg, horse mackerel have a streamlined silver body with a slightly darker back. They usually swim in large schools and feed on small fish, crustaceans, and plankton.\n\nHorse mackerel are rich in omega-3 fatty acids, protein, vitamins, and minerals, making them beneficial for heart health and overall nutrition. In Turkish cuisine, they are commonly grilled, fried, or used in stews. Fresh horse mackerel offer the best flavor and nutritional value. Sustainable fishing practices are essential to maintain their natural populations.",
        "distribution_habitat": "Coastal waters and mid-depth migration routes.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1LQLDFOtTVF_Ne1qffc4-R4hLK4_lIMND"
        ]
      },

      {
        "id": 17,
        "3d_model": "https://sketchfab.com/models/3c007d219b704a8abd5a8f3bd302642e/embed",
        "type": "fish",
        "animal_name": "Bluefish",
        "max_size": 110,
        "max_weight": 14,
        "max_depth": 200,
        "other_names": ["Pomatomus saltatrix"],
        "colors": ["#1E90FF", "#C0C0C0"],
        "family": "Pomatomidae",
        "habitat": "Open waters of the Marmara, Aegean, and Black Seas",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "hunts in schools",
        "locations": ["The Straits (Bosporus and Dardanelles)", "Aegean Sea"],
        "locations_description": "Famous for passing through the Straits (Bosporus and Dardanelles) during migration periods.",
        "description": "Bluefish (Pomatomus saltatrix) is a popular and nutritious predatory fish found in the Black Sea, Marmara, and Aegean Seas. Typically measuring 30–50 cm in length and weighing 0.5–2 kg, bluefish has a streamlined, silver-blue body with a slightly darker back. It swims in schools and feeds on smaller fish and crustaceans.\n\nBluefish is rich in omega-3 fatty acids, high-quality protein, vitamins, and minerals, supporting heart health and overall nutrition. In Turkish cuisine, it is commonly grilled, fried, or baked, especially during autumn when it is most abundant. Fresh bluefish offers the best flavor and nutritional value. Sustainable fishing is important to maintain healthy populations for future generations.",
        "distribution_habitat": "Open sea and coastal regions.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1keiLq5vR5RNBz9roh4xmkKYEIwJJ_Oqr"
        ]
      },
      {
        "id": 18,
        "3d_model" : "https://sketchfab.com/3d-models/starfish-645b4a2217ef452581428e0510d7e607",
        "type": "creature",
        "animal_name": "Starfish",
        "max_size": 25,
        "max_weight": 0.3,
        "max_depth": 100,
        "other_names": ["Asteroidea"],
        "colors": ["#FFA500", "#800080", "#FF0000"],
        "family": "Asteroidea",
        "habitat": "Rocky seafloors of the Aegean and Mediterranean Seas",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "lives alone",
        "locations": ["Aegean Sea"],
        "locations_description": "Frequently found on rocky bottoms.",
        "description": "Starfish (Sea Star) are marine invertebrates found in oceans worldwide, including the Mediterranean, Aegean, and Black Seas. They typically have a star-shaped body with five or more arms, which they use to move and capture prey such as mollusks. Starfish have a unique water vascular system that aids in locomotion and feeding.\n\nAlthough not commonly consumed as food, starfish play an important role in marine ecosystems by controlling populations of other invertebrates and contributing to reef health. Their fascinating appearance and regenerative abilities—some species can regrow lost arms—make them a subject of interest for marine biology and aquarium enthusiasts.",
        "distribution_habitat": "Coastal rocks and seabed.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1CQpLXxHjvlf7WTXHQ4OPOaJjWep872Sv"
        ]
      },
      {
        "id": 28,
        "3d_model" : "https://sketchfab.com/3d-models/cartoon-seaweed-10-00d670cf071d498b9f20e6fe3e4fc347",
        "type": "other",
        "animal_name": "Seaweed",
        "max_size": 50,
        "max_weight": 1,
        "max_depth": 30,
        "other_names": ["Algae", "Sea Moss"],
        "colors": ["#008000", "#8B4513"],
        "family": "Phaeophyceae",
        "habitat": "Coasts of the Aegean and Mediterranean Seas, rocky bottoms",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "in colonies",
        "locations": ["Aegean Sea", "Mediterranean Sea"],
        "locations_description": "Seen densely on coastal rocks.",
        "description": "Seaweed (Marine Algae) are diverse marine plants found in oceans worldwide, including the Mediterranean, Aegean, and Black Seas. They grow in shallow waters and attach to rocks or the seabed. Seaweed comes in various colors—green, brown, and red—and provides habitat and food for many marine species.\n\nSeaweed is highly nutritious, rich in vitamins, minerals, fiber, and antioxidants. It is consumed in many cuisines, especially in Asia, and is also used in supplements, cosmetics, and fertilizers. Beyond its nutritional value, seaweed plays a vital role in marine ecosystems by producing oxygen, reducing carbon dioxide, and supporting biodiversity.",
        "distribution_habitat": "Shallow coastal areas, rocky and sandy bottoms.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      },
      {
        "id": 29,
        "3d_model" : "https://sketchfab.com/3d-models/corals-d521ba70ae54457faea69294757b75b5",
        "type": "other",
        "animal_name": "Coral",
        "max_size": 20,
        "max_weight": 1,
        "max_depth": 15,
        "other_names": ["Corallium rubrum"],
        "colors": ["#FF0000", "#FFA500"],
        "family": "Scleractinia",
        "habitat": "Mediterranean coasts, rocks",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "in colonies",
        "locations": ["Mediterranean Sea"],
        "locations_description": "Forms dense colonies on coastal rocks.",
        "description": "Coral (Marine Coral) are marine invertebrates found in tropical and subtropical oceans, forming vibrant reef ecosystems. They have a hard calcium carbonate skeleton and live in colonies, creating complex structures that provide shelter and food for numerous marine species.\n\nCoral reefs support biodiversity and protect coastlines from erosion. While not typically consumed as food, corals are highly valued for their ecological importance, beauty, and use in jewelry. Protecting coral reefs is crucial, as climate change, pollution, and overfishing threaten their survival and the countless species that depend on them.",
        "distribution_habitat": "Shallow and sheltered rocky areas.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1CTGsUj276H5Cx-28Gnc6xfCyVC_RmGgp"]
      }
    ]
  },
  {
    "country": "Bulgaria",
    "animals": [
      {
        "id": 4,
        "3d_model": "https://sketchfab.com/models/ef0c406d4ca84242a0464abecb7d7037/embed",
        "type": "fish",
        "animal_name": "Common Carp (Cyprinus carpio)",
        "max_size": 120,
        "max_weight": 30,
        "max_depth": 10,
        "other_names": ["Central freshwater carp", "Cyprinus carpio"],
        "colors": ["#8B4513", "#FFD700", "#A0522D"],
        "family": "Cyprinidae",
        "habitat": "Freshwater ponds, rivers, reservoirs",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "in schools when young, more individual as adults",
        "locations": ["Dolinata river system", "Bulgarian ponds"],
        "locations_description": "One of the common freshwater species in Bulgaria for aquaculture and fishing.",
        "description": "Common Carp (Cyprinus carpio) is a freshwater fish widely found in rivers, lakes, and ponds across Europe, Asia, and other regions. Typically measuring 40–80 cm in length and weighing 2–14 kg, common carp has a robust, elongated body covered with large scales, usually golden-brown or greenish in color. It is an omnivorous fish, feeding on plants, insects, and small invertebrates.\n\nCommon carp is valued for its high protein content and is commonly farmed or caught for food. In many cultures, it is prepared grilled, baked, or smoked. Sustainable fishing and aquaculture practices are important to maintain healthy populations, as this adaptable species plays a key role in freshwater ecosystems.",
        "distribution_habitat": "Slow-flowing rivers, lakes, reservoirs, banks rich in vegetation.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1kGxpZaSBrNpuwl_Fq9U0HRcNhKNinR8J",
          "https://drive.google.com/uc?export=view&id=1ofPUNU6cVELQciQBXkHNfWr5dzDdsU1y"
        ]
      },
      {
        "id": 5,
        "3d_model": "https://sketchfab.com/models/caeca42dbdaf4895aa69a88a2a1bbb72/embed",
        "type": "fish",
        "animal_name": "Mackerel (Scomber scombrus)",
        "max_size": 60,
        "max_weight": 2,
        "max_depth": 200,
        "other_names": ["Makrel", "Scomber scombrus"],
        "colors": ["#008080", "#C0C0C0"],
        "family": "Scombridae",
        "habitat": "Open sea coasts of the Black Sea",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "migrates in schools",
        "locations": ["Bulgarian Black Sea coast"],
        "locations_description": "One of the migratory and oily fish species commonly consumed in Bulgaria.",
        "description": "Mackerel (Scomber scombrus / Scomber japonicus) is a popular oily fish found in the Atlantic Ocean, Mediterranean Sea, and other temperate waters. Typically measuring 20–60 cm in length and weighing 0.2–3 kg, mackerel has a streamlined, silver body with a dark bluish-green back. It swims in schools and feeds on plankton, small fish, and crustaceans.\n\nRich in omega-3 fatty acids, protein, vitamins, and minerals, mackerel supports heart health, brain function, and overall nutrition. In cuisine, it is commonly grilled, smoked, or baked. Fresh mackerel offers the best flavor and nutritional value, and sustainable fishing practices are essential to preserve its natural populations.",
        "distribution_habitat": "Coastal open sea, migratory routes, moderate depths.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1sB7adgM2bpufrcEy4-YDBxxB7e1b_YF6",
          "https://drive.google.com/uc?export=view&id=1FqCZO5pP8DCILMqN-LOYG19Q3tJU_zVE"
        ]
      },
      {
        "id": 6,
        "3d_model" : "https://sketchfab.com/3d-models/american-shad-df09d2c1e3f34ebeb7dc957b3",
        "type": "fish",
        "animal_name": "Black Sea Turbot (Psetta maxima maeotica)",
        "max_size": 70,
        "max_weight": 5,
        "max_depth": 100,
        "other_names": ["Turbot (Black Sea)", "Psetta maxima"],
        "colors": ["#A52A2A", "#FFFFFF"],
        "family": "Scophthalmidae",
        "habitat": "Black Sea seabed, sandy and muddy bottoms",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "lives alone",
        "locations": ["Bulgarian Black Sea coast"],
        "locations_description": "A type of flatfish fished along the Bulgarian coast of the Black Sea.",
        "description": "Black Sea Turbot (Scophthalmus maeoticus) is a flat, bottom-dwelling fish found in the Black Sea and the Sea of Marmara. Typically measuring 30–70 cm in length and weighing 1–5 kg, turbot has a broad, diamond-shaped body with a sandy-brown upper side that helps it blend into the seabed, and a white underside. It feeds on small fish, crustaceans, and other invertebrates.\n\nTurbot is highly valued for its firm, white flesh, rich in protein and low in fat. It is commonly prepared grilled, baked, or steamed in Mediterranean and Turkish cuisine. Fresh turbot offers excellent taste and nutritional value, and sustainable fishing is important to preserve its population for future generations.",
        "distribution_habitat": "Sand-mud bottoms, moderate depths near the coast, not the open sea.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rv06PB5pI8MqmS0Mu3idkn9EV5nKjY-U"]
      },
      {
        "id": 15,
        "3d_model" : "https://sketchfab.com/3d-models/red-sea-urchin-small-2adc33a3a8c74a3c8759745c46c612ff",
        "type": "creature",
        "animal_name": "Sea Urchin",
        "max_size": 10,
        "max_weight": 0.2,
        "max_depth": 25,
        "other_names": ["Sea Urchin"],
        "colors": ["#800080", "#A52A2A"],
        "family": "EchiNoidea",
        "habitat": "Coastal rocks and seabed",
        "poisonous": true,
        "edible": true,
        "danger_to_human": true,
        "social_behaviour": "lives alone",
        "locations": ["Bulgarian Black Sea coast"],
        "locations_description": "Widespread in the Mediterranean and Aegean Seas. Sea urchins are important grazers that help control algal growth and maintain ecological balance.",
        "description": "Sea Urchin is a small, spiny marine invertebrate found in oceans worldwide, including the Mediterranean, Aegean, and Black Seas. They have a round, hard shell covered with movable spines for protection and locomotion. Sea urchins feed mainly on algae and play an important role in maintaining the balance of marine ecosystems.\n\nSea urchins are considered a delicacy in many cuisines, especially in Mediterranean and Japanese dishes, valued for their rich, briny flavor and high protein content. They also contribute to marine biodiversity, providing habitat and food for other species. Sustainable harvesting is essential to protect their populations and preserve ecosystem health.",
        "distribution_habitat": "Found on rocky seabeds and coral reefs in shallow waters. Prefers clean, well-lit areas where algae are abundant.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1mhBTx13dz2-S2hl2u_WU0lv7EVCxxEBK"]
      },
      {
        "id": 19,
        "3d_model": "https://sketchfab.com/models/8974457120d143029d44bac83ffb273b/embed",
        "type": "fish",
        "animal_name": "Pike (Northern Pike)",
        "max_size": 150,
        "max_weight": 25,
        "max_depth": 15,
        "other_names": ["Esox lucius"],
        "colors": ["#008000", "#FFFFFF"],
        "family": "Esocidae",
        "habitat": "Freshwater lakes and river mouths",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "lives alone",
        "locations": ["Bulgarian rivers", "Freshwater lakes"],
        "locations_description": "One of the predatory species fished in the inland waters of Bulgaria.",
        "description": "Pike (Esox lucius) is a freshwater predatory fish commonly found in rivers, lakes, and ponds across Europe, Asia, and North America. Typically measuring 40–120 cm in length and weighing 1–20 kg, pike has an elongated body, a pointed snout, and sharp teeth, which it uses to catch smaller fish. Its coloration is usually greenish with lighter, yellowish patterns for camouflage.\n\nPike is valued for its firm, white flesh, rich in protein and low in fat. It is commonly prepared grilled, baked, or smoked. As a top predator in freshwater ecosystems, pike plays an important role in maintaining the balance of fish populations. Sustainable fishing practices are essential to preserve healthy pike populations for the future.",
        "distribution_habitat": "Slow-flowing freshwaters, weedy areas.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1agiLwwHniyY8xUjlc5zBg6dPM03DWERg"]
      },
      {
        "id": 20,
        "3d_model": "https://sketchfab.com/models/21fd636ec9a94092b0a39c9f4f0428b5/embed",
        "type": "fish",
        "animal_name": "Perch (European Perch)",
        "max_size": 60,
        "max_weight": 4,
        "max_depth": 20,
        "other_names": ["Perca fluviatilis"],
        "colors": ["#3CB371", "#FFA500"],
        "family": "Percidae",
        "habitat": "Freshwater lakes, rivers",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "in small groups",
        "locations": ["Bulgarian ponds"],
        "locations_description": "Species frequently encountered in local fishing.",
        "description": "Perch (Perca fluviatilis) is a freshwater fish commonly found in rivers, lakes, and ponds across Europe and parts of Asia. Typically measuring 15–50 cm in length and weighing 0.2–2 kg, perch has a laterally compressed body with greenish-brown coloration and distinctive dark vertical stripes. It feeds on small fish, insects, and invertebrates.\n\nPerch is valued for its mild, white flesh and high protein content. It is commonly prepared grilled, fried, or baked in many cuisines. As a predatory fish, perch plays a key role in maintaining the balance of freshwater ecosystems. Sustainable fishing helps ensure healthy perch populations for future generations.",
        "distribution_habitat": "Freshwater lakes and non-current areas.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1O2BdQI7DuFdgO00G6d_77hKD9zH2GBVH"]
      },
      {
        "id": 21,
        "3d_model" : "https://sketchfab.com/3d-models/black-mussel-surface-macro-c710d5a183a547d8a999c721a2d906cf",
        "type": "creature",
        "animal_name": "Freshwater Mussel",
        "max_size": 10,
        "max_weight": 0.1,
        "max_depth": 5,
        "other_names": ["ANodonta cygnea"],
        "colors": ["#000000", "#A52A2A"],
        "family": "Unionidae",
        "habitat": "Freshwater lakes and streams",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "lives in groups",
        "locations": ["Bulgarian ponds"],
        "locations_description": "Plays a filtering role in freshwater ecosystems.",
        "description": "Freshwater Mussel is a bivalve mollusk found in rivers, lakes, and ponds worldwide. Typically, mussels attach themselves to rocks or sediment using strong byssal threads. They filter-feed on plankton and organic particles, playing an important role in maintaining water quality and ecosystem balance.\n\nFreshwater mussels are rich in protein and minerals, though they are less commonly consumed than marine mussels. They are also valued for their ecological role, providing habitat for other aquatic species and contributing to biodiversity. Protecting freshwater habitats is essential to preserve mussel populations and the overall health of aquatic ecosystems.",
        "distribution_habitat": "Freshwater bottoms, muddy grounds.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Pmy-CTIY3FyxAkdy8dJRsaEnwICSkOfI"]
      },
      {
        "id": 30,
        "3d_model" : "https://sketchfab.com/3d-models/deep-sea-sponge-4cd0e97040c9404e90d9645fc0f69aab",
        "type": "other",
        "animal_name": "Sea Sponge",
        "max_size": 40,
        "max_weight": 0.8,
        "max_depth": 50,
        "other_names": ["Porifera"],
        "colors": ["#FFFF00", "#A52A2A"],
        "family": "Porifera",
        "habitat": "Black Sea coasts, rocky bottoms",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "in colonies",
        "locations": ["Bulgarian Black Sea coast"],
        "locations_description": "Found on coastal rocks and bottom caves.",
        "description": "Sea Sponge is a simple, porous marine animal found in oceans worldwide, including the Mediterranean, Aegean, and Black Seas. They attach to rocks or the seabed and filter water to obtain nutrients, playing an important role in maintaining marine ecosystem health. Sea sponges come in various shapes, sizes, and colors, providing habitat and shelter for many small marine organisms.\n\nSea sponges have been used by humans for centuries, primarily for bathing, cleaning, and cosmetic purposes. They are rich in natural compounds that are also studied for potential medical applications. Protecting marine habitats ensures the survival of sponge populations and the species that depend on them.",
        "distribution_habitat": "Rocky and muddy bottom areas.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rjP7JFadGU4u366K3cBYzzoxFgv4FUUR"]
      },
      {
        "id": 31,
        "3d_model" : "https://sketchfab.com/3d-models/corals-d521ba70ae54457faea69294757b75b5",
        "type": "other",
        "animal_name": "Seagrass",
        "max_size": 60,
        "max_weight": 1.5,
        "max_depth": 10,
        "other_names": ["Zostera marina"],
        "colors": ["#008000"],
        "family": "Zosteraceae",
        "habitat": "Shallow coastal areas, sandy bottom",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "in colonies",
        "locations": ["Bulgarian Black Sea coast"],
        "locations_description": "Seen densely in coastal shallows, a food source for fish.",
        "description": "Marine Plants (Sea Plants) are photosynthetic organisms found in oceans and seas worldwide, including the Mediterranean, Aegean, and Black Seas. They include seagrasses, algae, and other aquatic plants that grow in shallow waters, anchoring themselves to the seabed or floating freely. Marine plants provide food, shelter, and oxygen for numerous marine species.\n\nMarine plants are rich in nutrients and play a crucial role in maintaining healthy marine ecosystems. They help prevent coastal erosion, absorb carbon dioxide, and support biodiversity. Protecting marine plants is essential to sustain ocean health and the countless species that depend on them.",
        "distribution_habitat": "Shallow and calm sea areas.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      }
    ]
  },
  {
    "country": "Greece",
    "animals": [
      {
        "id": 7,
        "3d_model": "https://sketchfab.com/models/a3d0e1a597794a9bb74739a13cfc8b77/embed",
        "type": "fish",
        "animal_name": "Gilthead Bream (Sparus aurata)",
        "max_size": 70,
        "max_weight": 7,
        "max_depth": 80,
        "other_names": ["Gilt-head Sea Bream", "Sparus aurata"],
        "colors": ["#C0C0C0", "#FFD700"],
        "family": "Sparidae",
        "habitat": "Rocky and sandy coasts of the Aegean and Mediterranean Seas, lagoons",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "in schools when young, more individual as adults",
        "locations": ["Coasts of Greek islands", "Aegean Sea"],
        "locations_description": "A fish commonly found and fished in restaurants in Greece.",
        "description": "Gilthead Bream (Sparus aurata) is a popular coastal fish found in the Mediterranean Sea, Aegean Sea, and eastern Atlantic Ocean. Typically measuring 20–50 cm in length and weighing 0.3–2 kg, gilthead bream has a silver body with a distinctive golden stripe between its eyes. It feeds on small invertebrates, crustaceans, and algae.\n\nRich in protein, vitamins, and minerals, gilthead bream is highly valued for its firm, flavorful flesh. In Mediterranean cuisine, it is commonly grilled, baked, or steamed. Fresh gilthead bream offers the best taste and nutritional benefits. Sustainable fishing is essential to preserve its natural populations for future generations.",
        "distribution_habitat": "Coastal rocky and sandy areas, lagoon mouths.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1yIXZXGjKKIsXpRLADY00k9G8OyASw6jA",
          "https://drive.google.com/uc?export=view&id=1_AkVeoIi2nt68BYwAPvlBj7Ym0NUEkVi"
        ]
      },
      {
        "id": 8,
        "3d_model": "https://sketchfab.com/models/fc781bee9c0e4378a109acc8b728a86b/embed",
        "type": "fish",
        "animal_name": "European Sea Bass (Dicentrarchus labrax)",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Sea Bass", "Dicentrarchus labrax"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Coastal seas, bays, lagoons",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "mostly individual",
        "locations": ["Greek shores", "Aegean Sea"],
        "locations_description": "A popular fish species in Greece that is both fished and farmed.",
        "description": "European Sea Bass (Dicentrarchus labrax) is a widely appreciated coastal fish found in the Mediterranean Sea, Black Sea, and eastern Atlantic Ocean. Typically measuring 30–60 cm in length and weighing 0.5–3 kg, it has a streamlined silver-gray body with a slightly darker back. European sea bass is a predatory fish, feeding on smaller fish, crustaceans, and mollusks.\n\nRich in high-quality protein, omega-3 fatty acids, vitamins, and minerals, it supports heart health and overall nutrition. It is commonly grilled, baked, or steamed in Mediterranean cuisine. Fresh European sea bass offers excellent flavor and nutritional value, and sustainable fishing practices are essential to maintain healthy populations.",
        "distribution_habitat": "Coastal rocky and sandy areas, shallow-moderate depths.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1q70Dggz_KoCODH27L_54BOJCYYk30kVk",
          "https://drive.google.com/uc?export=view&id=1VzCRvcoXi8JQJkMplm3l5vmF1-ssyw9x"
        ]
      },
      {
        "id": 9,
        "3d_model": "https://sketchfab.com/models/1ea0e1c187d743039463aa1477acb71e/embed",
        "type": "fish",
        "animal_name": "Mediterranean Parrotfish (Sparisoma cretense)",
        "max_size": 50,
        "max_weight": 3,
        "max_depth": 50,
        "other_names": ["Mediterranean parrotfish", "Sparisoma cretense"],
        "colors": ["#00CED1", "#FF0000"],
        "family": "Scaridae",
        "habitat": "Rocky reef areas, regions rich in macroalgae",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "lives in small groups",
        "locations": ["Aegean Sea rocky coasts", "Eastern Mediterranean"],
        "locations_description": "A reef fish found especially in rocky coastal systems in the Mediterranean.",
        "description": "Mediterranean Parrotfish are colorful marine fish found in the Mediterranean Sea. They are known for their strong beak-like teeth, which they use to graze on algae and scrape surfaces of rocks and coral reefs. Typically, they measure 15–35 cm in length and display vibrant colors that help them blend into their environment.\n\nParrotfish play a crucial role in maintaining reef health by controlling algal growth and contributing to sand production through their feeding habits. While not commonly consumed as food, they are admired for their beauty and ecological importance. Protecting their habitats is essential to preserve the biodiversity of Mediterranean marine ecosystems.",
        "distribution_habitat": "Rocky and algae-dense sections, shallow-moderate depths.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1AhAqpVxf7HBZafEwJGSvQKP6pQvG1swU",
          "https://drive.google.com/uc?export=view&id=183FJzwM5VBTnI3nzFqMjSm-36GR8lShF"
        ]
      },
      {
        "id": 22,
        "3d_model": "https://sketchfab.com/models/59f8a232fd794318bfff79bfe4e01213/embed",
        "type": "fish",
        "animal_name": "Red Mullet (Barbouni)",
        "max_size": 40,
        "max_weight": 1,
        "max_depth": 150,
        "other_names": ["Mullus barbatus", "Red Mullet"],
        "colors": ["#B22222", "#FFFFFF"],
        "family": "Mullidae",
        "habitat": "Aegean Sea coasts and sandy bottoms",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "in small groups",
        "locations": ["Aegean Sea"],
        "locations_description": "Common in the Mediterranean and eastern Atlantic coasts. Red mullet is a popular species in regional cuisines, prized for its tender, flavorful meat.",
        "description": "Red Mullet (Mullus barbatus / Mullus surmuletus) is a small, bottom-dwelling fish found in the Mediterranean Sea, Aegean Sea, and eastern Atlantic Ocean. Typically measuring 15–30 cm in length, red mullet has a reddish-pink body with two distinctive barbels under its chin, which it uses to detect food on the seabed. It feeds on small invertebrates, crustaceans, and worms.\n\nRed mullet is highly prized for its delicate, flavorful flesh and high protein content. In Mediterranean cuisine, it is commonly grilled, baked, or fried. Fresh red mullet offers the best taste and nutritional value. Sustainable fishing practices are important to preserve its natural populations and the health of marine ecosystems.",
        "distribution_habitat": "Lives in sandy and muddy seabeds of the Mediterranean and Black Seas, usually at depths between 10 and 100 meters.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1qCrfny8Obe07Sw3hNsomTy__lZRNLepu"]
      },
      {
        "id": 23,
        "3d_model": "https://sketchfab.com/models/2e7c02b1826a407dafc65be285fb3684/embed",
        "type": "fish",
        "animal_name": "Swordfish",
        "max_size": 450,
        "max_weight": 600,
        "max_depth": 800,
        "other_names": ["Xiphias gladius"],
        "colors": ["#191970", "#C0C0C0"],
        "family": "Xiphiidae",
        "habitat": "Open sea, Aegean and Mediterranean Seas",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "lives alone",
        "locations": ["Off the coast of Crete", "Aegean Sea"],
        "locations_description": "Widespread in tropical and temperate seas. Swordfish are apex predators, known for their long bills used to slash at prey, and play an essential role in pelagic ecosystems.",
        "description": "Swordfish (Xiphias gladius) is a large, migratory predatory fish found in oceans worldwide, including the Mediterranean Sea and the Atlantic Ocean. Typically measuring 1.5–3 meters in length and weighing 30–200 kg, swordfish has a long, flat, sword-like bill and a streamlined body, which it uses to hunt smaller fish and squid.\n\nSwordfish is highly valued for its firm, meaty flesh, rich in protein and low in fat. It is commonly grilled, baked, or seared in Mediterranean and international cuisines. Fresh swordfish offers excellent taste and nutritional benefits. Sustainable fishing practices are essential to protect swordfish populations and maintain oceanic ecosystem balance.",
        "distribution_habitat": "Found in open waters of the Atlantic, Mediterranean, and Indian Oceans. Prefers warm, deep waters and migrates seasonally.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Mcm71LNeIIO7KZggGx2GPPy3pUh60GE3"]
      },
      {
        "id": 24,
        "3d_model" : "https://sketchfab.com/3d-models/sea-snail-shell-6515f625857041ad87bb6e2e5e5f6206",
        "type": "creature",
        "animal_name": "Sea Snail",
        "max_size": 8,
        "max_weight": 0.1,
        "max_depth": 30,
        "other_names": ["Gastropoda"],
        "colors": ["#A52A2A", "#F5F5DC"],
        "family": "Gastropoda",
        "habitat": "Coastal rocks and seabed",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "lives alone",
        "locations": ["Aegean Sea"],
        "locations_description": "Common throughout the Mediterranean and Aegean Seas. Sea snails play an important role in cleaning the seabed and recycling nutrients within marine ecosystems.",
        "description": "Sea Snail (Marine Snail) is a small, slow-moving marine mollusk found in oceans worldwide, including the Mediterranean, Aegean, and Black Seas. It has a coiled shell that provides protection from predators and a soft body that it uses to move and feed on algae, detritus, or small invertebrates.\n\nSea snails are consumed in various cuisines, particularly in Mediterranean regions, for their tender, flavorful flesh. They also play an important ecological role by grazing on algae and contributing to the balance of marine ecosystems. Protecting their habitats is essential to sustain healthy populations and maintain marine biodiversity.",
        "distribution_habitat": "Lives in shallow coastal zones, rocky shores, and sandy seabeds, feeding on algae and detritus.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1hczsTgmq4_EjXk-zcpH30hiwaYYZB9Bj"]
      },
      {
        "id": 32,
        "3d_model" : "https://sketchfab.com/3d-models/corals-d521ba70ae54457faea69294757b75b5",
        "type": "other",
        "animal_name": "Coral",
        "max_size": 25,
        "max_weight": 1,
        "max_depth": 20,
        "other_names": ["Corallium rubrum"],
        "colors": ["#FF0000", "#FFA500"],
        "family": "Scleractinia",
        "habitat": "Aegean Sea coasts, rocky reefs",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "in colonies",
        "locations": ["Aegean Sea"],
        "locations_description": "Seen densely in rocky reefs.",
        "description": "Coral Fish are colorful and diverse species that inhabit coral reefs in tropical and subtropical seas. They vary widely in size, shape, and color, often displaying vibrant patterns that help them blend into the reef environment. Coral fish feed on algae, plankton, and small invertebrates, playing a crucial role in maintaining reef health.\n\nRich in protein and often low in fat, some species of coral fish are consumed locally, though they are more commonly admired for their beauty in marine ecosystems and aquariums. Protecting coral reefs is essential, as they rely on healthy reef habitats for shelter, breeding, and food.",
        "distribution_habitat": "Shallow rocky and reef areas.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1CTGsUj276H5Cx-28Gnc6xfCyVC_RmGgp"]
      },
      {
        "id": 33,
        "3d_model" : "https://sketchfab.com/3d-models/cartoon-seaweed-10-00d670cf071d498b9f20e6fe3e4fc347",
        "type": "other",
        "animal_name": "Seaweed",
        "max_size": 45,
        "max_weight": 1.2,
        "max_depth": 25,
        "other_names": ["Algae"],
        "colors": ["#008000", "#A52A2A"],
        "family": "Phaeophyceae",
        "habitat": "Coastal rocks, shallow sea areas",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "in colonies",
        "locations": ["Aegean Sea"],
        "locations_description": "Found throughout the Mediterranean, Aegean, and Black Seas. Marine plants provide oxygen, shelter, and food for countless marine organisms and help stabilize seabed sediments.",
        "description": "Seaweed (Marine Algae) are diverse marine plants found in oceans worldwide, including the Mediterranean, Aegean, and Black Seas. They grow attached to rocks or seabeds and come in various colors, including green, brown, and red. Seaweed provides food, shelter, and oxygen for numerous marine species.\n\nRich in vitamins, minerals, fiber, and antioxidants, seaweed is consumed in many cuisines, especially in Asia, and is also used in supplements, cosmetics, and fertilizers. Beyond its nutritional value, seaweed plays a vital role in marine ecosystems by supporting biodiversity and maintaining water quality.",
        "distribution_habitat": "Grows in shallow coastal waters with plenty of sunlight. Includes seagrasses and algae that thrive in nutrient-rich environments.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=17kDgX91KiYj9IN8LgtsMCP2TWn2tpqFc"]
      }
    ]
  },
  {
    "country": "Portugal",
    "animals": [
      {
        "id": 10,
        "3d_model": "https://sketchfab.com/models/d7a2d0bd2a524d35b01e0d898b026479/embed",
        "type": "fish",
        "animal_name": "Sardine",
        "max_size": 30,
        "max_weight": 0.3,
        "max_depth": 100,
        "other_names": ["Sardina pilchardus", "Sardinha"],
        "colors": ["#008080", "#C0C0C0"],
        "family": "Clupeidae",
        "habitat": "In schools in open sea and coastal waters",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "migration and feeding in dense schools",
        "locations": ["Portuguese Atlantic coast"],
        "locations_description": "One of the most consumed fish in Portugal",
        "description": "Sardine (Sardina pilchardus / Sardinops sagax) is a small, oily fish commonly found in the Mediterranean Sea, Atlantic Ocean, and other temperate waters. Typically measuring 15–25 cm in length and weighing around 0.1–0.2 kg, sardines have a slender, silver body with a bluish-green back. They usually swim in large schools and feed on plankton and small crustaceans.\n\nSardines are rich in omega-3 fatty acids, protein, vitamins, and minerals, supporting heart health and overall nutrition. In cuisine, they are commonly grilled, canned, or smoked. Fresh sardines offer the best flavor and nutritional benefits, and sustainable fishing practices are essential to preserve their populations.",
        "distribution_habitat": "Coastal open sea, migratory routes in schools, shallow and moderate depths.",
        "image_paths": ["images/sardine_pt1.png","images/sardine_pt2.png"]
      },
      {
        "id": 11,
        "3d_model": "https://sketchfab.com/models/a3d0e1a597794a9bb74739a13cfc8b77/embed",
        "type": "fish",
        "animal_name": "Gilthead Bream (Dourada / Gilthead Bream)",
        "max_size": 60,
        "max_weight": 5,
        "max_depth": 40,
        "other_names": ["Sparus aurata", "Dourada"],
        "colors": ["#C0C0C0", "#FFD700"],
        "family": "Sparidae",
        "habitat": "Coastal lagoons, estuary mouths, shallow sea",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "in schools during juvenile stage",
        "locations": ["Portuguese coasts"],
        "locations_description": "Commonly found throughout the Mediterranean and along European Atlantic coasts. Gilthead bream is a key species in local fisheries and aquaculture, contributing to both the economy and coastal marine ecosystems.",
        "description": "Gilthead Bream (Sparus aurata) is a popular coastal fish found in the Mediterranean Sea, Aegean Sea, and eastern Atlantic Ocean. Typically measuring 20–50 cm in length and weighing 0.3–2 kg, it has a silver body with a distinctive golden stripe between its eyes. Gilthead bream feeds on small invertebrates, crustaceans, and algae.\n\nRich in protein, vitamins, and minerals, it is highly valued for its firm, flavorful flesh. In Mediterranean cuisine, it is commonly grilled, baked, or steamed. Fresh gilthead bream offers excellent taste and nutritional benefits. Sustainable fishing is essential to preserve its natural populations for future generations.",
        "distribution_habitat": "Found in shallow coastal waters, lagoons, and estuaries of the Mediterranean Sea, Aegean Sea, and eastern Atlantic Ocean. Prefers sandy or muddy bottoms where it can forage for small invertebrates, crustaceans, and algae.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1yIXZXGjKKIsXpRLADY00k9G8OyASw6jA",
          "https://drive.google.com/uc?export=view&id=1_AkVeoIi2nt68BYwAPvlBj7Ym0NUEkVi"
        ]
      },
      {
        "id": 12,
        "3d_model": "https://sketchfab.com/models/fc781bee9c0e4378a109acc8b728a86b/embed",
        "type": "fish",
        "animal_name": "European Seabass (Robalo)",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Dicentrarchus labrax", "Robalo"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Coastal seas, river mouths",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "individual or in small groups",
        "locations": ["Portuguese Atlantic coasts"],
        "locations_description": "Widely distributed throughout the Mediterranean, Black Sea, and along European Atlantic coasts. European sea bass is an important species for both commercial and recreational fishing and plays a key role as a predator in coastal ecosystems.",
        "description": "European Sea Bass (Dicentrarchus labrax) is a widely appreciated coastal fish found in the Mediterranean Sea, Black Sea, and eastern Atlantic Ocean. Typically measuring 30–60 cm in length and weighing 0.5–3 kg, it has a streamlined silver-gray body with a slightly darker back. European sea bass is a predatory fish, feeding on smaller fish, crustaceans, and mollusks.\n\nRich in high-quality protein, omega-3 fatty acids, vitamins, and minerals, it supports heart health and overall nutrition. It is commonly grilled, baked, or steamed in Mediterranean cuisine. Fresh European sea bass offers excellent flavor and nutritional value, and sustainable fishing practices are essential to maintain healthy populations.",
        "distribution_habitat": "Found in coastal waters, estuaries, and lagoons of the Mediterranean Sea, Black Sea, and eastern Atlantic Ocean. Prefers shallow, sheltered areas with sandy or rocky bottoms where it can hunt smaller fish and crustaceans.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1q70Dggz_KoCODH27L_54BOJCYYk30kVk",
          "https://drive.google.com/uc?export=view&id=1VzCRvcoXi8JQJkMplm3l5vmF1-ssyw9x"
        ]      },
      {
        "id": 25,
        "3d_model": "https://sketchfab.com/models/e3860feecc4f4247826a2542f1770e92/embed",
        "type": "fish",
        "animal_name": "Atlantic Cod (Bacalhau)",
        "max_size": 150,
        "max_weight": 40,
        "max_depth": 600,
        "other_names": ["Gadus morhua", "Bacalhau"],
        "colors": ["#D2B48C", "#FFFFFF"],
        "family": "Gadidae",
        "habitat": "Deep waters of the Atlantic Ocean",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "in small schools",
        "locations": ["Off the coast of Portugal"],
        "locations_description": "Commonly found along the coasts of Norway, Iceland, and Canada. Atlantic cod is one of the most economically important fish species and a cornerstone of North Atlantic marine ecosystems.",
        "description": "Atlantic Cod (Gadus morhua) is a cold-water fish commonly found in the North Atlantic Ocean. Typically measuring 50–100 cm in length and weighing 2–20 kg, Atlantic cod has a robust, elongated body with a light brown to greenish coloration and a distinctive white lateral line. It feeds on smaller fish, crustaceans, and invertebrates.\n\nAtlantic cod is highly valued for its mild, flaky flesh, rich in protein and low in fat. It is commonly prepared baked, grilled, or fried. Cod plays an important role in marine ecosystems as a predator, and sustainable fishing practices are crucial to maintain healthy populations and protect ocean biodiversity.",
        "distribution_habitat": "Lives in cold and temperate waters of the North Atlantic, near the sea floor in sandy or muddy areas. Prefers depths between 20 and 200 meters.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Kk3xifAZ9iSkh2FSgnkAprLqv-IVdFGM"]
      },
      {
        "id": 26,
        "3d_model": "https://sketchfab.com/models/6dbfc4b0a1dd4f20b628475383cc11bc/embed",
        "type": "fish",
        "animal_name": "John Dory (Peixe-galo)",
        "max_size": 70,
        "max_weight": 5,
        "max_depth": 200,
        "other_names": ["Zeus faber", "Peixe-galo"],
        "colors": ["#FFD700", "#000000"],
        "family": "Zeidae",
        "habitat": "Atlantic coastal regions",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "roams alone",
        "locations": ["West coast of Portugal"],
        "locations_description": "Commonly found in the Mediterranean, Atlantic, and some temperate seas. John Dory finds ideal conditions for both fishing and reproduction in these regions and plays an important role as a predator in the marine ecosystem.",
        "description": "John Dory (Zeus faber) is a coastal fish found in the Mediterranean Sea, Atlantic Ocean, and other temperate waters. Typically measuring 30–65 cm in length and weighing 0.5–3 kg, John Dory has a laterally compressed, olive-green to brown body with a distinctive dark spot on each side. It feeds on smaller fish and invertebrates.\n\nJohn Dory is prized for its delicate, white flesh, rich in protein and low in fat. It is commonly prepared grilled, baked, or steamed in Mediterranean cuisine. Fresh John Dory offers excellent flavor and nutritional value. Sustainable fishing is important to preserve its natural populations for future generations.",
        "distribution_habitat": "Found in coastal shallows and open sea areas; generally prefers areas near sandy or muddy seabeds. This habitat provides an environment where it can easily catch prey and camouflage itself.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1uts6OHif0EpFz2hogdZOEpdipZFr85fi"]
      },
      {
        "id": 27,
        "3d_model" : "https://sketchfab.com/3d-models/deep-sea-sponge-4cd0e97040c9404e90d9645fc0f69aab",
        "type": "creature",
        "animal_name": "Sea Sponge",
        "max_size": 50,
        "max_weight": 1,
        "max_depth": 100,
        "other_names": ["Porifera"],
        "colors": ["#FFFF00", "#A52A2A"],
        "family": "Porifera",
        "habitat": "Rocky bottoms, coastal caves",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "lives in colonies",
        "locations": ["Atlantic coast", "Open sea rocks"],
        "locations_description": "Common along the Mediterranean and Aegean coasts, particularly near Portugal and Greece. Sea sponges filter water, providing essential ecosystem services and shelter for small marine species.",
        "description": "Sea Sponge is a simple, porous marine animal found in oceans worldwide, including the Mediterranean, Aegean, and Black Seas. Sea sponges attach to rocks or the seabed and filter water to obtain nutrients, playing an important role in maintaining healthy marine ecosystems. They come in various shapes, sizes, and colors, providing shelter for many small marine organisms.\n\nHumans have used sea sponges for centuries for bathing, cleaning, and cosmetic purposes. They also contain natural compounds studied for potential medical applications. Protecting marine habitats ensures the survival of sponge populations and the species that depend on them.",
        "distribution_habitat": "Inhabits rocky coastal areas and the sea floor, attaching to solid surfaces. Prefers clean, well-oxygenated waters with steady currents.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rjP7JFadGU4u366K3cBYzzoxFgv4FUUR"]
      },
      {
        "id": 35,
        "3d_model" : "https://sketchfab.com/3d-models/cartoon-seaweed-10-00d670cf071d498b9f20e6fe3e4fc347",
        "type": "other",
        "animal_name": "Seagrass",
        "max_size": 60,
        "max_weight": 1.5,
        "max_depth": 15,
        "other_names": ["Zostera marina"],
        "colors": ["#008000"],
        "family": "Zosteraceae",
        "habitat": "Shallow coastal areas, lagoons",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "in colonies",
        "locations": ["Portuguese coasts"],
        "locations_description": "Found in coastal shallows and forms an important habitat for fish and various invertebrates. These areas provide an ideal environment for both feeding and reproduction. Seagrass meadows offer both shelter and aid in concealing small organisms within the underwater ecosystem, thus supporting biodiversity.",
        "description": "Marine Plants (Sea Plants) are photosynthetic organisms found in oceans and seas worldwide, including the Mediterranean, Aegean, and Black Seas. They include seagrasses, algae, and other aquatic plants that grow in shallow waters, either anchored to the seabed or floating freely. Marine plants provide food, oxygen, and shelter for numerous marine species.\n\nRich in nutrients, marine plants play a crucial role in maintaining healthy marine ecosystems. They help prevent coastal erosion, absorb carbon dioxide, and support biodiversity. Protecting marine plants is essential for sustaining ocean health and the countless species that depend on them.",
        "distribution_habitat": "Found in shallow and calm sea areas; generally grows in coastal regions on rocky or sandy bottoms. These areas are suitable for receiving enough light and easily obtaining nutrients. Marine plants both produce oxygen and provide shelter for many small sea creatures within the underwater ecosystem.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      }
    ]
  }
]
