[
  {
    "id": 0,
    "sea_image" : "mediterranean_image",
    "sea_name": "Mediterranean Sea (Turkish Coast)",
    "area": "2,500,000 km² (total Mediterranean Sea)",
    "max_depth": 5267,
    "location": "The Southern and Southwestern coast of Turkey, extending from Muğla to Hatay",
    "main_fishes": [
      "European Anchovy (Engraulis encrasicolus)",
      "Bluefish (Pomatomus saltatrix)",
      "Red Mullet (Mullus surmuletus)",
      "Gilt-head Bream (Sparus aurata)"
    ],
    "main_species": [
      "Common Octopus (Octopus vulgaris)",
      "European Squid (Loligo vulgaris)",
      "Common Cuttlefish (Sepia officinalis)",
      "Edible Sea Urchin (Paracentrotus lividus)"
    ],
    "temperature_range": "13°C - 29°C",
    "salinity": "37 PSU",
    "currents": "Dominated by the Eastern Mediterranean Current and large-scale, persistent Cyprus Eddies in the Levantine Basin",
    "ecosystem": "A rich, warm temperate marine ecosystem characterized by vital coastal lagoons, dense Posidonia oceanica seagrass meadows, and complex rocky reefs supporting high biodiversity",
    "coastline_features": "Dramatic, steep rocky cliffs, wide stretches of sandy beaches, numerous river estuaries, and sheltered bays (e.g., Gulf of Antalya)",
    "important_ports": [
      "İzmir (Major commercial hub)",
      "Mersin (Largest port in the region)",
      "Antalya (Leading tourism and commercial port)"
    ],
    "economic_activities": [
      "Commercial and recreational fishing (primarily for pelagic species)",
      "International and coastal tourism (vital to the regional economy)",
      "Shipping and international maritime transport"
    ],
    "description": "The Turkish Mediterranean coast is a global biodiversity hotspot, constantly facing pressures from overfishing and coastal development. Its unique habitats, such as the *Posidonia* seagrass beds and deep-water coral communities, are crucial for numerous endemic and commercial species, supporting a complex marine food web. The region is also prone to the arrival of invasive Lessepsian species from the Red Sea.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1IuQP92XbL-EO0iAjmKF9n3WidvW7TK_D&export=view&authuser=0"
    ]
  },
  {
    "id": 1,
    "sea_image" : "black_sea_image",
    "sea_name": "Aegean Sea (Turkey, Greece Coast)",
    "area": "214,000 km²",
    "max_depth": 3543,
    "location": "Located between the Turkish mainland and the Greek peninsula, dotted with thousands of islands",
    "main_fishes": [
      "Sardine (Sardina pilchardus)",
      "European Hake (Merluccius merluccius)",
      "Gilt-head Bream (Sparus aurata)",
      "Red Mullet (Mullus surmuletus)"
    ],
    "main_species": [
      "Common Octopus (Octopus vulgaris)",
      "Common Cuttlefish (Sepia officinalis)",
      "Sea Star (Echinodermata species)",
      "Spiny Lobster (Palinurus species)"
    ],
    "temperature_range": "12°C - 27°C",
    "salinity": "36-38 PSU",
    "currents": "Characterized by the Cyclonic Aegean circulation pattern and strong, seasonal, wind-driven surface currents influencing nutrient distribution",
    "ecosystem": "A highly diverse, temperate marine ecosystem featuring a multitude of islands, extensive rocky reefs, and critical seagrass beds (Posidonia)",
    "coastline_features": "Jagged, rocky shores, numerous large and small islands (archipelago structure), deep sheltered bays, and river estuaries (e.g., Menderes)",
    "important_ports": [
      "Izmir (Major export/import terminal for Turkey)",
      "Thessaloniki (Northern Greek gateway port)",
      "Athens (Piraeus) (Largest passenger and cargo port in the Aegean)"
    ],
    "economic_activities": [
      "Commercial fishing (especially small pelagic species like sardines)",
      "Intense coastal and island tourism (crucial for local economies)",
      "Shipping and ferry transport between the islands and mainland"
    ],
    "description": "The Aegean Sea's complex bathymetry and high number of islands create distinct micro-ecosystems. It supports crucial small pelagic fish stocks and is a significant area for artisanal and small-scale fisheries. Its iconic beauty drives substantial coastal tourism, leading to conservation challenges.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1rjfxsGj7Jm15a-BvHEgJzjagCqex_Xod&export=view&authuser=0"
    ]
  },
  {
    "id": 2,
    "sea_image" : "black_sea_image",
    "sea_name": "Black Sea (Turkey, Bulgaria Coast)",
    "area": "436,000 km²",
    "max_depth": 2212,
    "location": "The Northern coast of Turkey, bordered by Bulgaria, Romania, Ukraine, Russia, and Georgia",
    "main_fishes": [
      "Anchovy (Engraulis encrasicolus)",
      "Sprat (Sprattus sprattus)",
      "Mullet (Mugilidae species)",
      "Turbot (Psetta maxima)"
    ],
    "main_species": [
      "Common Octopus (Octopus species, less common due to salinity)",
      "Squid (Loligo species, less abundant)",
      "Sea Cucumber (Holothuroidea species)",
      "Sturgeon (Acipenser species, critically endangered)"
    ],
    "temperature_range": "7°C - 27°C",
    "salinity": "17-18 PSU",
    "currents": "Dominated by the vigorous, basin-wide counterclockwise Rim Current flowing along the coastlines, isolating the central gyres",
    "ecosystem": "A semi-enclosed sea uniquely defined by a permanent halocline, creating an anoxic (oxygen-free) deep layer below 150-200m. Biologically productive surface waters support major commercial fisheries.",
    "coastline_features": "Long stretches of sandy beaches, significant river deltas (e.g., Danube), and varying coastal cliffs (e.g., Turkish coast)",
    "important_ports": [
      "Varna (Bulgaria's major seaport)",
      "Burgas (Key oil and industrial port)",
      "Istanbul (via the Bosporus Strait, connecting to the Marmara Sea)"
    ],
    "economic_activities": [
      "Mass commercial fishing (Anchovy fisheries are the most important regional activity)",
      "International shipping and energy transport",
      "Coastal tourism (popular in Bulgaria, Romania, and Turkey)"
    ],
    "description": "The Black Sea is ecologically sensitive due to its unique low salinity, anoxic deep water, and heavy influence from large European rivers. Anchovy fisheries are economically paramount but subject to high variability. Pollution and habitat degradation from river runoff and shipping pose major environmental threats.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1H5yw63uKr0lomlEqY-oU2BEU2ehvJhA5&export=view&authuser=0"
    ]
  },
  {
    "id": 3,
    "sea_name": "Atlantic Ocean (Portugal Coast)",
    "sea_image" : "atlantic_image",
    "area": "Open Atlantic off western Portugal",
    "max_depth": 8486,
    "location": "The entire western and southern coast of Portugal, bordering the North Atlantic Ocean",
    "main_fishes": [
      "Atlantic Cod (Gadus morhua - historically important)",
      "Sardine (Sardina pilchardus - cornerstone of local cuisine)",
      "Mackerel (Scomber scombrus)",
      "Bluefin Tuna (Thunnus thynnus - highly migratory and valuable)"
    ],
    "main_species": [
      "Common Octopus (Octopus vulgaris)",
      "European Squid (Loligo vulgaris)",
      "Edible Sea Urchin (Paracentrotus lividus)",
      "European Lobster (Homarus gammarus)"
    ],
    "temperature_range": "12°C - 22°C",
    "salinity": "35 PSU",
    "currents": "Influenced by the cold Portugal Current flowing south and the warmer North Atlantic Drift, creating dynamic conditions",
    "ecosystem": "A highly productive temperate shelf ecosystem, characterized by extensive rocky reefs, varied sandy bottoms, and seasonal coastal upwelling zones that bring cold, nutrient-rich water to the surface, supporting massive fish stocks",
    "coastline_features": "Dramatic, windswept rocky cliffs (e.g., Cabo da Roca), extensive sandy beaches, and important river estuaries (e.g., Tagus and Douro)",
    "important_ports": [
      "Lisbon (The largest and most important port for commerce and cruises)",
      "Porto (Key industrial and shipping hub in the north)",
      "Setúbal (Important for fishing and shipbuilding)"
    ],
    "economic_activities": [
      "Intensive fishing (especially for pelagic species like sardine and tuna)",
      "International shipping and maritime services (due to strategic Atlantic location)",
      "Coastal and surf tourism (along the entire coast)"
    ],
    "description": "Portugal's Atlantic coast is known for its highly productive marine environment driven by seasonal upwelling, making it one of the richest fishing grounds in Europe. The long tradition of cod (Bacalhau) consumption, despite the cod being caught primarily in the North Atlantic, is a defining cultural element. Sustainable management of local sardine and tuna stocks is a constant priority.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1wD-UGo_hVK3Jc2XUmw9GIll11CJuv5CU&export=view&authuser=0"
    ]
  }
]