[
  {
    "country": "Türkiye",
    "country_image": "turkey",
    "animals": [
      {
        "id": 0,
        "3d_model": "https://sketchfab.com/models/723309708e9e403c8808617386594851/embed",
        "type": "fish",
        "animal_name": "Anchova",
        "max_size": 20,
        "max_weight": 0.2,
        "max_depth": 200,
        "other_names": ["Engraulis encrasicolus", "Anchova do Mar Negro"],
        "colors": ["#607D8B", "#B0BEC5"],
        "family": "Engraulidae",
        "habitat": "Costas do Mar Negro, rotas de migração em mar aberto",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "migra em cardumes",
        "locations": ["Mar Negro", "Mar de Mármara"],
        "locations_description": "Comumente visto ao longo das costas da Turquia e mares adjacentes. As anchovas são vitais na cadeia alimentar marinha, servindo como presa para peixes maiores e aves marinhas, e são amplamente consumidas por humanos devido ao seu valor nutricional.",
        "description": "A Anchova (Engraulis encrasicolus) é um peixe pequeno e oleoso comumente encontrado nos mares Negro, Mármara e Egeu. Tipicamente medindo 10–20 cm de comprimento e pesando cerca de 0,1–0,2 kg, as anchovas têm um corpo prateado e esguio com dorso verde-azulado. Elas geralmente nadam em grandes cardumes e alimentam-se de plâncton e pequenos crustáceos.\n\nAs anchovas são ricas em ácidos graxos ômega-3, proteínas, vitaminas e minerais, apoiando a saúde cardíaca e nutrição geral. Na culinária turca, são especialmente populares no outono e inverno, frequentemente grelhadas, fritas ou usadas em conservas. Anchovas frescas oferecem o melhor sabor e valor nutricional. Práticas de pesca sustentável são importantes para preservar sua população natural.",
        "distribution_habitat": "Encontrada em águas costeiras e oceânicas do Mar Negro, Mármara e Egeu. Prefere áreas rasas com plâncton abundante para alimentação, frequentemente formando grandes cardumes para proteção e forrageamento eficiente.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1pHXHM179a8zu6XR9cS3tHqokq0wa0gWf",
          "https://drive.google.com/uc?export=view&id=1zqZFDOT8keqhheRJJqjuezqUDpQ1wyah"
        ]
      },
      {
        "id": 1,
        "3d_model": "https://sketchfab.com/models/e59ba168962348acaa739a000249b534/embed",
        "type": "fish",
        "animal_name": "Robalo Europeu",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Dicentrarchus labrax", "Robalo"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Costas do Egeu e Mediterrâneo, baías, lagoas",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "solitário ou em pequenos grupos",
        "locations": ["Mar Egeu", "Mar Mediterrâneo"],
        "locations_description": "Comum ao longo das costas ocidentais da Turquia, tanto através da pesca selvagem quanto da aquicultura.",
        "description": "O Robalo (Dicentrarchus labrax) é um peixe popular e nutritivo encontrado no Mar Mediterrâneo, Mar Egeu e ao longo das costas da Europa. Tipicamente medindo 30–60 cm de comprimento e pesando 0,5–3 kg, o robalo tem um corpo elegante e prateado-acinzentado com dorso ligeiramente mais escuro. É um peixe predador, alimentando-se de peixes menores e crustáceos.\n\nO robalo é rico em proteína de alta qualidade, ácidos graxos ômega-3, vitaminas e minerais, tornando-o benéfico para a saúde cardíaca e bem-estar geral. Na culinária turca e mediterrânea, é comumente grelhado, assado ou cozido no vapor. Robalo fresco oferece o melhor sabor e valor nutricional. A pesca sustentável garante que esta espécie valiosa permaneça abundante para as gerações futuras.",
        "distribution_habitat": "Áreas costeiras rochosas e arenosas, estuários, águas rasas a média profundidade.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1Jvyd4iPpBe3yRXRhAB3jdKIof6o8TuWI",
          "https://drive.google.com/uc?export=view&id=1KoQ8Jv_6zeL4jf_2DDB0NpkNwGaBVRv-"
        ]
      },
      {
        "id": 3,
        "3d_model": "https://sketchfab.com/models/9597628972c144f4a166a53c142cd9ca/embed",
        "type": "fish",
        "animal_name": "Bonito",
        "max_size": 90,
        "max_weight": 6,
        "max_depth": 300,
        "other_names": ["Sarda sarda", "Peixe bonito"],
        "colors": ["#1E90FF", "#C0C0C0"],
        "family": "Scombridae",
        "habitat": "Mar aberto, rotas de migração",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "migra e caça em cardumes",
        "locations": ["Mar de Mármara", "Mar Egeu"],
        "locations_description": "Uma espécie migratória intensamente pescada ao longo das costas turcas durante os meses de outono.",
        "description": "O Bonito (Sarda sarda) é um peixe oleoso saboroso e nutritivo comumente encontrado nos mares Negro, Mármara e Egeu. Tipicamente medindo 20–60 cm de comprimento e pesando 0,2–3 kg, o bonito tem um corpo superior azul-esverdeado escuro e parte inferior prateado-branca. Geralmente nada em cardumes e alimenta-se de plâncton e peixes pequenos.\n\nRico em ácidos graxos ômega-3, proteínas, vitaminas e minerais, o consumo regular de bonito apoia a saúde cardíaca e fortalece o sistema imunológico. Na culinária turca, é especialmente apreciado durante o outono e inverno, preparado grelhado, frito ou no vapor. Bonito fresco oferece o melhor sabor e nutrição. Práticas de pesca sustentável são essenciais para preservar sua população natural.",
        "distribution_habitat": "Mar aberto e zonas de transição costeira, águas de média a profunda.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1zaMhXPO4AtI1MIbu55zBfnaERO_Apd5-",
          "https://drive.google.com/uc?export=view&id=16VlhQGqjLkbKQ5SRmFVghawkc4m"
        ]
      },
      {
        "id": 13,
        "3d_model": "https://sketchfab.com/models/3cfe9d4021b14a5fad8372bcb490956b/embed",
        "type": "creature",
        "animal_name": "Medusa",
        "max_size": 30,
        "max_weight": 0.5,
        "max_depth": 50,
        "other_names": ["Aurelia aurita"],
        "colors": ["#FFFFFF", "#FFC0CB"],
        "family": "Ulmaridae",
        "habitat": "Mar aberto e águas costeiras",
        "poisonous": true,
        "edible": false,
        "danger_to_human": true,
        "social_behaviour": "forma grupos e flutua coletivamente",
        "locations": ["Mar Negro", "Mar Egeu"],
        "locations_description": "Comum nos mares Mediterrâneo e Egeu. As populações de medusas frequentemente aumentam no verão, desempenhando papéis tanto de predador quanto de presa nos ecossistemas marinhos.",
        "description": "As medusas são animais marinhos fascinantes encontrados em oceanos ao redor do mundo, incluindo os mares Mediterrâneo, Egeu e Negro. Elas têm um corpo mole e gelatinoso, frequentemente em forma de guarda-chuva, com tentáculos que podem picar para capturar presas. As medusas variam muito em tamanho, de alguns centímetros a mais de um metro de diâmetro.\n\nEmbora não sejam tipicamente consumidas em muitas dietas ocidentais, as medusas são uma fonte de proteína e são comidas em algumas cozinhas asiáticas. Elas desempenham um papel importante nos ecossistemas marinhos ao controlar as populações de plâncton e servir como alimento para animais marinhos maiores. Observar medusas pode ser hipnotizante, mas é aconselhável cautela devido às suas capacidades de ferrão.",
        "distribution_habitat": "Habita mares abertos e águas costeiras, flutuando com as correntes oceânicas. Prefere regiões temperadas a quentes com plâncton abundante.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1SVHv7w7LKfaFsxzhz_2la7JaZgRttbSZ"
        ]
      },
      {
        "id": 14,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Coral",
        "max_size": 15,
        "max_weight": 1,
        "max_depth": 10,
        "other_names": ["Coral"],
        "colors": ["#FF0000", "#FFA500", "#FFC0CB"],
        "family": "Scleractinia",
        "habitat": "Mares tropicais rasos",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "vive em colónias",
        "locations": ["Mar Mediterrâneo"],
        "locations_description": "Comum em partes do Mediterrâneo e Mar Vermelho. Os corais marinhos constroem habitats complexos que abrigam uma ampla gama de espécies marinhas e protegem as costas da erosão.",
        "description": "Os corais são organismos marinhos coloridos e diversos que habitam recifes de coral em mares tropicais e subtropicais. Eles variam amplamente em tamanho, forma e cor, frequentemente exibindo padrões vibrantes que os ajudam a se misturar no ambiente do recife. Os corais alimentam-se de plâncton e dependem de algas simbióticas para nutrientes, desempenhando um papel crucial na manutenção dos ecossistemas de recife.\n\nEmbora não sejam consumidos como alimento, os corais são vitais para a biodiversidade, fornecendo abrigo e locais de reprodução para inúmeras espécies marinhas. Proteger os recifes de coral é essencial para preservar a vida marinha e manter ecossistemas oceânicos saudáveis.",
        "distribution_habitat": "Encontrado em mares tropicais e subtropicais rasos e quentes, frequentemente formando recifes em substratos rochosos.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1HJHlC3eQc_xQFkK7JsmrwD-1DJYY8Xjc"
        ]
      },
      {
        "id": 16,
        "3d_model": "https://sketchfab.com/models/caeca42dbdaf4895aa69a88a2a1bbb72/embed",
        "type": "fish",
        "animal_name": "Carapau",
        "max_size": 35,
        "max_weight": 0.5,
        "max_depth": 250,
        "other_names": ["Trachurus trachurus", "Carapau do Mar Negro"],
        "colors": ["#C0C0C0", "#6B8E23"],
        "family": "Carangidae",
        "habitat": "Águas abertas do Mar Negro, Mar de Mármara e Mar Egeu",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "vive e migra em cardumes",
        "locations": ["Mar Negro", "Mar de Mármara"],
        "locations_description": "Comumente encontrado ao longo das costas da Turquia e mares vizinhos. O carapau desempenha um papel fundamental na cadeia alimentar marinha, servindo como presa para peixes maiores e aves marinhas, e é amplamente consumido por humanos pelo seu valor nutricional.",
        "description": "O Carapau (Trachurus trachurus) é um peixe oleoso amplamente distribuído encontrado nos mares Negro, Mármara e Egeu. Tipicamente medindo 20–40 cm de comprimento e pesando 0,2–1 kg, o carapau tem um corpo prateado aerodinâmico com dorso ligeiramente mais escuro. Geralmente nadam em grandes cardumes e alimentam-se de peixes pequenos, crustáceos e plâncton.\n\nO carapau é rico em ácidos graxos ômega-3, proteínas, vitaminas e minerais, tornando-o benéfico para a saúde cardíaca e nutrição geral. Na culinária turca, são comumente grelhados, fritos ou usados em ensopados. Carapau fresco oferece o melhor sabor e valor nutricional. Práticas de pesca sustentável são essenciais para manter suas populações naturais.",
        "distribution_habitat": "Águas costeiras e rotas de migração de média profundidade.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1LQLDFOtTVF_Ne1qffc4-R4hLK4_lIMND"
        ]
      },
      {
        "id": 17,
        "3d_model": "https://sketchfab.com/models/3c007d219b704a8abd5a8f3bd302642e/embed",
        "type": "fish",
        "animal_name": "Anchova-azul",
        "max_size": 110,
        "max_weight": 14,
        "max_depth": 200,
        "other_names": ["Pomatomus saltatrix"],
        "colors": ["#1E90FF", "#C0C0C0"],
        "family": "Pomatomidae",
        "habitat": "Águas abertas dos mares de Mármara, Egeu e Negro",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "caça em cardumes",
        "locations": ["Os Estreitos (Bósforo e Dardanelos)", "Mar Egeu"],
        "locations_description": "Famoso por passar pelos Estreitos (Bósforo e Dardanelos) durante períodos de migração.",
        "description": "A Anchova-azul (Pomatomus saltatrix) é um peixe predador popular e nutritivo encontrado nos mares Negro, Mármara e Egeu. Tipicamente medindo 30–50 cm de comprimento e pesando 0,5–2 kg, a anchova-azul tem um corpo aerodinâmico prateado-azul com dorso ligeiramente mais escuro. Nada em cardumes e alimenta-se de peixes menores e crustáceos.\n\nA anchova-azul é rica em ácidos graxos ômega-3, proteína de alta qualidade, vitaminas e minerais, apoiando a saúde cardíaca e nutrição geral. Na culinária turca, é comumente grelhada, frita ou assada, especialmente durante o outono quando é mais abundante. Anchova-azul fresca oferece o melhor sabor e valor nutricional. A pesca sustentável é importante para manter populações saudáveis para as gerações futuras.",
        "distribution_habitat": "Mar aberto e regiões costeiras.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1keiLq5vR5RNBz9roh4xmkKYEIwJJ_Oqr"
        ]
      },
      {
        "id": 18,
        "3d_model": "https://sketchfab.com/models/645b4a2217ef452581428e0510d7e607/embed",
        "type": "creature",
        "animal_name": "Estrela-do-mar",
        "max_size": 25,
        "max_weight": 0.3,
        "max_depth": 100,
        "other_names": ["Asteroidea"],
        "colors": ["#FFA500", "#800080", "#FF0000"],
        "family": "Asteroidea",
        "habitat": "Fundos marinhos rochosos dos mares Egeu e Mediterrâneo",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "vive sozinha",
        "locations": ["Mar Egeu"],
        "locations_description": "Frequentemente encontrada em fundos rochosos.",
        "description": "As estrelas-do-mar são invertebrados marinhos encontrados em oceanos ao redor do mundo, incluindo os mares Mediterrâneo, Egeu e Negro. Elas tipicamente têm um corpo em forma de estrela com cinco ou mais braços, que usam para se mover e capturar presas como moluscos. As estrelas-do-mar têm um sistema vascular aquático único que auxilia na locomoção e alimentação.\n\nEmbora não sejam comumente consumidas como alimento, as estrelas-do-mar desempenham um papel importante nos ecossistemas marinhos ao controlar populações de outros invertebrados e contribuir para a saúde dos recifes. Sua aparência fascinante e capacidades regenerativas—algumas espécies podem regenerar braços perdidos—tornam-nas um tema de interesse para a biologia marinha e entusiastas de aquários.",
        "distribution_habitat": "Rochas costeiras e fundo do mar.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1CQpLXxHjvlf7WTXHQ4OPOaJjWep872Sv"
        ]
      },
      {
        "id": 28,
        "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
        "type": "other",
        "animal_name": "Alga Marinha",
        "max_size": 50,
        "max_weight": 1,
        "max_depth": 30,
        "other_names": ["Alga", "Musgo Marinho"],
        "colors": ["#008000", "#8B4513"],
        "family": "Phaeophyceae",
        "habitat": "Costas dos mares Egeu e Mediterrâneo, fundos rochosos",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "em colónias",
        "locations": ["Mar Egeu", "Mar Mediterrâneo"],
        "locations_description": "Vista densamente em rochas costeiras.",
        "description": "As algas marinhas são plantas marinhas diversas encontradas em oceanos ao redor do mundo, incluindo os mares Mediterrâneo, Egeu e Negro. Elas crescem em águas rasas e fixam-se em rochas ou no fundo do mar. As algas marinhas vêm em várias cores—verde, marrom e vermelho—e fornecem habitat e alimento para muitas espécies marinhas.\n\nAs algas marinhas são altamente nutritivas, ricas em vitaminas, minerais, fibra e antioxidantes. São consumidas em muitas cozinhas, especialmente na Ásia, e também são usadas em suplementos, cosméticos e fertilizantes. Além de seu valor nutricional, as algas marinhas desempenham um papel vital nos ecossistemas marinhos ao produzir oxigênio, reduzir dióxido de carbono e apoiar a biodiversidade.",
        "distribution_habitat": "Áreas costeiras rasas, fundos rochosos e arenosos.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      },
      {
        "id": 29,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Coral",
        "max_size": 20,
        "max_weight": 1,
        "max_depth": 15,
        "other_names": ["Corallium rubrum"],
        "colors": ["#FF0000", "#FFA500"],
        "family": "Scleractinia",
        "habitat": "Costas mediterrâneas, rochas",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "em colónias",
        "locations": ["Mar Mediterrâneo"],
        "locations_description": "Forma colónias densas em rochas costeiras.",
        "description": "Os corais marinhos são invertebrados marinhos encontrados em oceanos tropicais e subtropicais, formando ecossistemas de recife vibrantes. Eles têm um esqueleto duro de carbonato de cálcio e vivem em colônias, criando estruturas complexas que fornecem abrigo e alimento para numerosas espécies marinhas.\n\nOs recifes de coral apoiam a biodiversidade e protegem as costas da erosão. Embora não sejam tipicamente consumidos como alimento, os corais são altamente valorizados por sua importância ecológica, beleza e uso em joalheria. Proteger os recifes de coral é crucial, pois as mudanças climáticas, a poluição e a pesca excessiva ameaçam sua sobrevivência e as inúmeras espécies que dependem deles.",
        "distribution_habitat": "Áreas rochosas rasas e protegidas.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1CTGsUj276H5Cx-28Gnc6xfCyVC_RmGgp"]
      }
    ]
  },
  {
    "country": "Bulgária",
    "country_image": "bulgaria",
    "animals": [
      {
        "id": 4,
        "3d_model": "https://sketchfab.com/models/ef0c406d4ca84242a0464abecb7d7037/embed",
        "type": "fish",
        "animal_name": "Carpa Comum (Cyprinus carpio)",
        "max_size": 120,
        "max_weight": 30,
        "max_depth": 10,
        "other_names": ["Carpa de água doce central", "Cyprinus carpio"],
        "colors": ["#8B4513", "#FFD700", "#A0522D"],
        "family": "Cyprinidae",
        "habitat": "Lagos de água doce, rios, reservatórios",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "em cardumes quando jovem, mais individual como adulto",
        "locations": ["Sistema fluvial Dolinata", "Lagos búlgaros"],
        "locations_description": "Uma das espécies de água doce comuns na Bulgária para aquicultura e pesca.",
        "description": "A Carpa Comum (Cyprinus carpio) é um peixe de água doce amplamente encontrado em rios, lagos e lagoas em toda a Europa, Ásia e outras regiões. Tipicamente medindo 40–80 cm de comprimento e pesando 2–14 kg, a carpa comum tem um corpo robusto e alongado coberto com grandes escamas, geralmente de cor marrom-dourada ou esverdeada. É um peixe onívoro, alimentando-se de plantas, insetos e pequenos invertebrados.\n\nA carpa comum é valorizada pelo seu alto teor de proteína e é comumente criada ou capturada para alimentação. Em muitas culturas, é preparada grelhada, assada ou defumada. Práticas de pesca e aquicultura sustentáveis são importantes para manter populações saudáveis, pois esta espécie adaptável desempenha um papel fundamental nos ecossistemas de água doce.",
        "distribution_habitat": "Rios de fluxo lento, lagos, reservatórios, margens ricas em vegetação.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1kGxpZaSBrNpuwl_Fq9U0HRcNhKNinR8J",
          "https://drive.google.com/uc?export=view&id=1ofPUNU6cVELQciQBXkHNfWr5dzDdsU1y"
        ]
      },
      {
        "id": 5,
        "3d_model": "https://sketchfab.com/models/caeca42dbdaf4895aa69a88a2a1bbb72/embed",
        "type": "fish",
        "animal_name": "Cavala (Scomber scombrus)",
        "max_size": 60,
        "max_weight": 2,
        "max_depth": 200,
        "other_names": ["Makrel", "Scomber scombrus"],
        "colors": ["#008080", "#C0C0C0"],
        "family": "Scombridae",
        "habitat": "Costas em mar aberto do Mar Negro",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "migra em cardumes",
        "locations": ["Costa búlgara do Mar Negro"],
        "locations_description": "Uma das espécies de peixes migratórios e oleosos comumente consumidos na Bulgária.",
        "description": "A Cavala (Scomber scombrus / Scomber japonicus) é um peixe oleoso popular encontrado no Oceano Atlântico, Mar Mediterrâneo e outras águas temperadas. Tipicamente medindo 20–60 cm de comprimento e pesando 0,2–3 kg, a cavala tem um corpo prateado aerodinâmico com dorso verde-azulado escuro. Nada em cardumes e alimenta-se de plâncton, peixes pequenos e crustáceos.\n\nRica em ácidos graxos ômega-3, proteínas, vitaminas e minerais, a cavala apoia a saúde cardíaca, função cerebral e nutrição geral. Na culinária, é comumente grelhada, defumada ou assada. Cavala fresca oferece o melhor sabor e valor nutricional, e práticas de pesca sustentável são essenciais para preservar suas populações naturais.",
        "distribution_habitat": "Mar aberto costeiro, rotas migratórias, profundidades moderadas.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1sB7adgM2bpufrcEy4-YDBxxB7e1b_YF6",
          "https://drive.google.com/uc?export=view&id=1FqCZO5pP8DCILMqN-LOYG19Q3tJU_zVE"
        ]
      },
      {
        "id": 6,
        "3d_model": "https://sketchfab.com/models/df09d2c1e3f34ebeb7dc957b3/embed",
        "type": "fish",
        "animal_name": "Rodovalho do Mar Negro (Psetta maxima maeotica)",
        "max_size": 70,
        "max_weight": 5,
        "max_depth": 100,
        "other_names": ["Rodovalho (Mar Negro)", "Psetta maxima"],
        "colors": ["#A52A2A", "#FFFFFF"],
        "family": "Scophthalmidae",
        "habitat": "Fundo do Mar Negro, fundos arenosos e lamacentos",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "vive sozinho",
        "locations": ["Costa búlgara do Mar Negro"],
        "locations_description": "Um tipo de peixe chato pescado ao longo da costa búlgara do Mar Negro.",
        "description": "O Rodovalho do Mar Negro (Scophthalmus maeoticus) é um peixe achatado e que vive no fundo encontrado no Mar Negro e no Mar de Mármara. Tipicamente medindo 30–70 cm de comprimento e pesando 1–5 kg, o rodovalho tem um corpo largo em forma de diamante com um lado superior marrom-arenoso que o ajuda a se misturar ao fundo do mar, e um lado inferior branco. Alimenta-se de peixes pequenos, crustáceos e outros invertebrados.\n\nO rodovalho é altamente valorizado por sua carne branca e firme, rica em proteína e com baixo teor de gordura. É comumente preparado grelhado, assado ou cozido no vapor na culinária mediterrânea e turca. Rodovalho fresco oferece excelente sabor e valor nutricional, e a pesca sustentável é importante para preservar sua população para as gerações futuras.",
        "distribution_habitat": "Fundos areia-lama, profundidades moderadas perto da costa, não em mar aberto.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rv06PB5pI8MqmS0Mu3idkn9EV5nKjY-U"]
      },
      {
        "id": 15,
        "3d_model": "https://sketchfab.com/models/2adc33a3a8c74a3c8759745c46c612ff/embed",
        "type": "creature",
        "animal_name": "Ouriço-do-mar",
        "max_size": 10,
        "max_weight": 0.2,
        "max_depth": 25,
        "other_names": ["Ouriço-do-mar"],
        "colors": ["#800080", "#A52A2A"],
        "family": "Echinoidea",
        "habitat": "Rochas costeiras e fundo do mar",
        "poisonous": true,
        "edible": true,
        "danger_to_human": true,
        "social_behaviour": "vive sozinho",
        "locations": ["Costa búlgara do Mar Negro"],
        "locations_description": "Generalizado nos mares Mediterrâneo e Egeu. Os ouriços-do-mar são pastadores importantes que ajudam a controlar o crescimento de algas e manter o equilíbrio ecológico.",
        "description": "O Ouriço-do-mar é um pequeno invertebrado marinho espinhoso encontrado em oceanos ao redor do mundo, incluindo os mares Mediterrâneo, Egeu e Negro. Eles têm uma concha dura e redonda coberta com espinhos móveis para proteção e locomoção. Os ouriços-do-mar alimentam-se principalmente de algas e desempenham um papel importante na manutenção do equilíbrio dos ecossistemas marinhos.\n\nOs ouriços-do-mar são considerados uma iguaria em muitas cozinhas, especialmente em pratos mediterrâneos e japoneses, valorizados por seu sabor rico e salgado e alto teor de proteína. Eles também contribuem para a biodiversidade marinha, fornecendo habitat e alimento para outras espécies. A colheita sustentável é essencial para proteger suas populações e preservar a saúde do ecossistema.",
        "distribution_habitat": "Encontrado em fundos marinhos rochosos e recifes de coral em águas rasas. Prefere áreas limpas e bem iluminadas onde as algas são abundantes.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1mhBTx13dz2-S2hl2u_WU0lv7EVCxxEBK"]
      },
      {
        "id": 19,
        "3d_model": "https://sketchfab.com/models/8974457120d143029d44bac83ffb273b/embed",
        "type": "fish",
        "animal_name": "Lúcio (Lúcio do Norte)",
        "max_size": 150,
        "max_weight": 25,
        "max_depth": 15,
        "other_names": ["Esox lucius"],
        "colors": ["#008000", "#FFFFFF"],
        "family": "Esocidae",
        "habitat": "Lagos de água doce e desembocaduras de rios",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "vive sozinho",
        "locations": ["Rios búlgaros", "Lagos de água doce"],
        "locations_description": "Uma das espécies predadoras pescadas nas águas interiores da Bulgária.",
        "description": "O Lúcio (Esox lucius) é um peixe predador de água doce comumente encontrado em rios, lagos e lagoas em toda a Europa, Ásia e América do Norte. Tipicamente medindo 40–120 cm de comprimento e pesando 1–20 kg, o lúcio tem um corpo alongado, um focinho pontiagudo e dentes afiados, que usa para capturar peixes menores. Sua coloração é geralmente esverdeada com padrões amarelados mais claros para camuflagem.\n\nO lúcio é valorizado por sua carne branca e firme, rica em proteína e com baixo teor de gordura. É comumente preparado grelhado, assado ou defumado. Como predador de topo em ecossistemas de água doce, o lúcio desempenha um papel importante na manutenção do equilíbrio das populações de peixes. Práticas de pesca sustentável são essenciais para preservar populações saudáveis de lúcio para o futuro.",
        "distribution_habitat": "Águas doces de fluxo lento, áreas com ervas daninhas.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1agiLwwHniyY8xUjlc5zBg6dPM03DWERg"]
      },
      {
        "id": 20,
        "3d_model": "https://sketchfab.com/models/21fd636ec9a94092b0a39c9f4f0428b5/embed",
        "type": "fish",
        "animal_name": "Perca (Perca Europeia)",
        "max_size": 60,
        "max_weight": 4,
        "max_depth": 20,
        "other_names": ["Perca fluviatilis"],
        "colors": ["#3CB371", "#FFA500"],
        "family": "Percidae",
        "habitat": "Lagos de água doce, rios",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "em pequenos grupos",
        "locations": ["Lagos búlgaros"],
        "locations_description": "Espécie frequentemente encontrada na pesca local.",
        "description": "A Perca (Perca fluviatilis) é um peixe de água doce comumente encontrado em rios, lagos e lagoas em toda a Europa e partes da Ásia. Tipicamente medindo 15–50 cm de comprimento e pesando 0,2–2 kg, a perca tem um corpo lateralmente comprimido com coloração marrom-esverdeada e listras verticais escuras distintas. Alimenta-se de peixes pequenos, insetos e invertebrados.\n\nA perca é valorizada por sua carne branca e suave e alto teor de proteína. É comumente preparada grelhada, frita ou assada em muitas cozinhas. Como peixe predador, a perca desempenha um papel fundamental na manutenção do equilíbrio dos ecossistemas de água doce. A pesca sustentável ajuda a garantir populações saudáveis de perca para as gerações futuras.",
        "distribution_habitat": "Lagos de água doce e áreas sem corrente.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1O2BdQI7DuFdgO00G6d_77hKD9zH2GBVH"]
      },
      {
        "id": 21,
        "3d_model": "https://sketchfab.com/models/c710d5a183a547d8a999c721a2d906cf/embed",
        "type": "creature",
        "animal_name": "Mexilhão de Água Doce",
        "max_size": 10,
        "max_weight": 0.1,
        "max_depth": 5,
        "other_names": ["Anodonta cygnea"],
        "colors": ["#000000", "#A52A2A"],
        "family": "Unionidae",
        "habitat": "Lagos e riachos de água doce",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "vive em grupos",
        "locations": ["Lagos búlgaros"],
        "locations_description": "Desempenha um papel filtrante nos ecossistemas de água doce.",
        "description": "O Mexilhão de Água Doce é um molusco bivalve encontrado em rios, lagos e lagoas em todo o mundo. Tipicamente, os mexilhões fixam-se a rochas ou sedimentos usando fortes fios bissais. Eles alimentam-se por filtração de plâncton e partículas orgânicas, desempenhando um papel importante na manutenção da qualidade da água e do equilíbrio do ecossistema.\n\nOs mexilhões de água doce são ricos em proteínas e minerais, embora sejam menos consumidos do que os mexilhões marinhos. Eles também são valorizados por seu papel ecológico, fornecendo habitat para outras espécies aquáticas e contribuindo para a biodiversidade. Proteger os habitats de água doce é essencial para preservar as populações de mexilhões e a saúde geral dos ecossistemas aquáticos.",
        "distribution_habitat": "Fundos de água doce, terrenos lamacentos.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Pmy-CTIY3FyxAkdy8dJRsaEnwICSkOfI"]
      },
      {
        "id": 30,
        "3d_model": "https://sketchfab.com/models/4cd0e97040c9404e90d9645fc0f69aab/embed",
        "type": "other",
        "animal_name": "Esponja Marinha",
        "max_size": 40,
        "max_weight": 0.8,
        "max_depth": 50,
        "other_names": ["Porifera"],
        "colors": ["#FFFF00", "#A52A2A"],
        "family": "Porifera",
        "habitat": "Costas do Mar Negro, fundos rochosos",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "em colónias",
        "locations": ["Costa búlgara do Mar Negro"],
        "locations_description": "Encontrada em rochas costeiras e cavernas de fundo.",
        "description": "A Esponja Marinha é um animal marinho simples e poroso encontrado em oceanos ao redor do mundo, incluindo os mares Mediterrâneo, Egeu e Negro. Elas fixam-se a rochas ou ao fundo do mar e filtram água para obter nutrientes, desempenhando um papel importante na manutenção da saúde do ecossistema marinho. As esponjas marinhas vêm em várias formas, tamanhos e cores, fornecendo habitat e abrigo para muitos pequenos organismos marinhos.\n\nAs esponjas marinhas têm sido usadas por humanos há séculos, principalmente para banho, limpeza e fins cosméticos. Elas são ricas em compostos naturais que também são estudados para potenciais aplicações médicas. Proteger os habitats marinhos garante a sobrevivência das populações de esponjas e das espécies que dependem delas.",
        "distribution_habitat": "Áreas de fundo rochoso e lamacento.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rjP7JFadGU4u366K3cBYzzoxFgv4FUUR"]
      },
      {
        "id": 31,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Erva Marinha",
        "max_size": 60,
        "max_weight": 1.5,
        "max_depth": 10,
        "other_names": ["Zostera marina"],
        "colors": ["#008000"],
        "family": "Zosteraceae",
        "habitat": "Áreas costeiras rasas, fundo arenoso",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "em colónias",
        "locations": ["Costa búlgara do Mar Negro"],
        "locations_description": "Vista densamente em águas costeiras rasas, uma fonte de alimento para peixes.",
        "description": "As Plantas Marinhas são organismos fotossintéticos encontrados em oceanos e mares ao redor do mundo, incluindo os mares Mediterrâneo, Egeu e Negro. Elas incluem ervas marinhas, algas e outras plantas aquáticas que crescem em águas rasas, ancorando-se ao fundo do mar ou flutuando livremente. As plantas marinhas fornecem alimento, abrigo e oxigênio para numerosas espécies marinhas.\n\nAs plantas marinhas são ricas em nutrientes e desempenham um papel crucial na manutenção de ecossistemas marinhos saudáveis. Elas ajudam a prevenir a erosão costeira, absorvem dióxido de carbono e apoiam a biodiversidade. Proteger as plantas marinhas é essencial para sustentar a saúde dos oceanos e as inúmeras espécies que dependem delas.",
        "distribution_habitat": "Áreas marinhas rasas e calmas.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      }
    ]
  },
  {
    "country": "Grécia",
    "country_image": "greece",
    "animals": [
      {
        "id": 7,
        "3d_model": "https://sketchfab.com/models/a3d0e1a597794a9bb74739a13cfc8b77/embed",
        "type": "fish",
        "animal_name": "Dourada (Sparus aurata)",
        "max_size": 70,
        "max_weight": 7,
        "max_depth": 80,
        "other_names": ["Dourada", "Sparus aurata"],
        "colors": ["#C0C0C0", "#FFD700"],
        "family": "Sparidae",
        "habitat": "Costas rochosas e arenosas dos mares Egeu e Mediterrâneo, lagoas",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "em cardumes quando jovem, mais individual como adulto",
        "locations": ["Costas das ilhas gregas", "Mar Egeu"],
        "locations_description": "Um peixe comumente encontrado e pescado em restaurantes na Grécia.",
        "description": "A Dourada (Sparus aurata) é um peixe costeiro popular encontrado no Mar Mediterrâneo, Mar Egeu e Oceano Atlântico oriental. Tipicamente medindo 20–50 cm de comprimento e pesando 0,3–2 kg, a dourada tem um corpo prateado com uma faixa dourada distinta entre os olhos. Alimenta-se de pequenos invertebrados, crustáceos e algas.\n\nRica em proteínas, vitaminas e minerais, a dourada é altamente valorizada por sua carne firme e saborosa. Na culinária mediterrânea, é comumente grelhada, assada ou cozida no vapor. Dourada fresca oferece o melhor sabor e benefícios nutricionais. A pesca sustentável é essencial para preservar suas populações naturais para as gerações futuras.",
        "distribution_habitat": "Áreas costeiras rochosas e arenosas, desembocaduras de lagoas.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1yIXZXGjKKIsXpRLADY00k9G8OyASw6jA",
          "https://drive.google.com/uc?export=view&id=1_AkVeoIi2nt68BYwAPvlBj7Ym0NUEkVi"
        ]
      },
      {
        "id": 8,
        "3d_model": "https://sketchfab.com/models/fc781bee9c0e4378a109acc8b728a86b/embed",
        "type": "fish",
        "animal_name": "Robalo Europeu (Dicentrarchus labrax)",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Robalo", "Dicentrarchus labrax"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Mares costeiros, baías, lagoas",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "maioritariamente individual",
        "locations": ["Costas gregas", "Mar Egeu"],
        "locations_description": "Uma espécie de peixe popular na Grécia que é tanto pescada quanto criada.",
        "description": "O Robalo Europeu (Dicentrarchus labrax) é um peixe costeiro amplamente apreciado encontrado no Mar Mediterrâneo, Mar Negro e Oceano Atlântico oriental. Tipicamente medindo 30–60 cm de comprimento e pesando 0,5–3 kg, tem um corpo aerodinâmico prateado-acinzentado com dorso ligeiramente mais escuro. O robalo europeu é um peixe predador, alimentando-se de peixes menores, crustáceos e moluscos.\n\nRico em proteína de alta qualidade, ácidos graxos ômega-3, vitaminas e minerais, apoia a saúde cardíaca e nutrição geral. É comumente grelhado, assado ou cozido no vapor na culinária mediterrânea. Robalo europeu fresco oferece excelente sabor e valor nutricional, e práticas de pesca sustentável são essenciais para manter populações saudáveis.",
        "distribution_habitat": "Áreas costeiras rochosas e arenosas, profundidades rasas a moderadas.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1q70Dggz_KoCODH27L_54BOJCYYk30kVk",
          "https://drive.google.com/uc?export=view&id=1VzCRvcoXi8JQJkMplm3l5vmF1-ssyw9x"
        ]
      },
      {
        "id": 9,
        "3d_model": "https://sketchfab.com/models/1ea0e1c187d743039463aa1477acb71e/embed",
        "type": "fish",
        "animal_name": "Peixe-Papagaio Mediterrâneo (Sparisoma cretense)",
        "max_size": 50,
        "max_weight": 3,
        "max_depth": 50,
        "other_names": ["Peixe-papagaio mediterrâneo", "Sparisoma cretense"],
        "colors": ["#00CED1", "#FF0000"],
        "family": "Scaridae",
        "habitat": "Áreas de recife rochoso, regiões ricas em macroalgas",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "vive em pequenos grupos",
        "locations": ["Costas rochosas do Mar Egeu", "Mediterrâneo Oriental"],
        "locations_description": "Um peixe de recife encontrado especialmente em sistemas costeiros rochosos no Mediterrâneo.",
        "description": "Os peixes-papagaio mediterrâneos são peixes marinhos coloridos encontrados no Mar Mediterrâneo. Eles são conhecidos por seus dentes fortes semelhantes a bicos, que usam para pastar em algas e raspar superfícies de rochas e recifes de coral. Tipicamente, medem 15–35 cm de comprimento e exibem cores vibrantes que os ajudam a se misturar ao seu ambiente.\n\nOs peixes-papagaio desempenham um papel crucial na manutenção da saúde dos recifes ao controlar o crescimento de algas e contribuir para a produção de areia através de seus hábitos alimentares. Embora não sejam comumente consumidos como alimento, são admirados por sua beleza e importância ecológica. Proteger seus habitats é essencial para preservar a biodiversidade dos ecossistemas marinhos mediterrâneos.",
        "distribution_habitat": "Seções rochosas e densas em algas, profundidades rasas a moderadas.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1AhAqpVxf7HBZafEwJGSvQKP6pQvG1swU",
          "https://drive.google.com/uc?export=view&id=183FJzwM5VBTnI3nzFqMjSm-36GR8lShF"
        ]
      },
      {
        "id": 22,
        "3d_model": "https://sketchfab.com/models/59f8a232fd794318bfff79bfe4e01213/embed",
        "type": "fish",
        "animal_name": "Salmonete (Barbouni)",
        "max_size": 40,
        "max_weight": 1,
        "max_depth": 150,
        "other_names": ["Mullus barbatus", "Salmonete"],
        "colors": ["#B22222", "#FFFFFF"],
        "family": "Mullidae",
        "habitat": "Costas do Mar Egeu e fundos arenosos",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "em pequenos grupos",
        "locations": ["Mar Egeu"],
        "locations_description": "Comum nas costas do Mediterrâneo e Atlântico oriental. O salmonete é uma espécie popular nas cozinhas regionais, apreciado por sua carne tenra e saborosa.",
        "description": "O Salmonete (Mullus barbatus / Mullus surmuletus) é um peixe pequeno que vive no fundo encontrado no Mar Mediterrâneo, Mar Egeu e Oceano Atlântico oriental. Tipicamente medindo 15–30 cm de comprimento, o salmonete tem um corpo rosado-avermelhado com dois barbilhões distintos sob o queixo, que usa para detectar alimentos no fundo do mar. Alimenta-se de pequenos invertebrados, crustáceos e vermes.\n\nO salmonete é altamente apreciado por sua carne delicada e saborosa e alto teor de proteína. Na culinária mediterrânea, é comumente grelhado, assado ou frito. Salmonete fresco oferece o melhor sabor e valor nutricional. Práticas de pesca sustentável são importantes para preservar suas populações naturais e a saúde dos ecossistemas marinhos.",
        "distribution_habitat": "Vive em fundos marinhos arenosos e lamacentos do Mediterrâneo e Mar Negro, geralmente a profundidades entre 10 e 100 metros.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1qCrfny8Obe07Sw3hNsomTy__lZRNLepu"]
      },
      {
        "id": 23,
        "3d_model": "https://sketchfab.com/models/2e7c02b1826a407dafc65be285fb3684/embed",
        "type": "fish",
        "animal_name": "Espadarte",
        "max_size": 450,
        "max_weight": 600,
        "max_depth": 800,
        "other_names": ["Xiphias gladius"],
        "colors": ["#191970", "#C0C0C0"],
        "family": "Xiphiidae",
        "habitat": "Mar aberto, mares Egeu e Mediterrâneo",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "vive sozinho",
        "locations": ["Ao largo da costa de Creta", "Mar Egeu"],
        "locations_description": "Generalizado em mares tropicais e temperados. Os espadartes são predadores ápice, conhecidos por seus longos bicos usados para golpear presas, e desempenham um papel essencial nos ecossistemas pelágicos.",
        "description": "O Espadarte (Xiphias gladius) é um grande peixe predador migratório encontrado em oceanos ao redor do mundo, incluindo o Mar Mediterrâneo e o Oceano Atlântico. Tipicamente medindo 1,5–3 metros de comprimento e pesando 30–200 kg, o espadarte tem um bico longo, achatado e semelhante a uma espada e um corpo aerodinâmico, que usa para caçar peixes menores e lulas.\n\nO espadarte é altamente valorizado por sua carne firme e carnuda, rica em proteína e com baixo teor de gordura. É comumente grelhado, assado ou selado nas cozinhas mediterrânea e internacional. Espadarte fresco oferece excelente sabor e benefícios nutricionais. Práticas de pesca sustentável são essenciais para proteger as populações de espadarte e manter o equilíbrio do ecossistema oceânico.",
        "distribution_habitat": "Encontrado em águas abertas do Atlântico, Mediterrâneo e Oceanos Índico. Prefere águas quentes e profundas e migra sazonalmente.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Mcm71LNeIIO7KZggGx2GPPy3pUh60GE3"]
      },
      {
        "id": 24,
        "3d_model": "https://sketchfab.com/models/6515f625857041ad87bb6e2e5e5f6206/embed",
        "type": "creature",
        "animal_name": "Caracol-do-mar",
        "max_size": 8,
        "max_weight": 0.1,
        "max_depth": 30,
        "other_names": ["Gastropoda"],
        "colors": ["#A52A2A", "#F5F5DC"],
        "family": "Gastropoda",
        "habitat": "Rochas costeiras e fundo do mar",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "vive sozinho",
        "locations": ["Mar Egeu"],
        "locations_description": "Comum em todo o Mediterrâneo e mares Egeu. Os caracóis-do-mar desempenham um papel importante na limpeza do fundo do mar e na reciclagem de nutrientes nos ecossistemas marinhos.",
        "description": "O Caracol-do-mar é um pequeno molusco marinho de movimento lento encontrado em oceanos ao redor do mundo, incluindo os mares Mediterrâneo, Egeu e Negro. Tem uma concha enrolada que fornece proteção contra predadores e um corpo mole que usa para se mover e alimentar-se de algas, detritos ou pequenos invertebrados.\n\nOs caracóis-do-mar são consumidos em várias cozinhas, particularmente em regiões mediterrâneas, por sua carne tenra e saborosa. Eles também desempenham um papel ecológico importante ao pastar em algas e contribuir para o equilíbrio dos ecossistemas marinhos. Proteger seus habitats é essencial para sustentar populações saudáveis e manter a biodiversidade marinha.",
        "distribution_habitat": "Vive em zonas costeiras rasas, costas rochosas e fundos marinhos arenosos, alimentando-se de algas e detritos.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1hczsTgmq4_EjXk-zcpH30hiwaYYZB9Bj"]
      },
      {
        "id": 32,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Coral",
        "max_size": 25,
        "max_weight": 1,
        "max_depth": 20,
        "other_names": ["Corallium rubrum"],
        "colors": ["#FF0000", "#FFA500"],
        "family": "Scleractinia",
        "habitat": "Costas do Mar Egeu, recifes rochosos",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "em colónias",
        "locations": ["Mar Egeu"],
        "locations_description": "Vista densamente em recifes rochosos.",
        "description": "Os peixes de coral são espécies coloridas e diversas que habitam recifes de coral em mares tropicais e subtropicais. Eles variam amplamente em tamanho, forma e cor, frequentemente exibindo padrões vibrantes que os ajudam a se misturar no ambiente do recife. Os peixes de coral alimentam-se de algas, plâncton e pequenos invertebrados, desempenhando um papel crucial na manutenção da saúde do recife.\n\nRicos em proteína e frequentemente com baixo teor de gordura, algumas espécies de peixes de coral são consumidas localmente, embora sejam mais comumente admiradas por sua beleza em ecossistemas marinhos e aquários. Proteger os recifes de coral é essencial, pois eles dependem de habitats de recife saudáveis para abrigo, reprodução e alimento.",
        "distribution_habitat": "Áreas rochosas rasas e de recife.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1CTGsUj276H5Cx-28Gnc6xfCyVC_RmGgp"]
      },
      {
        "id": 33,
        "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
        "type": "other",
        "animal_name": "Alga Marinha",
        "max_size": 45,
        "max_weight": 1.2,
        "max_depth": 25,
        "other_names": ["Alga"],
        "colors": ["#008000", "#A52A2A"],
        "family": "Phaeophyceae",
        "habitat": "Rochas costeiras, áreas marinhas rasas",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "em colónias",
        "locations": ["Mar Egeu"],
        "locations_description": "Encontrada em todo o Mediterrâneo, mares Egeu e Negro. As plantas marinhas fornecem oxigênio, abrigo e alimento para inúmeros organismos marinhos e ajudam a estabilizar sedimentos do fundo do mar.",
        "description": "As algas marinhas são plantas marinhas diversas encontradas em oceanos ao redor do mundo, incluindo os mares Mediterrâneo, Egeu e Negro. Elas crescem fixadas a rochas ou fundos marinhos e vêm em várias cores, incluindo verde, marrom e vermelho. As algas marinhas fornecem alimento, abrigo e oxigênio para numerosas espécies marinhas.\n\nRicas em vitaminas, minerais, fibra e antioxidantes, as algas marinhas são consumidas em muitas cozinhas, especialmente na Ásia, e também são usadas em suplementos, cosméticos e fertilizantes. Além de seu valor nutricional, as algas marinhas desempenham um papel vital nos ecossistemas marinhos ao apoiar a biodiversidade e manter a qualidade da água.",
        "distribution_habitat": "Cresce em águas costeiras rasas com bastante luz solar. Inclui ervas marinhas e algas que prosperam em ambientes ricos em nutrientes.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=17kDgX91KiYj9IN8LgtsMCP2TWn2tpqFc"]
      }
    ]
  },
  {
    "country": "Portugal",
    "country_image": "portugal",
    "animals": [
      {
        "id": 10,
        "3d_model": "https://sketchfab.com/models/d7a2d0bd2a524d35b01e0d898b026479/embed",
        "type": "fish",
        "animal_name": "Sardinha",
        "max_size": 30,
        "max_weight": 0.3,
        "max_depth": 100,
        "other_names": ["Sardina pilchardus", "Sardinha"],
        "colors": ["#008080", "#C0C0C0"],
        "family": "Clupeidae",
        "habitat": "Em cardumes em mar aberto e águas costeiras",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "migração e alimentação em cardumes densos",
        "locations": ["Costa atlântica portuguesa"],
        "locations_description": "Um dos peixes mais consumidos em Portugal",
        "description": "A Sardinha (Sardina pilchardus / Sardinops sagax) é um peixe pequeno e oleoso comumente encontrado no Mar Mediterrâneo, Oceano Atlântico e outras águas temperadas. Tipicamente medindo 15–25 cm de comprimento e pesando cerca de 0,1–0,2 kg, as sardinhas têm um corpo prateado esguio com dorso verde-azulado. Geralmente nadam em grandes cardumes e alimentam-se de plâncton e pequenos crustáceos.\n\nAs sardinhas são ricas em ácidos graxos ômega-3, proteínas, vitaminas e minerais, apoiando a saúde cardíaca e nutrição geral. Na culinária, são comumente grelhadas, enlatadas ou defumadas. Sardinhas frescas oferecem o melhor sabor e benefícios nutricionais, e práticas de pesca sustentável são essenciais para preservar suas populações.",
        "distribution_habitat": "Mar aberto costeiro, rotas migratórias em cardumes, profundidades rasas e moderadas.",
        "image_paths": ["images/sardine_pt1.png", "images/sardine_pt2.png"]
      },
      {
        "id": 11,
        "3d_model": "https://sketchfab.com/models/a3d0e1a597794a9bb74739a13cfc8b77/embed",
        "type": "fish",
        "animal_name": "Dourada",
        "max_size": 60,
        "max_weight": 5,
        "max_depth": 40,
        "other_names": ["Sparus aurata", "Dourada"],
        "colors": ["#C0C0C0", "#FFD700"],
        "family": "Sparidae",
        "habitat": "Lagoas costeiras, desembocaduras de estuários, mar raso",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "em cardumes durante estágio juvenil",
        "locations": ["Costas portuguesas"],
        "locations_description": "Comumente encontrada em todo o Mediterrâneo e ao longo das costas atlânticas europeias. A dourada é uma espécie fundamental nas pescas locais e aquicultura, contribuindo tanto para a economia quanto para os ecossistemas marinhos costeiros.",
        "description": "A Dourada (Sparus aurata) é um peixe costeiro popular encontrado no Mar Mediterrâneo, Mar Egeu e Oceano Atlântico oriental. Tipicamente medindo 20–50 cm de comprimento e pesando 0,3–2 kg, tem um corpo prateado com uma faixa dourada distinta entre os olhos. A dourada alimenta-se de pequenos invertebrados, crustáceos e algas.\n\nRica em proteínas, vitaminas e minerais, é altamente valorizada por sua carne firme e saborosa. Na culinária mediterrânea, é comumente grelhada, assada ou cozida no vapor. Dourada fresca oferece excelente sabor e benefícios nutricionais. A pesca sustentável é essencial para preservar suas populações naturais para as gerações futuras.",
        "distribution_habitat": "Encontrada em águas costeiras rasas, lagoas e estuários do Mar Mediterrâneo, Mar Egeu e Oceano Atlântico oriental. Prefere fundos arenosos ou lamacentos onde pode forragear pequenos invertebrados, crustáceos e algas.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1yIXZXGjKKIsXpRLADY00k9G8OyASw6jA",
          "https://drive.google.com/uc?export=view&id=1_AkVeoIi2nt68BYwAPvlBj7Ym0NUEkVi"
        ]
      },
      {
        "id": 12,
        "3d_model": "https://sketchfab.com/models/fc781bee9c0e4378a109acc8b728a86b/embed",
        "type": "fish",
        "animal_name": "Robalo",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Dicentrarchus labrax", "Robalo"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Mares costeiros, desembocaduras de rios",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "individual ou em pequenos grupos",
        "locations": ["Costas atlânticas portuguesas"],
        "locations_description": "Amplamente distribuído em todo o Mediterrâneo, Mar Negro e ao longo das costas atlânticas europeias. O robalo europeu é uma espécie importante tanto para a pesca comercial quanto recreativa e desempenha um papel fundamental como predador em ecossistemas costeiros.",
        "description": "O Robalo (Dicentrarchus labrax) é um peixe costeiro amplamente apreciado encontrado no Mar Mediterrâneo, Mar Negro e Oceano Atlântico oriental. Tipicamente medindo 30–60 cm de comprimento e pesando 0,5–3 kg, tem um corpo aerodinâmico prateado-acinzentado com dorso ligeiramente mais escuro. O robalo é um peixe predador, alimentando-se de peixes menores, crustáceos e moluscos.\n\nRico em proteína de alta qualidade, ácidos graxos ômega-3, vitaminas e minerais, apoia a saúde cardíaca e nutrição geral. É comumente grelhado, assado ou cozido no vapor na culinária mediterrânea. Robalo fresco oferece excelente sabor e valor nutricional, e práticas de pesca sustentável são essenciais para manter populações saudáveis.",
        "distribution_habitat": "Encontrado em águas costeiras, estuários e lagoas do Mar Mediterrâneo, Mar Negro e Oceano Atlântico oriental. Prefere áreas rasas e protegidas com fundos arenosos ou rochosos onde pode caçar peixes menores e crustáceos.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1q70Dggz_KoCODH27L_54BOJCYYk30kVk",
          "https://drive.google.com/uc?export=view&id=1VzCRvcoXi8JQJkMplm3l5vmF1-ssyw9x"
        ]
      },
      {
        "id": 25,
        "3d_model": "https://sketchfab.com/models/e3860feecc4f4247826a2542f1770e92/embed",
        "type": "fish",
        "animal_name": "Bacalhau do Atlântico",
        "max_size": 150,
        "max_weight": 40,
        "max_depth": 600,
        "other_names": ["Gadus morhua", "Bacalhau"],
        "colors": ["#D2B48C", "#FFFFFF"],
        "family": "Gadidae",
        "habitat": "Águas profundas do Oceano Atlântico",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "em pequenos cardumes",
        "locations": ["Ao largo da costa de Portugal"],
        "locations_description": "Comumente encontrado ao longo das costas da Noruega, Islândia e Canadá. O bacalhau do Atlântico é uma das espécies de peixes economicamente mais importantes e uma pedra angular dos ecossistemas marinhos do Atlântico Norte.",
        "description": "O Bacalhau do Atlântico (Gadus morhua) é um peixe de águas frias comumente encontrado no Oceano Atlântico Norte. Tipicamente medindo 50–100 cm de comprimento e pesando 2–20 kg, o bacalhau do Atlântico tem um corpo robusto e alongado com coloração marrom claro a esverdeada e uma linha lateral branca distinta. Alimenta-se de peixes menores, crustáceos e invertebrados.\n\nO bacalhau do Atlântico é altamente valorizado por sua carne branca, macia e escamosa, rica em proteína e com baixo teor de gordura. É comumente preparado assado, grelhado ou frito. O bacalhau desempenha um papel importante nos ecossistemas marinhos como predador, e práticas de pesca sustentável são cruciais para manter populações saudáveis e proteger a biodiversidade oceânica.",
        "distribution_habitat": "Vive em águas frias e temperadas do Atlântico Norte, perto do fundo do mar em áreas arenosas ou lamacentas. Prefere profundidades entre 20 e 200 metros.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Kk3xifAZ9iSkh2FSgnkAprLqv-IVdFGM"]
      },
      {
        "id": 26,
        "3d_model": "https://sketchfab.com/models/6dbfc4b0a1dd4f20b628475383cc11bc/embed",
        "type": "fish",
        "animal_name": "Peixe-galo",
        "max_size": 70,
        "max_weight": 5,
        "max_depth": 200,
        "other_names": ["Zeus faber", "Peixe-galo"],
        "colors": ["#FFD700", "#000000"],
        "family": "Zeidae",
        "habitat": "Regiões costeiras do Atlântico",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "vagueia sozinho",
        "locations": ["Costa oeste de Portugal"],
        "locations_description": "Comumente encontrado no Mediterrâneo, Atlântico e alguns mares temperados. O peixe-galo encontra condições ideais tanto para pesca quanto para reprodução nestas regiões e desempenha um papel importante como predador no ecossistema marinho.",
        "description": "O Peixe-galo (Zeus faber) é um peixe costeiro encontrado no Mar Mediterrâneo, Oceano Atlântico e outras águas temperadas. Tipicamente medindo 30–65 cm de comprimento e pesando 0,5–3 kg, o peixe-galo tem um corpo lateralmente comprimido, verde-oliva a marrom com uma mancha escura distinta em cada lado. Alimenta-se de peixes menores e invertebrados.\n\nO peixe-galo é apreciado por sua carne branca e delicada, rica em proteína e com baixo teor de gordura. É comumente preparado grelhado, assado ou cozido no vapor na culinária mediterrânea. Peixe-galo fresco oferece excelente sabor e valor nutricional. A pesca sustentável é importante para preservar suas populações naturais para as gerações futuras.",
        "distribution_habitat": "Encontrado em águas costeiras rasas e áreas de mar aberto; geralmente prefere áreas próximas a fundos marinhos arenosos ou lamacentos. Este habitat fornece um ambiente onde pode facilmente capturar presas e camuflar-se.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1uts6OHif0EpFz2hogdZOEpdipZFr85fi"]
      },
      {
        "id": 27,
        "3d_model": "https://sketchfab.com/3d-models/deep-sea-sponge-4cd0e97040c9404e90d9645fc0f69aab",
        "type": "creature",
        "animal_name": "Esponja Marinha",
        "max_size": 50,
        "max_weight": 1,
        "max_depth": 100,
        "other_names": ["Porifera"],
        "colors": ["#FFFF00", "#A52A2A"],
        "family": "Porifera",
        "habitat": "Fundos rochosos, cavernas costeiras",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "vive em colónias",
        "locations": ["Costa atlântica", "Rochas de mar aberto"],
        "locations_description": "Comum ao longo das costas mediterrânea e egeia, particularmente perto de Portugal e Grécia. As esponjas marinhas filtram água, fornecendo serviços ecossistêmicos essenciais e abrigo para pequenas espécies marinhas.",
        "description": "A Esponja Marinha é um animal marinho simples e poroso encontrado em oceanos ao redor do mundo, incluindo os mares Mediterrâneo, Egeu e Negro. As esponjas marinhas fixam-se a rochas ou ao fundo do mar e filtram água para obter nutrientes, desempenhando um papel importante na manutenção de ecossistemas marinhos saudáveis. Elas vêm em várias formas, tamanhos e cores, fornecendo abrigo para muitos pequenos organismos marinhos.\n\nOs humanos têm usado esponjas marinhas há séculos para banho, limpeza e fins cosméticos. Elas também contêm compostos naturais estudados para potenciais aplicações médicas. Proteger os habitats marinhos garante a sobrevivência das populações de esponjas e das espécies que dependem delas.",
        "distribution_habitat": "Habita áreas costeiras rochosas e o fundo do mar, fixando-se a superfícies sólidas. Prefere águas limpas e bem oxigenadas com correntes constantes.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rjP7JFadGU4u366K3cBYzzoxFgv4FUUR"]
      },
      {
        "id": 35,
        "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
        "type": "other",
        "animal_name": "Erva Marinha",
        "max_size": 60,
        "max_weight": 1.5,
        "max_depth": 15,
        "other_names": ["Zostera marina"],
        "colors": ["#008000"],
        "family": "Zosteraceae",
        "habitat": "Áreas costeiras rasas, lagoas",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "em colónias",
        "locations": ["Costas portuguesas"],
        "locations_description": "Encontrada em águas costeiras rasas e forma um habitat importante para peixes e vários invertebrados. Estas áreas fornecem um ambiente ideal tanto para alimentação quanto para reprodução. Os prados de ervas marinhas oferecem tanto abrigo quanto ajudam a ocultar pequenos organismos dentro do ecossistema subaquático, apoiando assim a biodiversidade.",
        "description": "As Plantas Marinhas são organismos fotossintéticos encontrados em oceanos e mares ao redor do mundo, incluindo os mares Mediterrâneo, Egeu e Negro. Elas incluem ervas marinhas, algas e outras plantas aquáticas que crescem em águas rasas, seja ancoradas ao fundo do mar ou flutuando livremente. As plantas marinhas fornecem alimento, oxigênio e abrigo para numerosas espécies marinhas.\n\nRicas em nutrientes, as plantas marinhas desempenham um papel crucial na manutenção de ecossistemas marinhos saudáveis. Elas ajudam a prevenir a erosão costeira, absorvem dióxido de carbono e apoiam a biodiversidade. Proteger as plantas marinhas é essencial para sustentar a saúde dos oceanos e as inúmeras espécies que dependem delas.",
        "distribution_habitat": "Encontrada em áreas marinhas rasas e calmas; geralmente cresce em regiões costeiras em fundos rochosos ou arenosos. Estas áreas são adequadas para receber luz suficiente e obter nutrientes facilmente. As plantas marinhas tanto produzem oxigênio quanto fornecem abrigo para muitas pequenas criaturas marinhas dentro do ecossistema subaquático.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      }
    ]
  }
]