[
  {
    "country": "Türkiye",
    "country_image": "turkey",
    "animals": [
      {
        "id": 0,
        "3d_model": "https://sketchfab.com/models/723309708e9e403c8808617386594851/embed",
        "type": "fish",
        "animal_name": "Hamsi",
        "max_size": 20,
        "max_weight": 0.2,
        "max_depth": 200,
        "other_names": ["Engraulis encrasicolus", "Karadeniz hamsisi"],
        "colors": ["#607D8B", "#B0BEC5"],
        "family": "Engraulidae",
        "habitat": "Karadeniz kıyıları, açık deniz göç yolları",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "sürüler halinde göç eder",
        "locations": ["Karadeniz", "Marmara Denizi"],
        "locations_description": "Türkiye ve çevre denizlerin kıyılarında yaygın olarak görülür. Hamsiler deniz besin zincirinde hayati önem taşır, daha büyük balıklar ve deniz kuşları için av görevi görür ve besin değeri nedeniyle insanlar tarafından yaygın olarak tüketilir.",
        "description": "Hamsi (Engraulis encrasicolus) Karadeniz, Marmara ve Ege Denizi'nde yaygın olarak bulunan küçük, yağlı bir balıktır. Genellikle 10–20 cm uzunluğunda ve yaklaşık 0,1–0,2 kg ağırlığında olan hamsiler, mavimsi-yeşil sırtlı ince, gümüşi bir gövdeye sahiptir. Genellikle büyük sürüler halinde yüzerler ve plankton ve küçük kabuklularla beslenirler.\n\nHamsiler omega-3 yağ asitleri, protein, vitamin ve mineraller açısından zengindir ve kalp sağlığını ve genel beslenmeyi destekler. Türk mutfağında özellikle sonbahar ve kış aylarında popülerdir, genellikle ızgara, kızartma veya turşu olarak tüketilir. Taze hamsi en iyi lezzet ve besin değerini sunar. Doğal populasyonlarını korumak için sürdürülebilir balıkçılık uygulamaları önemlidir.",
        "distribution_habitat": "Karadeniz, Marmara ve Ege Denizi'nin kıyı ve açık sularında bulunur. Beslenme için bol plankton bulunan sığ alanları tercih eder, korunma ve verimli toplanma için sıklıkla büyük sürüler oluşturur.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1pHXHM179a8zu6XR9cS3tHqokq0wa0gWf",
          "https://drive.google.com/uc?export=view&id=1zqZFDOT8keqhheRJJqjuezqUDpQ1wyah"
        ]
      },
      {
        "id": 1,
        "3d_model": "https://sketchfab.com/models/e59ba168962348acaa739a000249b534/embed",
        "type": "fish",
        "animal_name": "Avrupa Deniz Levreği",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Dicentrarchus labrax", "Levrek"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Ege ve Akdeniz kıyıları, körfezler, lagünler",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "yalnız veya küçük gruplar halinde",
        "locations": ["Ege Denizi", "Akdeniz"],
        "locations_description": "Türkiye'nin batı kıyılarında hem vahşi balıkçılık hem de su ürünleri yetiştiriciliği yoluyla yaygındır.",
        "description": "Levrek (Dicentrarchus labrax) Akdeniz, Ege Denizi ve Avrupa kıyılarında bulunan popüler ve besleyici bir balıktır. Genellikle 30–60 cm uzunluğunda ve 0,5–3 kg ağırlığında olan levrek, hafif daha koyu bir sırta sahip zarif, gümüşi-gri bir gövdeye sahiptir. Küçük balıklar ve kabuklularla beslenen yırtıcı bir balıktır.\n\nLevrek yüksek kaliteli protein, omega-3 yağ asitleri, vitamin ve mineraller açısından zengindir, bu da onu kalp sağlığı ve genel refah için faydalı kılar. Türk ve Akdeniz mutfağında genellikle ızgara, fırın veya buğulama olarak pişirilir. Taze levrek en iyi lezzet ve besin değerini sunar. Sürdürülebilir balıkçılık, bu değerli türün gelecek nesiller için bol kalmasını sağlar.",
        "distribution_habitat": "Kıyı kayalık ve kumlu alanlar, haliçler, sığdan orta derinliklere kadar sular.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1Jvyd4iPpBe3yRXRhAB3jdKIof6o8TuWI",
          "https://drive.google.com/uc?export=view&id=1KoQ8Jv_6zeL4jf_2DDB0NpkNwGaBVRv-"
        ]
      },
      {
        "id": 3,
        "3d_model": "https://sketchfab.com/models/9597628972c144f4a166a53c142cd9ca/embed",
        "type": "fish",
        "animal_name": "Palamut",
        "max_size": 90,
        "max_weight": 6,
        "max_depth": 300,
        "other_names": ["Sarda sarda", "Palamut balığı"],
        "colors": ["#1E90FF", "#C0C0C0"],
        "family": "Scombridae",
        "habitat": "Açık deniz, göç yolları",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "sürüler halinde göç eder ve avlanır",
        "locations": ["Marmara Denizi", "Ege Denizi"],
        "locations_description": "Sonbahar aylarında Türk kıyıları boyunca yoğun şekilde avlanan göçmen bir tür.",
        "description": "Palamut (Sarda sarda) Karadeniz, Marmara ve Ege Denizi'nde yaygın olarak bulunan lezzetli ve besleyici yağlı bir balıktır. Genellikle 20–60 cm uzunluğunda ve 0,2–3 kg ağırlığında olan palamut, koyu mavi-yeşil üst gövdeye ve gümüşi-beyaz alt kısma sahiptir. Genellikle sürüler halinde yüzer ve plankton ve küçük balıklarla beslenir.\n\nOmega-3 yağ asitleri, protein, vitamin ve mineraller açısından zengin olan palamudu düzenli olarak tüketmek kalp sağlığını destekler ve bağışıklık sistemini güçlendirir. Türk mutfağında özellikle sonbahar ve kış aylarında beğenilir, ızgara, kızartma veya buğulama olarak hazırlanır. Taze palamut en iyi lezzet ve besini sunar. Doğal populasyonunu korumak için sürdürülebilir balıkçılık uygulamaları gereklidir.",
        "distribution_habitat": "Açık deniz ve kıyı geçiş bölgeleri, orta ila derin sular.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1zaMhXPO4AtI1MIbu55zBfnaERO_Apd5-",
          "https://drive.google.com/uc?export=view&id=16VlhQGqjLkbKQ5SRmFVghawkc4m"
        ]
      },
      {
        "id": 13,
        "3d_model": "https://sketchfab.com/models/3cfe9d4021b14a5fad8372bcb490956b/embed",
        "type": "creature",
        "animal_name": "Denizanası",
        "max_size": 30,
        "max_weight": 0.5,
        "max_depth": 50,
        "other_names": ["Aurelia aurita"],
        "colors": ["#FFFFFF", "#FFC0CB"],
        "family": "Ulmaridae",
        "habitat": "Açık deniz ve kıyı suları",
        "poisonous": true,
        "edible": false,
        "danger_to_human": true,
        "social_behaviour": "gruplar oluşturur ve toplu olarak sürüklenir",
        "locations": ["Karadeniz", "Ege Denizi"],
        "locations_description": "Akdeniz ve Ege Denizi'nde yaygındır. Denizanası populasyonları genellikle yaz aylarında artar, deniz ekosistemlerinde hem avcı hem de av rolü oynar.",
        "description": "Denizanası Akdeniz, Ege ve Karadeniz dahil olmak üzere dünyanın dört bir yanındaki okyanüslarda bulunan büyüleyici deniz hayvanlarıdır. Yumuşak, jelatinimsi bir gövdeye, genellikle şemsiye şeklinde ve avlanmak için sokabilen dokunaçlara sahiptirler. Denizanalarının boyutu birkaç santimetreden bir metreden fazla çapa kadar büyük ölçüde değişir.\n\nBirçok Batı diyetinde tipik olarak tüketilmemelerine rağmen, denizanaları protein kaynağıdır ve bazı Asya mutfaklarında yenir. Plankton populasyonlarını kontrol ederek ve daha büyük deniz hayvanları için gıda olarak hizmet ederek deniz ekosistemlerinde önemli bir rol oynarlar. Denizanaları gözlemlemek büyüleyici olabilir, ancak sokma yetenekleri nedeniyle dikkatli olunması önerilir.",
        "distribution_habitat": "Açık denizlerde ve kıyı sularında yaşar, okyanus akıntılarıyla sürüklenir. Bol planktonlu ılıman ila sıcak bölgeleri tercih eder.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1SVHv7w7LKfaFsxzhz_2la7JaZgRttbSZ"
        ]
      },
      {
        "id": 14,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Mercan",
        "max_size": 15,
        "max_weight": 1,
        "max_depth": 10,
        "other_names": ["Mercan"],
        "colors": ["#FF0000", "#FFA500", "#FFC0CB"],
        "family": "Scleractinia",
        "habitat": "Sığ tropikal denizler",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "koloniler halinde yaşar",
        "locations": ["Akdeniz"],
        "locations_description": "Akdeniz ve Kızıldeniz'in bazı bölümlerinde yaygındır. Deniz mercanları geniş bir deniz türü yelpazesine ev sahipliği yapan karmaşık habitatlar inşa eder ve kıyıları erozyondan korur.",
        "description": "Mercanlar tropikal ve subtropikal denizlerde mercan resiflerinde yaşayan renkli ve çeşitli deniz organizmalarıdır. Boyut, şekil ve renk açısından büyük ölçüde değişirler, genellikle resif ortamına karışmalarına yardımcı olan canlı desenler sergilerler. Mercanlar planktonla beslenir ve besinler için simbiyotik algalara güvenir, resif ekosistemlerini sürdürmede önemli bir rol oynar.\n\nGıda olarak tüketilmemelerine rağmen, mercanlar biyoçeşitlilik için hayati önem taşır, sayısız deniz türüne barınak ve üreme alanları sağlar. Mercan resiflerini korumak, deniz yaşamını korumak ve sağlıklı okyanus ekosistemlerini sürdürmek için gereklidir.",
        "distribution_habitat": "Sıcak, sığ tropikal ve subtropikal denizlerde bulunur, genellikle kayalık substratlarda resifler oluşturur.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1HJHlC3eQc_xQFkK7JsmrwD-1DJYY8Xjc"
        ]
      },
      {
        "id": 16,
        "3d_model": "https://sketchfab.com/models/caeca42dbdaf4895aa69a88a2a1bbb72/embed",
        "type": "fish",
        "animal_name": "İstavrit",
        "max_size": 35,
        "max_weight": 0.5,
        "max_depth": 250,
        "other_names": ["Trachurus trachurus", "Karadeniz istavrit"],
        "colors": ["#C0C0C0", "#6B8E23"],
        "family": "Carangidae",
        "habitat": "Karadeniz, Marmara Denizi ve Ege Denizi'nin açık suları",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "sürüler halinde yaşar ve göç eder",
        "locations": ["Karadeniz", "Marmara Denizi"],
        "locations_description": "Türkiye ve komşu denizlerin kıyıları boyunca yaygın olarak bulunur. İstavrit deniz besin zincirinde önemli bir rol oynar, daha büyük balıklar ve deniz kuşları için av görevi görür ve besin değeri nedeniyle insanlar tarafından yaygın olarak tüketilir.",
        "description": "İstavrit (Trachurus trachurus) Karadeniz, Marmara ve Ege Denizi'nde bulunan geniş çapta dağılmış yağlı bir balıktır. Genellikle 20–40 cm uzunluğunda ve 0,2–1 kg ağırlığında olan istavrit, hafif daha koyu bir sırta sahip aerodinamik gümüşi bir gövdeye sahiptir. Genellikle büyük sürüler halinde yüzer ve küçük balıklar, kabuklular ve planktonla beslenir.\n\nİstavrit omega-3 yağ asitleri, protein, vitamin ve mineraller açısından zengindir, bu da onu kalp sağlığı ve genel beslenme için faydalı kılar. Türk mutfağında genellikle ızgara, kızartma veya güveçlerde kullanılır. Taze istavrit en iyi lezzet ve besin değerini sunar. Doğal populasyonlarını korumak için sürdürülebilir balıkçılık uygulamaları gereklidir.",
        "distribution_habitat": "Kıyı suları ve orta derinlik göç yolları.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1LQLDFOtTVF_Ne1qffc4-R4hLK4_lIMND"
        ]
      },
      {
        "id": 17,
        "3d_model": "https://sketchfab.com/models/3c007d219b704a8abd5a8f3bd302642e/embed",
        "type": "fish",
        "animal_name": "Lüfer",
        "max_size": 110,
        "max_weight": 14,
        "max_depth": 200,
        "other_names": ["Pomatomus saltatrix"],
        "colors": ["#1E90FF", "#C0C0C0"],
        "family": "Pomatomidae",
        "habitat": "Marmara, Ege ve Karadeniz'in açık suları",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "sürüler halinde avlanır",
        "locations": ["Boğazlar (Boğaziçi ve Çanakkale)", "Ege Denizi"],
        "locations_description": "Göç dönemlerinde Boğazlar'dan (Boğaziçi ve Çanakkale) geçmesiyle ünlüdür.",
        "description": "Lüfer (Pomatomus saltatrix) Karadeniz, Marmara ve Ege Denizi'nde bulunan popüler ve besleyici yırtıcı bir balıktır. Genellikle 30–50 cm uzunluğunda ve 0,5–2 kg ağırlığında olan lüfer, hafif daha koyu bir sırta sahip aerodinamik, gümüşi-mavi bir gövdeye sahiptir. Sürüler halinde yüzer ve daha küçük balıklar ve kabuklularla beslenir.\n\nLüfer omega-3 yağ asitleri, yüksek kaliteli protein, vitamin ve mineraller açısından zengindir, kalp sağlığını ve genel beslenmeyi destekler. Türk mutfağında özellikle en bol olduğu sonbaharda genellikle ızgara, kızartma veya fırınlanarak pişirilir. Taze lüfer en iyi lezzet ve besin değerini sunar. Gelecek nesiller için sağlıklı populasyonları korumak için sürdürülebilir balıkçılık önemlidir.",
        "distribution_habitat": "Açık deniz ve kıyı bölgeleri.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1keiLq5vR5RNBz9roh4xmkKYEIwJJ_Oqr"
        ]
      },
      {
        "id": 18,
        "3d_model": "https://sketchfab.com/models/645b4a2217ef452581428e0510d7e607/embed",
        "type": "creature",
        "animal_name": "Deniz Yıldızı",
        "max_size": 25,
        "max_weight": 0.3,
        "max_depth": 100,
        "other_names": ["Asteroidea"],
        "colors": ["#FFA500", "#800080", "#FF0000"],
        "family": "Asteroidea",
        "habitat": "Ege ve Akdeniz'in kayalık deniz dipleri",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "yalnız yaşar",
        "locations": ["Ege Denizi"],
        "locations_description": "Kayalık diplerde sıklıkla bulunur.",
        "description": "Deniz Yıldızı Akdeniz, Ege ve Karadeniz dahil olmak üzere dünyanın dört bir yanındaki okyanüslarda bulunan deniz omurgasızlarıdır. Genellikle hareket ve av yakalamak için kullandıkları beş veya daha fazla kola sahip yıldız şeklinde bir gövdeye sahiptirler. Deniz yıldızları hareket ve beslenmede yardımcı olan benzersiz bir su damar sistemine sahiptir.\n\nGıda olarak yaygın olarak tüketilmemelerine rağmen, deniz yıldızları diğer omurgasızların populasyonlarını kontrol ederek ve resif sağlığına katkıda bulunarak deniz ekosistemlerinde önemli bir rol oynar. Büyüleyici görünümleri ve rejeneratif yetenekleri—bazı türler kayıp kolları yeniden büyütebilir—onları deniz biyolojisi ve akvaryum meraklıları için ilgi konusu yapar.",
        "distribution_habitat": "Kıyı kayalıkları ve deniz tabanı.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1CQpLXxHjvlf7WTXHQ4OPOaJjWep872Sv"
        ]
      },
      {
        "id": 28,
        "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
        "type": "other",
        "animal_name": "Deniz Yosunu",
        "max_size": 50,
        "max_weight": 1,
        "max_depth": 30,
        "other_names": ["Alg", "Deniz Yosunu"],
        "colors": ["#008000", "#8B4513"],
        "family": "Phaeophyceae",
        "habitat": "Ege ve Akdeniz kıyıları, kayalık dipler",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "koloniler halinde",
        "locations": ["Ege Denizi", "Akdeniz"],
        "locations_description": "Kıyı kayalıklarında yoğun olarak görülür.",
        "description": "Deniz Yosunu (Deniz Algleri) Akdeniz, Ege ve Karadeniz dahil olmak üzere dünyanın dört bir yanındaki okyanüslarda bulunan çeşitli deniz bitkileridir. Sığ sularda büyürler ve kayalara veya deniz tabanına tutunurlar. Deniz yosunu yeşil, kahverengi ve kırmızı gibi çeşitli renklerde gelir ve birçok deniz türü için habitat ve gıda sağlar.\n\nDeniz yosunu son derece besleyicidir, vitamin, mineral, lif ve antioksidanlar açısından zengindir. Birçok mutfakta, özellikle Asya'da tüketilir ve ayrıca takviyeler, kozmetikler ve gübrelerde kullanılır. Besin değerinin ötesinde, deniz yosunu oksijen üreterek, karbondioksiti azaltarak ve biyoçeşitliliği destekleyerek deniz ekosistemlerinde hayati bir rol oynar.",
        "distribution_habitat": "Sığ kıyı alanları, kayalık ve kumlu dipler.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      },
      {
        "id": 29,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Mercan",
        "max_size": 20,
        "max_weight": 1,
        "max_depth": 15,
        "other_names": ["Corallium rubrum"],
        "colors": ["#FF0000", "#FFA500"],
        "family": "Scleractinia",
        "habitat": "Akdeniz kıyıları, kayalar",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "koloniler halinde",
        "locations": ["Akdeniz"],
        "locations_description": "Kıyı kayalıklarında yoğun koloniler oluşturur.",
        "description": "Mercan (Deniz Mercanı) tropikal ve subtropikal okyanüslarda bulunan, canlı resif ekosistemleri oluşturan deniz omurgasızlarıdır. Sert kalsiyum karbonat iskeletine sahiptirler ve koloniler halinde yaşarlar, sayısız deniz türüne barınak ve gıda sağlayan karmaşık yapılar oluştururlar.\n\nMercan resifleri biyoçeşitliliği destekler ve kıyıları erozyondan korur. Gıda olarak tipik olarak tüketilmemelerine rağmen, mercanlar ekolojik önemleri, güzellikleri ve mücevherlerde kullanımları için oldukça değerlidir. Mercan resiflerini korumak kritik öneme sahiptir, çünkü iklim değişikliği, kirlilik ve aşırı avcılık onların hayatta kalmasını ve onlara bağımlı sayısız türü tehdit etmektedir.",
        "distribution_habitat": "Sığ ve korunaklı kayalık alanlar.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1CTGsUj276H5Cx-28Gnc6xfCyVC_RmGgp"]
      }
    ]
  },
  {
    "country": "Bulgaristan",
    "country_image": "bulgaria",
    "animals": [
      {
        "id": 4,
        "3d_model": "https://sketchfab.com/models/ef0c406d4ca84242a0464abecb7d7037/embed",
        "type": "fish",
        "animal_name": "Aynalı Sazan (Cyprinus carpio)",
        "max_size": 120,
        "max_weight": 30,
        "max_depth": 10,
        "other_names": ["Merkezi tatlısu sazanı", "Cyprinus carpio"],
        "colors": ["#8B4513", "#FFD700", "#A0522D"],
        "family": "Cyprinidae",
        "habitat": "Tatlısu göletleri, nehirler, su hazneleri",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "gençken sürüler halinde, yetişkinken daha bireysel",
        "locations": ["Dolinata nehir sistemi", "Bulgar göletleri"],
        "locations_description": "Bulgaristan'da su ürünleri yetiştiriciliği ve balıkçılık için yaygın tatlısu türlerinden biri.",
        "description": "Aynalı Sazan (Cyprinus carpio) Avrupa, Asya ve diğer bölgelerdeki nehir, göl ve göletlerde yaygın olarak bulunan tatlısu balığıdır. Genellikle 40–80 cm uzunluğunda ve 2–14 kg ağırlığında olan aynalı sazan, genellikle altın-kahverengi veya yeşilimsi renkli büyük pullarla kaplı sağlam, uzun bir gövdeye sahiptir. Bitkiler, böcekler ve küçük omurgasızlarla beslenen hepçil bir balıktır.\n\nAynalı sazan yüksek protein içeriği için değerlidir ve yaygın olarak yetiştirilir veya gıda için yakalanır. Birçok kültürde ızgara, fırınlanmış veya tütsülenmiş olarak hazırlanır. Bu uyarlanabilir tür tatlısu ekosistemlerinde önemli bir rol oynadığı için sağlıklı populasyonları korumak için sürdürülebilir balıkçılık ve su ürünleri yetiştiriciliği uygulamaları önemlidir.",
        "distribution_habitat": "Yavaş akan nehirler, göller, su hazneleri, bitki örtüsü açısından zengin kıyılar.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1kGxpZaSBrNpuwl_Fq9U0HRcNhKNinR8J",
          "https://drive.google.com/uc?export=view&id=1ofPUNU6cVELQciQBXkHNfWr5dzDdsU1y"
        ]
      },
      {
        "id": 5,
        "3d_model": "https://sketchfab.com/models/caeca42dbdaf4895aa69a88a2a1bbb72/embed",
        "type": "fish",
        "animal_name": "Uskumru (Scomber scombrus)",
        "max_size": 60,
        "max_weight": 2,
        "max_depth": 200,
        "other_names": ["Makrel", "Scomber scombrus"],
        "colors": ["#008080", "#C0C0C0"],
        "family": "Scombridae",
        "habitat": "Karadeniz'in açık deniz kıyıları",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "sürüler halinde göç eder",
        "locations": ["Bulgar Karadeniz kıyısı"],
        "locations_description": "Bulgaristan'da yaygın olarak tüketilen göçmen ve yağlı balık türlerinden biri.",
        "description": "Uskumru (Scomber scombrus / Scomber japonicus) Atlantik Okyanusu, Akdeniz ve diğer ılıman sularda bulunan popüler yağlı bir balıktır. Genellikle 20–60 cm uzunluğunda ve 0,2–3 kg ağırlığında olan uskumru, koyu mavimsi-yeşil bir sırta sahip aerodinamik, gümüşi bir gövdeye sahiptir. Sürüler halinde yüzer ve plankton, küçük balıklar ve kabuklularla beslenir.\n\nOmega-3 yağ asitleri, protein, vitamin ve mineraller açısından zengin olan uskumru kalp sağlığını, beyin fonksiyonunu ve genel beslenmeyi destekler. Mutfakta genellikle ızgara, tütsülenmiş veya fırınlanmış olarak hazırlanır. Taze uskumru en iyi lezzet ve besin değerini sunar ve doğal populasyonlarını korumak için sürdürülebilir balıkçılık uygulamaları gereklidir.",
        "distribution_habitat": "Kıyı açık deniz, göç yolları, orta derinlikler.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1sB7adgM2bpufrcEy4-YDBxxB7e1b_YF6",
          "https://drive.google.com/uc?export=view&id=1FqCZO5pP8DCILMqN-LOYG19Q3tJU_zVE"
        ]
      },
      {
        "id": 6,
        "3d_model": "https://sketchfab.com/models/df09d2c1e3f34ebeb7dc957b3/embed",
        "type": "fish",
        "animal_name": "Karadeniz Kalkanı (Psetta maxima maeotica)",
        "max_size": 70,
        "max_weight": 5,
        "max_depth": 100,
        "other_names": ["Kalkan (Karadeniz)", "Psetta maxima"],
        "colors": ["#A52A2A", "#FFFFFF"],
        "family": "Scophthalmidae",
        "habitat": "Karadeniz tabanı, kumlu ve çamurlu dipler",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "yalnız yaşar",
        "locations": ["Bulgar Karadeniz kıyısı"],
        "locations_description": "Bulgaristan'ın Karadeniz kıyısı boyunca avlanan yassı balık türü.",
        "description": "Karadeniz Kalkanı (Scophthalmus maeoticus) Karadeniz ve Marmara Denizi'nde bulunan dip yaşayan, yassı bir balıktır. Genellikle 30–70 cm uzunluğunda ve 1–5 kg ağırlığında olan kalkan, deniz tabanıyla karışmasına yardımcı olan kumlu-kahverengi üst tarafa ve beyaz alt tarafa sahip geniş, elmas şeklinde bir gövdeye sahiptir. Küçük balıklar, kabuklular ve diğer omurgasızlarla beslenir.\n\nKalkan protein açısından zengin ve yağ oranı düşük, sert, beyaz eti için oldukça değerlidir. Akdeniz ve Türk mutfağında genellikle ızgara, fırınlanmış veya buğulama olarak hazırlanır. Taze kalkan mükemmel tat ve besin değeri sunar ve gelecek nesiller için populasyonunu korumak için sürdürülebilir balıkçılık önemlidir.",
        "distribution_habitat": "Kum-çamur dipleri, kıyıya yakın orta derinlikler, açık deniz değil.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rv06PB5pI8MqmS0Mu3idkn9EV5nKjY-U"]
      },
      {
        "id": 15,
        "3d_model": "https://sketchfab.com/models/2adc33a3a8c74a3c8759745c46c612ff/embed",
        "type": "creature",
        "animal_name": "Deniz Kestanesi",
        "max_size": 10,
        "max_weight": 0.2,
        "max_depth": 25,
        "other_names": ["Deniz Kestanesi"],
        "colors": ["#800080", "#A52A2A"],
        "family": "Echinoidea",
        "habitat": "Kıyı kayalıkları ve deniz tabanı",
        "poisonous": true,
        "edible": true,
        "danger_to_human": true,
        "social_behaviour": "yalnız yaşar",
        "locations": ["Bulgar Karadeniz kıyısı"],
        "locations_description": "Akdeniz ve Ege Denizi'nde yaygındır. Deniz kestaneleri alg büyümesini kontrol etmeye yardımcı olan ve ekolojik dengeyi koruyan önemli otlayıcılardır.",
        "description": "Deniz Kestanesi Akdeniz, Ege ve Karadeniz dahil olmak üzere dünyanın dört bir yanındaki okyanüslarda bulunan küçük, dikenli bir deniz omurgasızıdır. Koruma ve hareket için hareketli dikenlerle kaplı yuvarlak, sert bir kabuğa sahiptirler. Deniz kestaneleri ağırlıklı olarak alglerle beslenir ve deniz ekosistemlerinin dengesini korumada önemli bir rol oynar.\n\nDeniz kestaneleri birçok mutfakta, özellikle Akdeniz ve Japon yemeklerinde, zengin, tuzlu lezzetleri ve yüksek protein içerikleri için değerli bir lezzet olarak kabul edilir. Ayrıca diğer türler için habitat ve gıda sağlayarak deniz biyoçeşitliliğine katkıda bulunurlar. Popülasyonlarını korumak ve ekosistem sağlığını korumak için sürdürülebilir hasat gereklidir.",
        "distribution_habitat": "Sığ sularda kayalık deniz diplerinde ve mercan resiflerinde bulunur. Alglerin bol olduğu temiz, iyi aydınlatılmış alanları tercih eder.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1mhBTx13dz2-S2hl2u_WU0lv7EVCxxEBK"]
      },
      {
        "id": 19,
        "3d_model": "https://sketchfab.com/models/8974457120d143029d44bac83ffb273b/embed",
        "type": "fish",
        "animal_name": "Turna Balığı (Kuzey Turnası)",
        "max_size": 150,
        "max_weight": 25,
        "max_depth": 15,
        "other_names": ["Esox lucius"],
        "colors": ["#008000", "#FFFFFF"],
        "family": "Esocidae",
        "habitat": "Tatlısu gölleri ve nehir ağızları",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "yalnız yaşar",
        "locations": ["Bulgar nehirleri", "Tatlısu gölleri"],
        "locations_description": "Bulgaristan'ın iç sularında avlanan yırtıcı türlerden biri.",
        "description": "Turna Balığı (Esox lucius) Avrupa, Asya ve Kuzey Amerika'daki nehir, göl ve göletlerde yaygın olarak bulunan tatlısu yırtıcı balığıdır. Genellikle 40–120 cm uzunluğunda ve 1–20 kg ağırlığında olan turna balığı, daha küçük balıkları yakalamak için kullandığı uzun bir gövdeye, sivri bir buruna ve keskin dişlere sahiptir. Renklendirmesi genellikle kamuflaj için daha açık, sarımsı desenlerle yeşilimsidir.\n\nTurna balığı protein açısından zengin ve yağ oranı düşük, sert, beyaz eti için değerlidir. Genellikle ızgara, fırınlanmış veya tütsülenmiş olarak hazırlanır. Tatlısu ekosistemlerinde en üst düzey yırtıcı olarak turna balığı, balık populasyonlarının dengesini korumada önemli bir rol oynar. Gelecek için sağlıklı turna balığı populasyonlarını korumak için sürdürülebilir balıkçılık uygulamaları gereklidir.",
        "distribution_habitat": "Yavaş akan tatlı sular, yosunlu alanlar.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1agiLwwHniyY8xUjlc5zBg6dPM03DWERg"]
      },
      {
        "id": 20,
        "3d_model": "https://sketchfab.com/models/21fd636ec9a94092b0a39c9f4f0428b5/embed",
        "type": "fish",
        "animal_name": "Levrek (Avrupa Levreği)",
        "max_size": 60,
        "max_weight": 4,
        "max_depth": 20,
        "other_names": ["Perca fluviatilis"],
        "colors": ["#3CB371", "#FFA500"],
        "family": "Percidae",
        "habitat": "Tatlısu gölleri, nehirler",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "küçük gruplar halinde",
        "locations": ["Bulgar göletleri"],
        "locations_description": "Yerel balıkçılıkta sıkça karşılaşılan tür.",
        "description": "Levrek (Perca fluviatilis) Avrupa ve Asya'nın bazı bölgelerindeki nehir, göl ve göletlerde yaygın olarak bulunan tatlısu balığıdır. Genellikle 15–50 cm uzunluğunda ve 0,2–2 kg ağırlığında olan levrek, yeşilimsi-kahverengi renklendirme ve belirgin koyu dikey çizgilere sahip yandan sıkıştırılmış bir gövdeye sahiptir. Küçük balıklar, böcekler ve omurgasızlarla beslenir.\n\nLevrek hafif, beyaz eti ve yüksek protein içeriği için değerlidir. Birçok mutfakta genellikle ızgara, kızartma veya fırınlanmış olarak hazırlanır. Yırtıcı bir balık olarak levrek, tatlısu ekosistemlerinin dengesini korumada önemli bir rol oynar. Sürdürülebilir balıkçılık, gelecek nesiller için sağlıklı levrek populasyonlarının sağlanmasına yardımcı olur.",
        "distribution_habitat": "Tatlısu gölleri ve akıntısız alanlar.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1O2BdQI7DuFdgO00G6d_77hKD9zH2GBVH"]
      },
      {
        "id": 21,
        "3d_model": "https://sketchfab.com/models/c710d5a183a547d8a999c721a2d906cf/embed",
        "type": "creature",
        "animal_name": "Tatlısu Midyesi",
        "max_size": 10,
        "max_weight": 0.1,
        "max_depth": 5,
        "other_names": ["Anodonta cygnea"],
        "colors": ["#000000", "#A52A2A"],
        "family": "Unionidae",
        "habitat": "Tatlısu gölleri ve akarsular",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "gruplar halinde yaşar",
        "locations": ["Bulgar göletleri"],
        "locations_description": "Tatlısu ekosistemlerinde filtre edici rol oynar.",
        "description": "Tatlısu Midyesi dünyanın dört bir yanındaki nehir, göl ve göletlerde bulunan çift kabuklu bir yumuşakçadır. Genellikle midyeler güçlü byssus iplikleri kullanarak kendilerini kayalara veya tortuya tutturur. Plankton ve organik partiküller üzerinde filtre beslenme yaparlar, su kalitesini ve ekosistem dengesini korumada önemli bir rol oynarlar.\n\nTatlısu midyeleri protein ve mineraller açısından zengindir, ancak deniz midyelerinden daha az tüketilirler. Diğer su türleri için habitat sağlayarak ve biyoçeşitliliğe katkıda bulunarak ekolojik rolleri için de değerlidir. Midye popülasyonlarını ve su ekosistemlerinin genel sağlığını korumak için tatlısu habitatlarını korumak gereklidir.",
        "distribution_habitat": "Tatlısu dipleri, çamurlu zeminler.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Pmy-CTIY3FyxAkdy8dJRsaEnwICSkOfI"]
      },
      {
        "id": 30,
        "3d_model": "https://sketchfab.com/models/4cd0e97040c9404e90d9645fc0f69aab/embed",
        "type": "other",
        "animal_name": "Deniz Süngeri",
        "max_size": 40,
        "max_weight": 0.8,
        "max_depth": 50,
        "other_names": ["Porifera"],
        "colors": ["#FFFF00", "#A52A2A"],
        "family": "Porifera",
        "habitat": "Karadeniz kıyıları, kayalık dipler",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "koloniler halinde",
        "locations": ["Bulgar Karadeniz kıyısı"],
        "locations_description": "Kıyı kayalıklarında ve dip mağaralarında bulunur.",
        "description": "Deniz Süngeri Akdeniz, Ege ve Karadeniz dahil olmak üzere dünyanın dört bir yanındaki okyanüslarda bulunan basit, gözenekli bir deniz hayvanıdır. Kayalara veya deniz tabanına tutunur ve besin elde etmek için suyu filtreler, deniz ekosistemi sağlığını korumada önemli bir rol oynar. Deniz süngerleri çeşitli şekil, boyut ve renklerde gelir, birçok küçük deniz organizması için habitat ve barınak sağlar.\n\nDeniz süngerleri yüzyıllardır insanlar tarafından öncelikli olarak banyo, temizlik ve kozmetik amaçlarla kullanılmaktadır. Ayrıca potansiyel tıbbi uygulamalar için araştırılan doğal bileşikler açısından zengindir. Deniz habitatlarını korumak, sünger popülasyonlarının ve onlara bağımlı türlerin hayatta kalmasını sağlar.",
        "distribution_habitat": "Kayalık ve çamurlu dip alanları.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rjP7JFadGU4u366K3cBYzzoxFgv4FUUR"]
      },
      {
        "id": 31,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Deniz Çayırı",
        "max_size": 60,
        "max_weight": 1.5,
        "max_depth": 10,
        "other_names": ["Zostera marina"],
        "colors": ["#008000"],
        "family": "Zosteraceae",
        "habitat": "Sığ kıyı alanları, kumlu dip",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "koloniler halinde",
        "locations": ["Bulgar Karadeniz kıyısı"],
        "locations_description": "Kıyı sığ sularında yoğun olarak görülür, balıklar için gıda kaynağı.",
        "description": "Deniz Bitkileri (Deniz Bitkileri) Akdeniz, Ege ve Karadeniz dahil olmak üzere dünyanın dört bir yanındaki okyanus ve denizlerde bulunan fotosentez yapan organizmalardır. Sığ sularda büyüyen, kendilerini deniz tabanına tutturan veya serbestçe yüzen deniz çayırları, algler ve diğer su bitkilerini içerir. Deniz bitkileri sayısız deniz türü için gıda, barınak ve oksijen sağlar.\n\nDeniz bitkileri besin açısından zengindir ve sağlıklı deniz ekosistemlerini korumada önemli bir rol oynar. Kıyı erozyonunu önlemeye yardımcı olur, karbondioksit emer ve biyoçeşitliliği destekler. Deniz bitkilerini korumak, okyanus sağlığını ve onlara bağımlı sayısız türü sürdürmek için gereklidir.",
        "distribution_habitat": "Sığ ve sakin deniz alanları.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      }
    ]
  },
  {
    "country": "Yunanistan",
    "country_image": "greece",
    "animals": [
      {
        "id": 7,
        "3d_model": "https://sketchfab.com/models/a3d0e1a597794a9bb74739a13cfc8b77/embed",
        "type": "fish",
        "animal_name": "Çipura (Sparus aurata)",
        "max_size": 70,
        "max_weight": 7,
        "max_depth": 80,
        "other_names": ["Altınbaşlı Çipura", "Sparus aurata"],
        "colors": ["#C0C0C0", "#FFD700"],
        "family": "Sparidae",
        "habitat": "Ege ve Akdeniz'in kayalık ve kumlu kıyıları, lagünler",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "gençken sürüler halinde, yetişkinken daha bireysel",
        "locations": ["Yunan adalarının kıyıları", "Ege Denizi"],
        "locations_description": "Yunanistan'daki restoranlarda yaygın olarak bulunan ve avlanan bir balık.",
        "description": "Çipura (Sparus aurata) Akdeniz, Ege Denizi ve Doğu Atlantik Okyanusu'nda bulunan popüler bir kıyı balığıdır. Genellikle 20–50 cm uzunluğunda ve 0,3–2 kg ağırlığında olan çipura, gözleri arasında belirgin bir altın şerit bulunan gümüşi bir gövdeye sahiptir. Küçük omurgasızlar, kabuklular ve alglerle beslenir.\n\nProtein, vitamin ve mineraller açısından zengin olan çipura, sert, lezzetli eti için oldukça değerlidir. Akdeniz mutfağında genellikle ızgara, fırınlanmış veya buğulama olarak pişirilir. Taze çipura en iyi tat ve besin faydalarını sunar. Gelecek nesiller için doğal populasyonlarını korumak için sürdürülebilir balıkçılık gereklidir.",
        "distribution_habitat": "Kıyı kayalık ve kumlu alanlar, lagün ağızları.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1yIXZXGjKKIsXpRLADY00k9G8OyASw6jA",
          "https://drive.google.com/uc?export=view&id=1_AkVeoIi2nt68BYwAPvlBj7Ym0NUEkVi"
        ]
      },
      {
        "id": 8,
        "3d_model": "https://sketchfab.com/models/fc781bee9c0e4378a109acc8b728a86b/embed",
        "type": "fish",
        "animal_name": "Avrupa Deniz Levreği (Dicentrarchus labrax)",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Levrek", "Dicentrarchus labrax"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Kıyı denizleri, körfezler, lagünler",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "çoğunlukla bireysel",
        "locations": ["Yunan kıyıları", "Ege Denizi"],
        "locations_description": "Yunanistan'da hem avlanan hem de yetiştirilen popüler bir balık türü.",
        "description": "Avrupa Deniz Levreği (Dicentrarchus labrax) Akdeniz, Karadeniz ve Doğu Atlantik Okyanusu'nda bulunan geniş çapta takdir edilen kıyı balığıdır. Genellikle 30–60 cm uzunluğunda ve 0,5–3 kg ağırlığında, hafif daha koyu bir sırta sahip aerodinamik gümüşi-gri bir gövdeye sahiptir. Avrupa deniz levreği, daha küçük balıklar, kabuklular ve yumuşakçalarla beslenen yırtıcı bir balıktır.\n\nYüksek kaliteli protein, omega-3 yağ asitleri, vitamin ve mineraller açısından zengin olup kalp sağlığını ve genel beslenmeyi destekler. Akdeniz mutfağında genellikle ızgara, fırınlanmış veya buğulama olarak pişirilir. Taze Avrupa deniz levreği mükemmel lezzet ve besin değeri sunar ve sağlıklı populasyonları korumak için sürdürülebilir balıkçılık uygulamaları gereklidir.",
        "distribution_habitat": "Kıyı kayalık ve kumlu alanlar, sığdan orta derinliklere.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1q70Dggz_KoCODH27L_54BOJCYYk30kVk",
          "https://drive.google.com/uc?export=view&id=1VzCRvcoXi8JQJkMplm3l5vmF1-ssyw9x"
        ]
      },
      {
        "id": 9,
        "3d_model": "https://sketchfab.com/models/1ea0e1c187d743039463aa1477acb71e/embed",
        "type": "fish",
        "animal_name": "Akdeniz Papağan Balığı (Sparisoma cretense)",
        "max_size": 50,
        "max_weight": 3,
        "max_depth": 50,
        "other_names": ["Akdeniz papağan balığı", "Sparisoma cretense"],
        "colors": ["#00CED1", "#FF0000"],
        "family": "Scaridae",
        "habitat": "Kayalık resif alanları, makroalg açısından zengin bölgeler",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "küçük gruplar halinde yaşar",
        "locations": ["Ege Denizi kayalık kıyıları", "Doğu Akdeniz"],
        "locations_description": "Akdeniz'deki kayalık kıyı sistemlerinde özellikle bulunan resif balığı.",
        "description": "Akdeniz Papağan Balıkları Akdeniz'de bulunan renkli deniz balıklarıdır. Algleri otlatmak ve kaya ve mercan resiflerinin yüzeylerini kazımak için kullandıkları güçlü gaga benzeri dişleri ile bilinirler. Genellikle 15–35 cm uzunluğunda olup çevrelerine karışmalarına yardımcı olan canlı renkler sergilerler.\n\nPapağan balıkları alg büyümesini kontrol ederek ve beslenme alışkanlıkları yoluyla kum üretimine katkıda bulunarak resif sağlığını korumada önemli bir rol oynar. Gıda olarak yaygın olarak tüketilmemelerine rağmen, güzellikleri ve ekolojik önemleri için hayranlık duyulurlar. Habitatlarını korumak, Akdeniz deniz ekosistemlerinin biyoçeşitliliğini korumak için gereklidir.",
        "distribution_habitat": "Kayalık ve alg açısından yoğun bölümler, sığdan orta derinliklere.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1AhAqpVxf7HBZafEwJGSvQKP6pQvG1swU",
          "https://drive.google.com/uc?export=view&id=183FJzwM5VBTnI3nzFqMjSm-36GR8lShF"
        ]
      },
      {
        "id": 22,
        "3d_model": "https://sketchfab.com/models/59f8a232fd794318bfff79bfe4e01213/embed",
        "type": "fish",
        "animal_name": "Barbunya (Barbouni)",
        "max_size": 40,
        "max_weight": 1,
        "max_depth": 150,
        "other_names": ["Mullus barbatus", "Barbunya"],
        "colors": ["#B22222", "#FFFFFF"],
        "family": "Mullidae",
        "habitat": "Ege Denizi kıyıları ve kumlu dipler",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "küçük gruplar halinde",
        "locations": ["Ege Denizi"],
        "locations_description": "Akdeniz ve Doğu Atlantik kıyılarında yaygındır. Barbunya bölgesel mutfaklarda popüler bir türdür, yumuşak, lezzetli eti için değerlidir.",
        "description": "Barbunya (Mullus barbatus / Mullus surmuletus) Akdeniz, Ege Denizi ve Doğu Atlantik Okyanusu'nda bulunan küçük, dip yaşayan bir balıktır. Genellikle 15–30 cm uzunluğunda olan barbunya, deniz tabanındaki gıdayı tespit etmek için kullandığı çenesinin altında iki belirgin bıyığa sahip kırmızımsı-pembe bir gövdeye sahiptir. Küçük omurgasızlar, kabuklular ve solucanlarla beslenir.\n\nBarbunya hassas, lezzetli eti ve yüksek protein içeriği için oldukça değerlidir. Akdeniz mutfağında genellikle ızgara, fırınlanmış veya kızartma olarak pişirilir. Taze barbunya en iyi lezzet ve besin değerini sunar. Doğal populasyonlarını ve deniz ekosistemlerinin sağlığını korumak için sürdürülebilir balıkçılık uygulamaları önemlidir.",
        "distribution_habitat": "Akdeniz ve Karadeniz'in kumlu ve çamurlu deniz diplerinde yaşar, genellikle 10 ile 100 metre arasındaki derinliklerde.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1qCrfny8Obe07Sw3hNsomTy__lZRNLepu"]
      },
      {
        "id": 23,
        "3d_model": "https://sketchfab.com/models/2e7c02b1826a407dafc65be285fb3684/embed",
        "type": "fish",
        "animal_name": "Kılıç Balığı",
        "max_size": 450,
        "max_weight": 600,
        "max_depth": 800,
        "other_names": ["Xiphias gladius"],
        "colors": ["#191970", "#C0C0C0"],
        "family": "Xiphiidae",
        "habitat": "Açık deniz, Ege ve Akdeniz",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "yalnız yaşar",
        "locations": ["Girit açıklarında", "Ege Denizi"],
        "locations_description": "Tropikal ve ılıman denizlerde yaygındır. Kılıç balıkları avlarını kesmek için kullandıkları uzun gagalarıyla bilinen doruk yırtıcılardır ve pelajik ekosistemlerde önemli bir rol oynarlar.",
        "description": "Kılıç Balığı (Xiphias gladius) Akdeniz ve Atlantik Okyanusu dahil olmak üzere dünyanın dört bir yanındaki okyanüslarda bulunan büyük, göçmen yırtıcı bir balıktır. Genellikle 1,5–3 metre uzunluğunda ve 30–200 kg ağırlığında olan kılıç balığı, daha küçük balıkları ve kalamarları avlamak için kullandığı uzun, düz, kılıca benzer bir gagaya ve aerodinamik bir gövdeye sahiptir.\n\nKılıç balığı protein açısından zengin ve yağ oranı düşük, sert, etli eti için oldukça değerlidir. Akdeniz ve uluslararası mutfaklarda genellikle ızgara, fırınlanmış veya sote edilmiş olarak pişirilir. Taze kılıç balığı mükemmel tat ve besin faydaları sunar. Kılıç balığı populasyonlarını korumak ve okyanus ekosistemi dengesini korumak için sürdürülebilir balıkçılık uygulamaları gereklidir.",
        "distribution_habitat": "Atlantik, Akdeniz ve Hint Okyanusu'nun açık sularında bulunur. Sıcak, derin suları tercih eder ve mevsimsel olarak göç eder.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Mcm71LNeIIO7KZggGx2GPPy3pUh60GE3"]
      },
      {
        "id": 24,
        "3d_model": "https://sketchfab.com/models/6515f625857041ad87bb6e2e5e5f6206/embed",
        "type": "creature",
        "animal_name": "Deniz Salyangozu",
        "max_size": 8,
        "max_weight": 0.1,
        "max_depth": 30,
        "other_names": ["Gastropoda"],
        "colors": ["#A52A2A", "#F5F5DC"],
        "family": "Gastropoda",
        "habitat": "Kıyı kayalıkları ve deniz tabanı",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "yalnız yaşar",
        "locations": ["Ege Denizi"],
        "locations_description": "Akdeniz ve Ege Denizi'nin tamamında yaygındır. Deniz salyangozları deniz tabanını temizlemede ve deniz ekosistemlerinde besinleri geri dönüştürmede önemli bir rol oynar.",
        "description": "Deniz Salyangozu (Deniz Salyangozu) Akdeniz, Ege ve Karadeniz dahil olmak üzere dünyanın dört bir yanındaki okyanüslarda bulunan küçük, yavaş hareket eden bir deniz yumuşakçasıdır. Yırtıcılardan koruma sağlayan spiral bir kabuğa ve hareket etmek ve alglerle, döküntülerle veya küçük omurgasızlarla beslenmek için kullandığı yumuşak bir gövdeye sahiptir.\n\nDeniz salyangozları çeşitli mutfaklarda, özellikle Akdeniz bölgelerinde, yumuşak, lezzetli etleri için tüketilir. Ayrıca algleri otlayarak ve deniz ekosistemlerinin dengesine katkıda bulunarak önemli bir ekolojik rol oynarlar. Habitatlarını korumak, sağlıklı popülasyonları sürdürmek ve deniz biyoçeşitliliğini korumak için gereklidir.",
        "distribution_habitat": "Sığ kıyı bölgelerinde, kayalık kıyılarda ve kumlu deniz diplerinde yaşar, alglerle ve döküntülerle beslenir.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1hczsTgmq4_EjXk-zcpH30hiwaYYZB9Bj"]
      },
      {
        "id": 32,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Mercan",
        "max_size": 25,
        "max_weight": 1,
        "max_depth": 20,
        "other_names": ["Corallium rubrum"],
        "colors": ["#FF0000", "#FFA500"],
        "family": "Scleractinia",
        "habitat": "Ege Denizi kıyıları, kayalık resifler",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "koloniler halinde",
        "locations": ["Ege Denizi"],
        "locations_description": "Kayalık resiflerde yoğun olarak görülür.",
        "description": "Mercan Balıkları tropikal ve subtropikal denizlerde mercan resiflerinde yaşayan renkli ve çeşitli türlerdir. Boyut, şekil ve renk açısından büyük ölçüde değişirler, genellikle resif ortamına karışmalarına yardımcı olan canlı desenler sergilerler. Mercan balıkları alglerle, planktonla ve küçük omurgasızlarla beslenir, resif sağlığını korumada önemli bir rol oynar.\n\nProtein açısından zengin ve genellikle yağ oranı düşük olan bazı mercan balığı türleri yerel olarak tüketilir, ancak daha yaygın olarak deniz ekosistemlerinde ve akvaryumlarda güzellikleri için hayranlık duyulurlar. Mercan resiflerini korumak gereklidir, çünkü barınak, üreme ve gıda için sağlıklı resif habitatlarına güvenirler.",
        "distribution_habitat": "Sığ kayalık ve resif alanları.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1CTGsUj276H5Cx-28Gnc6xfCyVC_RmGgp"]
      },
      {
        "id": 33,
        "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
        "type": "other",
        "animal_name": "Deniz Yosunu",
        "max_size": 45,
        "max_weight": 1.2,
        "max_depth": 25,
        "other_names": ["Alg"],
        "colors": ["#008000", "#A52A2A"],
        "family": "Phaeophyceae",
        "habitat": "Kıyı kayalıkları, sığ deniz alanları",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "koloniler halinde",
        "locations": ["Ege Denizi"],
        "locations_description": "Akdeniz, Ege ve Karadeniz'in tamamında bulunur. Deniz bitkileri sayısız deniz organizması için oksijen, barınak ve gıda sağlar ve deniz tabanı tortullarını stabilize etmeye yardımcı olur.",
        "description": "Deniz Yosunu (Deniz Algleri) Akdeniz, Ege ve Karadeniz dahil olmak üzere dünyanın dört bir yanındaki okyanüslarda bulunan çeşitli deniz bitkileridir. Kayalara veya deniz tabanına tutunarak büyürler ve yeşil, kahverengi ve kırmızı dahil olmak üzere çeşitli renklerde gelirler. Deniz yosunu sayısız deniz türü için gıda, barınak ve oksijen sağlar.\n\nVitamin, mineral, lif ve antioksidanlar açısından zengin olan deniz yosunu birçok mutfakta, özellikle Asya'da tüketilir ve ayrıca takviyeler, kozmetikler ve gübrelerde kullanılır. Besin değerinin ötesinde, deniz yosunu biyoçeşitliliği destekleyerek ve su kalitesini koruyarak deniz ekosistemlerinde hayati bir rol oynar.",
        "distribution_habitat": "Bol güneş ışığı alan sığ kıyı sularında büyür. Besin açısından zengin ortamlarda gelişen deniz çayırları ve algleri içerir.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=17kDgX91KiYj9IN8LgtsMCP2TWn2tpqFc"]
      }
    ]
  },
  {
    "country": "Portekiz",
    "country_image": "portugal",
    "animals": [
      {
        "id": 10,
        "3d_model": "https://sketchfab.com/models/d7a2d0bd2a524d35b01e0d898b026479/embed",
        "type": "fish",
        "animal_name": "Sardalya",
        "max_size": 30,
        "max_weight": 0.3,
        "max_depth": 100,
        "other_names": ["Sardina pilchardus", "Sardalya"],
        "colors": ["#008080", "#C0C0C0"],
        "family": "Clupeidae",
        "habitat": "Açık denizde ve kıyı sularında sürüler halinde",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "yoğun sürüler halinde göç ve beslenme",
        "locations": ["Portekiz Atlantik kıyısı"],
        "locations_description": "Portekiz'de en çok tüketilen balıklardan biri",
        "description": "Sardalya (Sardina pilchardus / Sardinops sagax) Akdeniz, Atlantik Okyanusu ve diğer ılıman sularda yaygın olarak bulunan küçük, yağlı bir balıktır. Genellikle 15–25 cm uzunluğunda ve yaklaşık 0,1–0,2 kg ağırlığında olan sardalyalar, mavimsi-yeşil bir sırta sahip ince, gümüşi bir gövdeye sahiptir. Genellikle büyük sürüler halinde yüzer ve plankton ve küçük kabuklularla beslenir.\n\nSardalyalar omega-3 yağ asitleri, protein, vitamin ve mineraller açısından zengindir, kalp sağlığını ve genel beslenmeyi destekler. Mutfakta genellikle ızgara, konserve veya tütsülenmiş olarak hazırlanır. Taze sardalyalar en iyi lezzet ve besin faydalarını sunar ve populasyonlarını korumak için sürdürülebilir balıkçılık uygulamaları gereklidir.",
        "distribution_habitat": "Kıyı açık deniz, sürüler halinde göç yolları, sığ ve orta derinlikler.",
        "image_paths": ["images/sardine_pt1.png", "images/sardine_pt2.png"]
      },
      {
        "id": 11,
        "3d_model": "https://sketchfab.com/models/a3d0e1a597794a9bb74739a13cfc8b77/embed",
        "type": "fish",
        "animal_name": "Çipura (Dourada / Çipura)",
        "max_size": 60,
        "max_weight": 5,
        "max_depth": 40,
        "other_names": ["Sparus aurata", "Dourada"],
        "colors": ["#C0C0C0", "#FFD700"],
        "family": "Sparidae",
        "habitat": "Kıyı lagünleri, haliç ağızları, sığ deniz",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "genç evresinde sürüler halinde",
        "locations": ["Portekiz kıyıları"],
        "locations_description": "Akdeniz ve Avrupa Atlantik kıyıları boyunca yaygın olarak bulunur. Çipura yerel balıkçılık ve su ürünleri yetiştiriciliğinde önemli bir türdür, hem ekonomiye hem de kıyı deniz ekosistemlerine katkıda bulunur.",
        "description": "Çipura (Sparus aurata) Akdeniz, Ege Denizi ve Doğu Atlantik Okyanusu'nda bulunan popüler bir kıyı balığıdır. Genellikle 20–50 cm uzunluğunda ve 0,3–2 kg ağırlığında, gözleri arasında belirgin bir altın şerit bulunan gümüşi bir gövdeye sahiptir. Çipura küçük omurgasızlar, kabuklular ve alglerle beslenir.\n\nProtein, vitamin ve mineraller açısından zengin olup sert, lezzetli eti için oldukça değerlidir. Akdeniz mutfağında genellikle ızgara, fırınlanmış veya buğulama olarak pişirilir. Taze çipura mükemmel tat ve besin faydaları sunar. Gelecek nesiller için doğal populasyonlarını korumak için sürdürülebilir balıkçılık gereklidir.",
        "distribution_habitat": "Akdeniz, Ege Denizi ve Doğu Atlantik Okyanusu'nun sığ kıyı suları, lagünleri ve haliçlerinde bulunur. Küçük omurgasızlar, kabuklular ve algler için arama yapabileceği kumlu veya çamurlu dipleri tercih eder.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1yIXZXGjKKIsXpRLADY00k9G8OyASw6jA",
          "https://drive.google.com/uc?export=view&id=1_AkVeoIi2nt68BYwAPvlBj7Ym0NUEkVi"
        ]
      },
      {
        "id": 12,
        "3d_model": "https://sketchfab.com/models/fc781bee9c0e4378a109acc8b728a86b/embed",
        "type": "fish",
        "animal_name": "Avrupa Levreği (Robalo)",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Dicentrarchus labrax", "Robalo"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Kıyı denizleri, nehir ağızları",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "bireysel veya küçük gruplar halinde",
        "locations": ["Portekiz Atlantik kıyıları"],
        "locations_description": "Akdeniz, Karadeniz ve Avrupa Atlantik kıyıları boyunca geniş çapta dağılmıştır. Avrupa deniz levreği hem ticari hem de sportif balıkçılık için önemli bir türdür ve kıyı ekosistemlerinde yırtıcı olarak önemli bir rol oynar.",
        "description": "Avrupa Deniz Levreği (Dicentrarchus labrax) Akdeniz, Karadeniz ve Doğu Atlantik Okyanusu'nda bulunan geniş çapta takdir edilen kıyı balığıdır. Genellikle 30–60 cm uzunluğunda ve 0,5–3 kg ağırlığında, hafif daha koyu bir sırta sahip aerodinamik gümüşi-gri bir gövdeye sahiptir. Avrupa deniz levreği, daha küçük balıklar, kabuklular ve yumuşakçalarla beslenen yırtıcı bir balıktır.\n\nYüksek kaliteli protein, omega-3 yağ asitleri, vitamin ve mineraller açısından zengin olup kalp sağlığını ve genel beslenmeyi destekler. Akdeniz mutfağında genellikle ızgara, fırınlanmış veya buğulama olarak pişirilir. Taze Avrupa deniz levreği mükemmel lezzet ve besin değeri sunar ve sağlıklı populasyonları korumak için sürdürülebilir balıkçılık uygulamaları gereklidir.",
        "distribution_habitat": "Akdeniz, Karadeniz ve Doğu Atlantik Okyanusu'nun kıyı suları, haliçleri ve lagünlerinde bulunur. Daha küçük balıkları ve kabukluları avlayabileceği kumlu veya kayalık diplere sahip sığ, korunaklı alanları tercih eder.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1q70Dggz_KoCODH27L_54BOJCYYk30kVk",
          "https://drive.google.com/uc?export=view&id=1VzCRvcoXi8JQJkMplm3l5vmF1-ssyw9x"
        ]
      },
      {
        "id": 25,
        "3d_model": "https://sketchfab.com/models/e3860feecc4f4247826a2542f1770e92/embed",
        "type": "fish",
        "animal_name": "Atlantik Morinası (Bacalhau)",
        "max_size": 150,
        "max_weight": 40,
        "max_depth": 600,
        "other_names": ["Gadus morhua", "Bacalhau"],
        "colors": ["#D2B48C", "#FFFFFF"],
        "family": "Gadidae",
        "habitat": "Atlantik Okyanusu'nun derin suları",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "küçük sürüler halinde",
        "locations": ["Portekiz açıklarında"],
        "locations_description": "Norveç, İzlanda ve Kanada kıyıları boyunca yaygın olarak bulunur. Atlantik morinası ekonomik açıdan en önemli balık türlerinden biridir ve Kuzey Atlantik deniz ekosistemlerinin temel taşıdır.",
        "description": "Atlantik Morinası (Gadus morhua) Kuzey Atlantik Okyanusu'nda yaygın olarak bulunan soğuk su balığıdır. Genellikle 50–100 cm uzunluğunda ve 2–20 kg ağırlığında olan Atlantik morinası, açık kahverengi ila yeşilimsi renklendirme ve belirgin beyaz yan çizgi ile sağlam, uzun bir gövdeye sahiptir. Daha küçük balıklar, kabuklular ve omurgasızlarla beslenir.\n\nAtlantik morinası protein açısından zengin ve yağ oranı düşük, hafif, pul pul dökülür beyaz eti için oldukça değerlidir. Genellikle fırınlanmış, ızgara veya kızartma olarak hazırlanır. Morina yırtıcı olarak deniz ekosistemlerinde önemli bir rol oynar ve sağlıklı populasyonları korumak ve okyanus biyoçeşitliliğini korumak için sürdürülebilir balıkçılık uygulamaları kritik öneme sahiptir.",
        "distribution_habitat": "Kuzey Atlantik'in soğuk ve ılıman sularında, kumlu veya çamurlu alanlarda deniz tabanına yakın yaşar. 20 ile 200 metre arasındaki derinlikleri tercih eder.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Kk3xifAZ9iSkh2FSgnkAprLqv-IVdFGM"]
      },
      {
        "id": 26,
        "3d_model": "https://sketchfab.com/models/6dbfc4b0a1dd4f20b628475383cc11bc/embed",
        "type": "fish",
        "animal_name": "Dülger Balığı (Peixe-galo)",
        "max_size": 70,
        "max_weight": 5,
        "max_depth": 200,
        "other_names": ["Zeus faber", "Peixe-galo"],
        "colors": ["#FFD700", "#000000"],
        "family": "Zeidae",
        "habitat": "Atlantik kıyı bölgeleri",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "yalnız dolaşır",
        "locations": ["Portekiz'in batı kıyısı"],
        "locations_description": "Akdeniz, Atlantik ve bazı ılıman denizlerde yaygın olarak bulunur. Dülger balığı bu bölgelerde hem balıkçılık hem de üreme için ideal koşullar bulur ve deniz ekosisteminde yırtıcı olarak önemli bir rol oynar.",
        "description": "Dülger Balığı (Zeus faber) Akdeniz, Atlantik Okyanusu ve diğer ılıman sularda bulunan kıyı balığıdır. Genellikle 30–65 cm uzunluğunda ve 0,5–3 kg ağırlığında olan dülger balığı, her iki tarafında belirgin koyu bir leke bulunan yandan sıkıştırılmış, zeytin yeşili ila kahverengi bir gövdeye sahiptir. Daha küçük balıklar ve omurgasızlarla beslenir.\n\nDülger balığı protein açısından zengin ve yağ oranı düşük, hassas, beyaz eti için değerlidir. Akdeniz mutfağında genellikle ızgara, fırınlanmış veya buğulama olarak hazırlanır. Taze dülger balığı mükemmel lezzet ve besin değeri sunar. Gelecek nesiller için doğal populasyonlarını korumak için sürdürülebilir balıkçılık önemlidir.",
        "distribution_habitat": "Kıyı sığ suları ve açık deniz alanlarında bulunur; genellikle kumlu veya çamurlu deniz diplerine yakın alanları tercih eder. Bu habitat, avını kolayca yakalayabileceği ve kendini kamufle edebileceği bir ortam sağlar.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1uts6OHif0EpFz2hogdZOEpdipZFr85fi"]
      },
      {
        "id": 27,
        "3d_model": "https://sketchfab.com/3d-models/deep-sea-sponge-4cd0e97040c9404e90d9645fc0f69aab",
        "type": "creature",
        "animal_name": "Deniz Süngeri",
        "max_size": 50,
        "max_weight": 1,
        "max_depth": 100,
        "other_names": ["Porifera"],
        "colors": ["#FFFF00", "#A52A2A"],
        "family": "Porifera",
        "habitat": "Kayalık dipler, kıyı mağaraları",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "koloniler halinde yaşar",
        "locations": ["Atlantik kıyısı", "Açık deniz kayalıkları"],
        "locations_description": "Akdeniz ve Ege kıyıları boyunca, özellikle Portekiz ve Yunanistan yakınlarında yaygındır. Deniz süngerleri suyu filtreler, temel ekosistem hizmetleri ve küçük deniz türleri için barınak sağlar.",
        "description": "Deniz Süngeri Akdeniz, Ege ve Karadeniz dahil olmak üzere dünyanın dört bir yanındaki okyanüslarda bulunan basit, gözenekli bir deniz hayvanıdır. Deniz süngerleri kayalara veya deniz tabanına tutunur ve besin elde etmek için suyu filtreler, sağlıklı deniz ekosistemlerini korumada önemli bir rol oynar. Çeşitli şekil, boyut ve renklerde gelirler, birçok küçük deniz organizması için barınak sağlarlar.\n\nİnsanlar yüzyıllardır deniz süngerlerini öncelikli olarak banyo, temizlik ve kozmetik amaçlarla kullanmışlardır. Ayrıca potansiyel tıbbi uygulamalar için araştırılan doğal bileşikler içerirler. Deniz habitatlarını korumak, sünger popülasyonlarının ve onlara bağımlı türlerin hayatta kalmasını sağlar.",
        "distribution_habitat": "Kayalık kıyı alanlarını ve deniz tabanını kaplar, katı yüzeylere tutunur. Sabit akıntıları olan temiz, iyi oksijenlenmiş suları tercih eder.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rjP7JFadGU4u366K3cBYzzoxFgv4FUUR"]
      },
      {
        "id": 35,
        "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
        "type": "other",
        "animal_name": "Deniz Çayırı",
        "max_size": 60,
        "max_weight": 1.5,
        "max_depth": 15,
        "other_names": ["Zostera marina"],
        "colors": ["#008000"],
        "family": "Zosteraceae",
        "habitat": "Sığ kıyı alanları, lagünler",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "koloniler halinde",
        "locations": ["Portekiz kıyıları"],
        "locations_description": "Kıyı sığ sularında bulunur ve balıklar ve çeşitli omurgasızlar için önemli bir habitat oluşturur. Bu alanlar hem beslenme hem de üreme için ideal bir ortam sağlar. Deniz çayırı çayırları hem barınak sunar hem de sualtı ekosistemi içinde küçük organizmaların gizlenmesine yardımcı olarak biyoçeşitliliği destekler.",
        "description": "Deniz Bitkileri (Deniz Bitkileri) Akdeniz, Ege ve Karadeniz dahil olmak üzere dünyanın dört bir yanındaki okyanus ve denizlerde bulunan fotosentez yapan organizmalardır. Sığ sularda büyüyen, deniz tabanına tutunmuş veya serbestçe yüzen deniz çayırları, algler ve diğer su bitkilerini içerir. Deniz bitkileri sayısız deniz türü için gıda, oksijen ve barınak sağlar.\n\nBesin açısından zengin olan deniz bitkileri sağlıklı deniz ekosistemlerini korumada önemli bir rol oynar. Kıyı erozyonunu önlemeye yardımcı olur, karbondioksit emer ve biyoçeşitliliği destekler. Deniz bitkilerini korumak, okyanus sağlığını ve onlara bağımlı sayısız türü sürdürmek için gereklidir.",
        "distribution_habitat": "Sığ ve sakin deniz alanlarında bulunur; genellikle kayalık veya kumlu diplere sahip kıyı bölgelerinde büyür. Bu alanlar yeterli ışık almak ve besinleri kolayca elde etmek için uygundur. Deniz bitkileri hem oksijen üretir hem de sualtı ekosistemi içinde birçok küçük deniz yaratığı için barınak sağlar.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      }
    ]
  }
]