[
  {
    "country": "Türkiye",
    "country_image": "turkey",
    "animals": [
      {
        "id": 0,
        "3d_model": "https://sketchfab.com/models/723309708e9e403c8808617386594851/embed",
        "type": "fish",
        "animal_name": "Γαύρος",
        "max_size": 20,
        "max_weight": 0.2,
        "max_depth": 200,
        "other_names": ["Engraulis encrasicolus", "Γαύρος του Εύξεινου Πόντου"],
        "colors": ["#607D8B", "#B0BEC5"],
        "family": "Engraulidae",
        "habitat": "Ακτές του Εύξεινου Πόντου, μεταναστευτικές διαδρομές σε ανοιχτή θάλασσα",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "μεταναστεύει σε κοπάδια",
        "locations": ["Εύξεινος Πόντος", "Θάλασσα του Μαρμαρά"],
        "locations_description": "Συνηθισμένος κατά μήκος των ακτών της Τουρκίας και των γύρω θαλασσών. Οι γαύροι είναι ζωτικής σημασίας στη θαλάσσια τροφική αλυσίδα, χρησιμεύοντας ως λεία για μεγαλύτερα ψάρια και θαλασσοπούλια, και καταναλώνονται ευρέως από τους ανθρώπους λόγω της διατροφικής τους αξίας.",
        "description": "Ο γαύρος (Engraulis encrasicolus) είναι ένα μικρό, λιπαρό ψάρι που βρίσκεται συνήθως στον Εύξεινο Πόντο, τη Θάλασσα του Μαρμαρά και το Αιγαίο Πέλαγος. Συνήθως μήκους 10–20 cm και βάρους περίπου 0,1–0,2 kg, οι γαύροι έχουν ένα λεπτό, ασημένιο σώμα με γαλαζοπράσινη ράχη. Συνήθως κολυμπούν σε μεγάλα κοπάδια και τρέφονται με πλαγκτόν και μικρά καρκινοειδή.\n\nΟι γαύροι είναι πλούσιοι σε λιπαρά οξέα ωμέγα-3, πρωτεΐνες, βιταμίνες και μέταλλα, υποστηρίζοντας την υγεία της καρδιάς και τη συνολική διατροφή. Στην τουρκική κουζίνα είναι ιδιαίτερα δημοφιλείς το φθινόπωρο και το χειμώνα, συχνά ψημένοι στη σχάρα, τηγανητοί ή χρησιμοποιούνται σε τουρσί. Οι φρέσκοι γαύροι προσφέρουν την καλύτερη γεύση και θρεπτική αξία. Οι βιώσιμες πρακτικές αλιείας είναι σημαντικές για τη διατήρηση του φυσικού τους πληθυσμού.",
        "distribution_habitat": "Βρίσκεται σε παράκτια και ανοιχτά νερά του Εύξεινου Πόντου, της Θάλασσας του Μαρμαρά και του Αιγαίου Πελάγους. Προτιμά ρηχές περιοχές με άφθονο πλαγκτόν για τροφή, συχνά σχηματίζοντας μεγάλα κοπάδια για προστασία και αποτελεσματική συλλογή τροφής.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1pHXHM179a8zu6XR9cS3tHqokq0wa0gWf",
          "https://drive.google.com/uc?export=view&id=1zqZFDOT8keqhheRJJqjuezqUDpQ1wyah"
        ]
      },
      {
        "id": 1,
        "3d_model": "https://sketchfab.com/models/e59ba168962348acaa739a000249b534/embed",
        "type": "fish",
        "animal_name": "Ευρωπαϊκό Λαβράκι",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Dicentrarchus labrax", "Λαβράκι"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Ακτές του Αιγαίου και της Μεσογείου, κόλποι, λιμνοθάλασσες",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "μοναχικό ή σε μικρές ομάδες",
        "locations": ["Αιγαίο Πέλαγος", "Μεσόγειος Θάλασσα"],
        "locations_description": "Κοινό κατά μήκος των δυτικών ακτών της Τουρκίας, τόσο μέσω άγριας αλιείας όσο και μέσω υδατοκαλλιέργειας.",
        "description": "Το λαβράκι (Dicentrarchus labrax) είναι ένα δημοφιλές και θρεπτικό ψάρι που βρίσκεται στη Μεσόγειο Θάλασσα, το Αιγαίο Πέλαγος και κατά μήκος των ακτών της Ευρώπης. Συνήθως μήκους 30–60 cm και βάρους 0,5–3 kg, το λαβράκι έχει ένα κομψό, ασημί-γκρίζο σώμα με ελαφρώς πιο σκούρα ράχη. Είναι ένα αρπακτικό ψάρι, που τρέφεται με μικρότερα ψάρια και καρκινοειδή.\n\nΤο λαβράκι είναι πλούσιο σε υψηλής ποιότητας πρωτεΐνες, λιπαρά οξέα ωμέγα-3, βιταμίνες και μέταλλα, καθιστώντας το ευεργετικό για την υγεία της καρδιάς και τη γενική ευεξία. Στην τουρκική και μεσογειακή κουζίνα συνήθως ψήνεται στη σχάρα, ψήνεται ή μαγειρεύεται στον ατμό. Το φρέσκο λαβράκι προσφέρει την καλύτερη γεύση και θρεπτική αξία. Η βιώσιμη αλιεία διασφαλίζει ότι αυτό το πολύτιμο είδος παραμένει άφθονο για τις μελλοντικές γενιές.",
        "distribution_habitat": "Παράκτιες βραχώδεις και αμμώδεις περιοχές, εκβολές, ρηχά έως μέτριου βάθους νερά.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1Jvyd4iPpBe3yRXRhAB3jdKIof6o8TuWI",
          "https://drive.google.com/uc?export=view&id=1KoQ8Jv_6zeL4jf_2DDB0NpkNwGaBVRv-"
        ]
      },
      {
        "id": 3,
        "3d_model": "https://sketchfab.com/models/9597628972c144f4a166a53c142cd9ca/embed",
        "type": "fish",
        "animal_name": "Παλαμίδα",
        "max_size": 90,
        "max_weight": 6,
        "max_depth": 300,
        "other_names": ["Sarda sarda", "Ψάρι παλαμίδα"],
        "colors": ["#1E90FF", "#C0C0C0"],
        "family": "Scombridae",
        "habitat": "Ανοιχτή θάλασσα, μεταναστευτικές διαδρομές",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "μεταναστεύει και κυνηγά σε κοπάδια",
        "locations": ["Θάλασσα του Μαρμαρά", "Αιγαίο Πέλαγος"],
        "locations_description": "Ένα μεταναστευτικό είδος που αλιεύεται εντατικά κατά μήκος των τουρκικών ακτών κατά τους φθινοπωρινούς μήνες.",
        "description": "Η παλαμίδα (Sarda sarda) είναι ένα νόστιμο και θρεπτικό λιπαρό ψάρι που βρίσκεται συνήθως στον Εύξεινο Πόντο, τη Θάλασσα του Μαρμαρά και το Αιγαίο Πέλαγος. Συνήθως μήκους 20–60 cm και βάρους 0,2–3 kg, η παλαμίδα έχει σκούρο μπλε-πράσινο άνω σώμα και ασημί-λευκό κάτω μέρος. Συνήθως κολυμπά σε κοπάδια και τρέφεται με πλαγκτόν και μικρά ψάρια.\n\nΠλούσια σε λιπαρά οξέα ωμέγα-3, πρωτεΐνες, βιταμίνες και μέταλλα, η τακτική κατανάλωση παλαμίδας υποστηρίζει την υγεία της καρδιάς και ενισχύει το ανοσοποιητικό σύστημα. Στην τουρκική κουζίνα απολαμβάνεται ιδιαίτερα κατά τη διάρκεια του φθινοπώρου και του χειμώνα, παρασκευασμένη ψητή στη σχάρα, τηγανητή ή μαγειρεμένη στον ατμό. Η φρέσκια παλαμίδα προσφέρει την καλύτερη γεύση και θρέψη. Οι βιώσιμες πρακτικές αλιείας είναι απαραίτητες για τη διατήρηση του φυσικού της πληθυσμού.",
        "distribution_habitat": "Ανοιχτή θάλασσα και παράκτιες μεταβατικές ζώνες, μέτρια έως βαθιά νερά.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1zaMhXPO4AtI1MIbu55zBfnaERO_Apd5-",
          "https://drive.google.com/uc?export=view&id=16VlhQGqjLkbKQ5SRmFVghawkc4m"
        ]
      },
      {
        "id": 13,
        "3d_model": "https://sketchfab.com/models/3cfe9d4021b14a5fad8372bcb490956b/embed",
        "type": "creature",
        "animal_name": "Μέδουσα",
        "max_size": 30,
        "max_weight": 0.5,
        "max_depth": 50,
        "other_names": ["Aurelia aurita"],
        "colors": ["#FFFFFF", "#FFC0CB"],
        "family": "Ulmaridae",
        "habitat": "Ανοιχτή θάλασσα και παράκτια νερά",
        "poisonous": true,
        "edible": false,
        "danger_to_human": true,
        "social_behaviour": "σχηματίζει ομάδες και παρασύρεται συλλογικά",
        "locations": ["Εύξεινος Πόντος", "Αιγαίο Πέλαγος"],
        "locations_description": "Κοινές στη Μεσόγειο και το Αιγαίο Πέλαγος. Οι πληθυσμοί μεδουσών συχνά αυξάνονται το καλοκαίρι, παίζοντας ρόλους τόσο αρπακτικού όσο και θηράματος στα θαλάσσια οικοσυστήματα.",
        "description": "Οι μέδουσες είναι συναρπαστικά θαλάσσια ζώα που βρίσκονται σε ωκεανούς σε όλο τον κόσμο, συμπεριλαμβανομένης της Μεσογείου, του Αιγαίου και του Εύξεινου Πόντου. Έχουν ένα μαλακό, ζελατινώδες σώμα, συχνά σε σχήμα ομπρέλας, με πλοκάμια που μπορούν να τσιμπήσουν για να πιάσουν θήραμα. Οι μέδουσες ποικίλλουν σημαντικά σε μέγεθος, από λίγα εκατοστά έως πάνω από ένα μέτρο σε διάμετρο.\n\nΑν και δεν καταναλώνονται συνήθως σε πολλές δυτικές δίαιτες, οι μέδουσες είναι πηγή πρωτεΐνης και τρώγονται σε ορισμένες ασιατικές κουζίνες. Παίζουν σημαντικό ρόλο στα θαλάσσια οικοσυστήματα ελέγχοντας τους πληθυσμούς πλαγκτού και χρησιμεύοντας ως τροφή για μεγαλύτερα θαλάσσια ζώα. Η παρατήρηση μεδουσών μπορεί να είναι υπνωτιστική, αλλά συνιστάται προσοχή λόγω των ικανοτήτων τσιμπήματός τους.",
        "distribution_habitat": "Κατοικεί σε ανοιχτές θάλασσες και παράκτια νερά, παρασυρόμενη από τα ωκεάνια ρεύματα. Προτιμά εύκρατες έως ζεστές περιοχές με άφθονο πλαγκτόν.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1SVHv7w7LKfaFsxzhz_2la7JaZgRttbSZ"
        ]
      },
      {
        "id": 14,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Κοράλλι",
        "max_size": 15,
        "max_weight": 1,
        "max_depth": 10,
        "other_names": ["Κοράλλι"],
        "colors": ["#FF0000", "#FFA500", "#FFC0CB"],
        "family": "Scleractinia",
        "habitat": "Ρηχές τροπικές θάλασσες",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "ζει σε αποικίες",
        "locations": ["Μεσόγειος Θάλασσα"],
        "locations_description": "Κοινό σε τμήματα της Μεσογείου και της Ερυθράς Θάλασσας. Τα θαλάσσια κοράλλια χτίζουν πολύπλοκους οικότοπους που φιλοξενούν ένα ευρύ φάσμα θαλάσσιων ειδών και προστατεύουν τις ακτές από τη διάβρωση.",
        "description": "Τα κοράλλια είναι πολύχρωμοι και ποικίλοι θαλάσσιοι οργανισμοί που κατοικούν σε κοραλλιογενείς υφάλους σε τροπικές και υποτροπικές θάλασσες. Ποικίλλουν ευρέως σε μέγεθος, σχήμα και χρώμα, συχνά επιδεικνύοντας ζωντανά μοτίβα που τους βοηθούν να αναμειγνύονται στο περιβάλλον του υφάλου. Τα κοράλλια τρέφονται με πλαγκτόν και βασίζονται σε συμβιωτικά φύκια για θρεπτικά συστατικά, παίζοντας κρίσιμο ρόλο στη διατήρηση των οικοσυστημάτων των υφάλων.\n\nΑν και δεν καταναλώνονται ως τροφή, τα κοράλλια είναι ζωτικής σημασίας για τη βιοποικιλότητα, παρέχοντας καταφύγιο και χώρους αναπαραγωγής για αμέτρητα θαλάσσια είδη. Η προστασία των κοραλλιογενών υφάλων είναι απαραίτητη για τη διατήρηση της θαλάσσιας ζωής και τη διατήρηση υγιών ωκεάνιων οικοσυστημάτων.",
        "distribution_habitat": "Βρίσκεται σε ζεστές, ρηχές τροπικές και υποτροπικές θάλασσες, συχνά σχηματίζοντας υφάλους σε βραχώδη υποστρώματα.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1HJHlC3eQc_xQFkK7JsmrwD-1DJYY8Xjc"
        ]
      },
      {
        "id": 16,
        "3d_model": "https://sketchfab.com/models/caeca42dbdaf4895aa69a88a2a1bbb72/embed",
        "type": "fish",
        "animal_name": "Σαφρίδι",
        "max_size": 35,
        "max_weight": 0.5,
        "max_depth": 250,
        "other_names": ["Trachurus trachurus", "Σαφρίδι του Εύξεινου Πόντου"],
        "colors": ["#C0C0C0", "#6B8E23"],
        "family": "Carangidae",
        "habitat": "Ανοιχτά νερά του Εύξεινου Πόντου, της Θάλασσας του Μαρμαρά και του Αιγαίου Πελάγους",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "ζει και μεταναστεύει σε κοπάδια",
        "locations": ["Εύξεινος Πόντος", "Θάλασσα του Μαρμαρά"],
        "locations_description": "Συχνά βρίσκεται κατά μήκος των ακτών της Τουρκίας και των γειτονικών θαλασσών. Το σαφρίδι παίζει βασικό ρόλο στη θαλάσσια τροφική αλυσίδα, χρησιμεύοντας ως λεία για μεγαλύτερα ψάρια και θαλασσοπούλια, και καταναλώνεται ευρέως από τους ανθρώπους για τη διατροφική του αξία.",
        "description": "Το σαφρίδι (Trachurus trachurus) είναι ένα ευρέως κατανεμημένο λιπαρό ψάρι που βρίσκεται στον Εύξεινο Πόντο, τη Θάλασσα του Μαρμαρά και το Αιγαίο Πέλαγος. Συνήθως μήκους 20–40 cm και βάρους 0,2–1 kg, το σαφρίδι έχει ένα αεροδυναμικό ασημένιο σώμα με ελαφρώς πιο σκούρα ράχη. Συνήθως κολυμπά σε μεγάλα κοπάδια και τρέφεται με μικρά ψάρια, καρκινοειδή και πλαγκτόν.\n\nΤο σαφρίδι είναι πλούσιο σε λιπαρά οξέα ωμέγα-3, πρωτεΐνες, βιταμίνες και μέταλλα, καθιστώντας το ευεργετικό για την υγεία της καρδιάς και τη συνολική διατροφή. Στην τουρκική κουζίνα συνήθως ψήνεται στη σχάρα, τηγανίζεται ή χρησιμοποιείται σε στιφάδο. Το φρέσκο σαφρίδι προσφέρει την καλύτερη γεύση και θρεπτική αξία. Οι βιώσιμες πρακτικές αλιείας είναι απαραίτητες για τη διατήρηση των φυσικών του πληθυσμών.",
        "distribution_habitat": "Παράκτια νερά και μεταναστευτικές διαδρομές μέτριου βάθους.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1LQLDFOtTVF_Ne1qffc4-R4hLK4_lIMND"
        ]
      },
      {
        "id": 17,
        "3d_model": "https://sketchfab.com/models/3c007d219b704a8abd5a8f3bd302642e/embed",
        "type": "fish",
        "animal_name": "Γοφάρι",
        "max_size": 110,
        "max_weight": 14,
        "max_depth": 200,
        "other_names": ["Pomatomus saltatrix"],
        "colors": ["#1E90FF", "#C0C0C0"],
        "family": "Pomatomidae",
        "habitat": "Ανοιχτά νερά του Μαρμαρά, του Αιγαίου και του Εύξεινου Πόντου",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "κυνηγά σε κοπάδια",
        "locations": ["Τα Στενά (Βόσπορος και Δαρδανέλλια)", "Αιγαίο Πέλαγος"],
        "locations_description": "Διάσημο για το πέρασμά του από τα Στενά (Βόσπορος και Δαρδανέλλια) κατά τις περιόδους μετανάστευσης.",
        "description": "Το γοφάρι (Pomatomus saltatrix) είναι ένα δημοφιλές και θρεπτικό αρπακτικό ψάρι που βρίσκεται στον Εύξεινο Πόντο, τη Θάλασσα του Μαρμαρά και το Αιγαίο Πέλαγος. Συνήθως μήκους 30–50 cm και βάρους 0,5–2 kg, το γοφάρι έχει ένα αεροδυναμικό ασημί-μπλε σώμα με ελαφρώς πιο σκούρα ράχη. Κολυμπά σε κοπάδια και τρέφεται με μικρότερα ψάρια και καρκινοειδή.\n\nΤο γοφάρι είναι πλούσιο σε λιπαρά οξέα ωμέγα-3, υψηλής ποιότητας πρωτεΐνες, βιταμίνες και μέταλλα, υποστηρίζοντας την υγεία της καρδιάς και τη συνολική διατροφή. Στην τουρκική κουζίνα συνήθως ψήνεται στη σχάρα, τηγανίζεται ή ψήνεται, ειδικά το φθινόπωρο όταν είναι πιο άφθονο. Το φρέσκο γοφάρι προσφέρει την καλύτερη γεύση και θρεπτική αξία. Η βιώσιμη αλιεία είναι σημαντική για τη διατήρηση υγιών πληθυσμών για τις μελλοντικές γενιές.",
        "distribution_habitat": "Ανοιχτή θάλασσα και παράκτιες περιοχές.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1keiLq5vR5RNBz9roh4xmkKYEIwJJ_Oqr"
        ]
      },
      {
        "id": 18,
        "3d_model": "https://sketchfab.com/models/645b4a2217ef452581428e0510d7e607/embed",
        "type": "creature",
        "animal_name": "Αστερίας",
        "max_size": 25,
        "max_weight": 0.3,
        "max_depth": 100,
        "other_names": ["Asteroidea"],
        "colors": ["#FFA500", "#800080", "#FF0000"],
        "family": "Asteroidea",
        "habitat": "Βραχώδεις θαλάσσιοι πυθμένες του Αιγαίου και της Μεσογείου",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "ζει μόνος",
        "locations": ["Αιγαίο Πέλαγος"],
        "locations_description": "Συχνά βρίσκεται σε βραχώδεις πυθμένες.",
        "description": "Οι αστερίες είναι θαλάσσια ασπόνδυλα που βρίσκονται σε ωκεανούς σε όλο τον κόσμο, συμπεριλαμβανομένης της Μεσογείου, του Αιγαίου και του Εύξεινου Πόντου. Συνήθως έχουν σώμα σε σχήμα αστεριού με πέντε ή περισσότερα βραχίονες, τα οποία χρησιμοποιούν για κίνηση και σύλληψη θηραμάτων όπως τα μαλάκια. Οι αστερίες έχουν ένα μοναδικό υδραυλικό σύστημα που βοηθά στην κίνηση και τη διατροφή.\n\nΑν και δεν καταναλώνονται συνήθως ως τροφή, οι αστερίες παίζουν σημαντικό ρόλο στα θαλάσσια οικοσυστήματα ελέγχοντας τους πληθυσμούς άλλων ασπονδύλων και συμβάλλοντας στην υγεία των υφάλων. Η συναρπαστική τους εμφάνιση και οι αναγεννητικές τους ικανότητες—μερικά είδη μπορούν να αναγεννήσουν χαμένα βραχίονες—τις καθιστούν αντικείμενο ενδιαφέροντος για τη θαλάσσια βιολογία και τους λάτρεις των ενυδρείων.",
        "distribution_habitat": "Παράκτιοι βράχοι και θαλάσσιος πυθμένας.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1CQpLXxHjvlf7WTXHQ4OPOaJjWep872Sv"
        ]
      },
      {
        "id": 28,
        "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
        "type": "other",
        "animal_name": "Θαλάσσια Φύκια",
        "max_size": 50,
        "max_weight": 1,
        "max_depth": 30,
        "other_names": ["Φύκια", "Θαλάσσιο Βρύο"],
        "colors": ["#008000", "#8B4513"],
        "family": "Phaeophyceae",
        "habitat": "Ακτές του Αιγαίου και της Μεσογείου, βραχώδεις πυθμένες",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "σε αποικίες",
        "locations": ["Αιγαίο Πέλαγος", "Μεσόγειος Θάλασσα"],
        "locations_description": "Φαίνονται πυκνά σε παράκτιους βράχους.",
        "description": "Τα θαλάσσια φύκια (Θαλάσσια Άλγη) είναι ποικίλα θαλάσσια φυτά που βρίσκονται σε ωκεανούς σε όλο τον κόσμο, συμπεριλαμβανομένης της Μεσογείου, του Αιγαίου και του Εύξεινου Πόντου. Αναπτύσσονται σε ρηχά νερά και προσκολλώνται σε βράχους ή στον πυθμένα της θάλασσας. Τα θαλάσσια φύκια έρχονται σε διάφορα χρώματα—πράσινα, καφέ και κόκκινα—και παρέχουν οικότοπο και τροφή για πολλά θαλάσσια είδη.\n\nΤα θαλάσσια φύκια είναι εξαιρετικά θρεπτικά, πλούσια σε βιταμίνες, μέταλλα, φυτικές ίνες και αντιοξειδωτικά. Καταναλώνονται σε πολλές κουζίνες, ειδικά στην Ασία, και χρησιμοποιούνται επίσης σε συμπληρώματα, καλλυντικά και λιπάσματα. Πέρα από τη διατροφική τους αξία, τα θαλάσσια φύκια παίζουν ζωτικό ρόλο στα θαλάσσια οικοσυστήματα παράγοντας οξυγόνο, μειώνοντας το διοξείδιο του άνθρακα και υποστηρίζοντας τη βιοποικιλότητα.",
        "distribution_habitat": "Ρηχές παράκτιες περιοχές, βραχώδεις και αμμώδεις πυθμένες.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      },
      {
        "id": 29,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Κοράλλι",
        "max_size": 20,
        "max_weight": 1,
        "max_depth": 15,
        "other_names": ["Corallium rubrum"],
        "colors": ["#FF0000", "#FFA500"],
        "family": "Scleractinia",
        "habitat": "Μεσογειακές ακτές, βράχοι",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "σε αποικίες",
        "locations": ["Μεσόγειος Θάλασσα"],
        "locations_description": "Σχηματίζει πυκνές αποικίες σε παράκτιους βράχους.",
        "description": "Το κοράλλι (Θαλάσσιο Κοράλλι) είναι θαλάσσια ασπόνδυλα που βρίσκονται σε τροπικούς και υποτροπικούς ωκεανούς, σχηματίζοντας ζωντανά οικοσυστήματα υφάλων. Έχουν σκληρό ασβεστολιθικό σκελετό και ζουν σε αποικίες, δημιουργώντας πολύπλοκες δομές που παρέχουν καταφύγιο και τροφή για πολυάριθμα θαλάσσια είδη.\n\nΟι κοραλλιογενείς ύφαλοι υποστηρίζουν τη βιοποικιλότητα και προστατεύουν τις ακτές από τη διάβρωση. Αν και δεν καταναλώνονται συνήθως ως τροφή, τα κοράλλια είναι πολύ εκτιμώμενα για την οικολογική τους σημασία, την ομορφιά τους και τη χρήση τους στα κοσμήματα. Η προστασία των κοραλλιογενών υφάλων είναι ζωτικής σημασίας, καθώς η κλιματική αλλαγή, η ρύπανση και η υπεραλίευση απειλούν την επιβίωσή τους και τα αμέτρητα είδη που εξαρτώνται από αυτά.",
        "distribution_habitat": "Ρηχές και προστατευμένες βραχώδεις περιοχές.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1CTGsUj276H5Cx-28Gnc6xfCyVC_RmGgp"]
      }
    ]
  },
  {
    "country": "Βουλγαρία",
    "country_image": "bulgaria",
    "animals": [
      {
        "id": 4,
        "3d_model": "https://sketchfab.com/models/ef0c406d4ca84242a0464abecb7d7037/embed",
        "type": "fish",
        "animal_name": "Κοινός Κυπρίνος (Cyprinus carpio)",
        "max_size": 120,
        "max_weight": 30,
        "max_depth": 10,
        "other_names": ["Κεντρικός κυπρίνος γλυκού νερού", "Cyprinus carpio"],
        "colors": ["#8B4513", "#FFD700", "#A0522D"],
        "family": "Cyprinidae",
        "habitat": "Λίμνες γλυκού νερού, ποτάμια, δεξαμενές",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "σε κοπάδια όταν είναι νεαρός, πιο ατομικός ως ενήλικας",
        "locations": ["Σύστημα ποταμού Dolinata", "Βουλγαρικές λίμνες"],
        "locations_description": "Ένα από τα κοινά είδη γλυκού νερού στη Βουλγαρία για υδατοκαλλιέργεια και αλιεία.",
        "description": "Ο κοινός κυπρίνος (Cyprinus carpio) είναι ένα ψάρι γλυκού νερού που βρίσκεται ευρέως σε ποτάμια, λίμνες και λιμνούλες σε όλη την Ευρώπη, την Ασία και άλλες περιοχές. Συνήθως μήκους 40–80 cm και βάρους 2–14 kg, ο κοινός κυπρίνος έχει ένα εύρωστο, επιμήκες σώμα καλυμμένο με μεγάλα λέπια, συνήθως χρυσοκαφέ ή πρασινωπά στο χρώμα. Είναι ένα παμφάγο ψάρι, που τρέφεται με φυτά, έντομα και μικρά ασπόνδυλα.\n\nΟ κοινός κυπρίνος εκτιμάται για το υψηλό περιεχόμενό του σε πρωτεΐνη και συνήθως καλλιεργείται ή αλιεύεται για τροφή. Σε πολλούς πολιτισμούς, παρασκευάζεται ψητός στη σχάρα, ψημένος ή καπνιστός. Οι βιώσιμες πρακτικές αλιείας και υδατοκαλλιέργειας είναι σημαντικές για τη διατήρηση υγιών πληθυσμών, καθώς αυτό το προσαρμοστικό είδος παίζει βασικό ρόλο στα οικοσυστήματα γλυκού νερού.",
        "distribution_habitat": "Αργά ρέοντα ποτάμια, λίμνες, δεξαμενές, όχθες πλούσιες σε βλάστηση.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1kGxpZaSBrNpuwl_Fq9U0HRcNhKNinR8J",
          "https://drive.google.com/uc?export=view&id=1ofPUNU6cVELQciQBXkHNfWr5dzDdsU1y"
        ]
      },
      {
        "id": 5,
        "3d_model": "https://sketchfab.com/models/caeca42dbdaf4895aa69a88a2a1bbb72/embed",
        "type": "fish",
        "animal_name": "Σκουμπρί (Scomber scombrus)",
        "max_size": 60,
        "max_weight": 2,
        "max_depth": 200,
        "other_names": ["Makrel", "Scomber scombrus"],
        "colors": ["#008080", "#C0C0C0"],
        "family": "Scombridae",
        "habitat": "Ανοιχτές θαλάσσιες ακτές του Εύξεινου Πόντου",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "μεταναστεύει σε κοπάδια",
        "locations": ["Βουλγαρική ακτή του Εύξεινου Πόντου"],
        "locations_description": "Ένα από τα μεταναστευτικά και λιπαρά είδη ψαριών που καταναλώνονται συνήθως στη Βουλγαρία.",
        "description": "Το σκουμπρί (Scomber scombrus / Scomber japonicus) είναι ένα δημοφιλές λιπαρό ψάρι που βρίσκεται στον Ατλαντικό Ωκεανό, τη Μεσόγειο Θάλασσα και άλλα εύκρατα νερά. Συνήθως μήκους 20–60 cm και βάρους 0,2–3 kg, το σκουμπρί έχει ένα αεροδυναμικό, ασημένιο σώμα με σκούρα μπλε-πράσινη ράχη. Κολυμπά σε κοπάδια και τρέφεται με πλαγκτόν, μικρά ψάρια και καρκινοειδή.\n\nΠλούσιο σε λιπαρά οξέα ωμέγα-3, πρωτεΐνες, βιταμίνες και μέταλλα, το σκουμπρί υποστηρίζει την υγεία της καρδιάς, τη λειτουργία του εγκεφάλου και τη συνολική διατροφή. Στην κουζίνα, συνήθως ψήνεται στη σχάρα, καπνίζεται ή ψήνεται. Το φρέσκο σκουμπρί προσφέρει την καλύτερη γεύση και θρεπτική αξία, και οι βιώσιμες πρακτικές αλιείας είναι απαραίτητες για τη διατήρηση των φυσικών του πληθυσμών.",
        "distribution_habitat": "Παράκτια ανοιχτή θάλασσα, μεταναστευτικές διαδρομές, μέτρια βάθη.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1sB7adgM2bpufrcEy4-YDBxxB7e1b_YF6",
          "https://drive.google.com/uc?export=view&id=1FqCZO5pP8DCILMqN-LOYG19Q3tJU_zVE"
        ]
      },
      {
        "id": 6,
        "3d_model": "https://sketchfab.com/models/df09d2c1e3f34ebeb7dc957b3/embed",
        "type": "fish",
        "animal_name": "Καλκάνι του Εύξεινου Πόντου (Psetta maxima maeotica)",
        "max_size": 70,
        "max_weight": 5,
        "max_depth": 100,
        "other_names": ["Καλκάνι (Εύξεινος Πόντος)", "Psetta maxima"],
        "colors": ["#A52A2A", "#FFFFFF"],
        "family": "Scophthalmidae",
        "habitat": "Πυθμένας του Εύξεινου Πόντου, αμμώδεις και λασπώδεις πυθμένες",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "ζει μόνο",
        "locations": ["Βουλγαρική ακτή του Εύξεινου Πόντου"],
        "locations_description": "Ένας τύπος πλατυψάρου που αλιεύεται κατά μήκος της βουλγαρικής ακτής του Εύξεινου Πόντου.",
        "description": "Το καλκάνι του Εύξεινου Πόντου (Scophthalmus maeoticus) είναι ένα επίπεδο, βενθικό ψάρι που βρίσκεται στον Εύξεινο Πόντο και τη Θάλασσα του Μαρμαρά. Συνήθως μήκους 30–70 cm και βάρους 1–5 kg, το καλκάνι έχει ένα πλατύ, ρομβοειδές σώμα με αμμώδη-καφέ άνω πλευρά που το βοηθά να αναμειχθεί με τον πυθμένα της θάλασσας, και λευκή κάτω πλευρά. Τρέφεται με μικρά ψάρια, καρκινοειδή και άλλα ασπόνδυλα.\n\nΤο καλκάνι εκτιμάται ιδιαίτερα για τη σταθερή, λευκή σάρκα του, πλούσια σε πρωτεΐνη και χαμηλή σε λίπος. Συνήθως παρασκευάζεται ψητό στη σχάρα, ψημένο ή μαγειρεμένο στον ατμό στη μεσογειακή και τουρκική κουζίνα. Το φρέσκο καλκάνι προσφέρει εξαιρετική γεύση και θρεπτική αξία, και η βιώσιμη αλιεία είναι σημαντική για τη διατήρηση του πληθυσμού του για τις μελλοντικές γενιές.",
        "distribution_habitat": "Αμμώδεις-λασπώδεις πυθμένες, μέτρια βάθη κοντά στην ακτή, όχι ανοιχτή θάλασσα.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rv06PB5pI8MqmS0Mu3idkn9EV5nKjY-U"]
      },
      {
        "id": 15,
        "3d_model": "https://sketchfab.com/models/2adc33a3a8c74a3c8759745c46c612ff/embed",
        "type": "creature",
        "animal_name": "Αχινός",
        "max_size": 10,
        "max_weight": 0.2,
        "max_depth": 25,
        "other_names": ["Αχινός"],
        "colors": ["#800080", "#A52A2A"],
        "family": "Echinoidea",
        "habitat": "Παράκτιοι βράχοι και θαλάσσιος πυθμένας",
        "poisonous": true,
        "edible": true,
        "danger_to_human": true,
        "social_behaviour": "ζει μόνος",
        "locations": ["Βουλγαρική ακτή του Εύξεινου Πόντου"],
        "locations_description": "Διαδεδομένος στη Μεσόγειο και το Αιγαίο Πέλαγος. Οι αχινοί είναι σημαντικοί βοσκοί που βοηθούν στον έλεγχο της ανάπτυξης των φυκιών και στη διατήρηση της οικολογικής ισορροπίας.",
        "description": "Ο αχινός είναι ένα μικρό, ακανθωτό θαλάσσιο ασπόνδυλο που βρίσκεται σε ωκεανούς σε όλο τον κόσμο, συμπεριλαμβανομένης της Μεσογείου, του Αιγαίου και του Εύξεινου Πόντου. Έχουν ένα στρογγυλό, σκληρό κέλυφος καλυμμένο με κινητές ακίδες για προστασία και κίνηση. Οι αχινοί τρέφονται κυρίως με φύκια και παίζουν σημαντικό ρόλο στη διατήρηση της ισορροπίας των θαλάσσιων οικοσυστημάτων.\n\nΟι αχινοί θεωρούνται λιχουδιά σε πολλές κουζίνες, ειδικά σε μεσογειακά και ιαπωνικά πιάτα, εκτιμώμενοι για τη πλούσια, αλμυρή γεύση τους και το υψηλό περιεχόμενό τους σε πρωτεΐνες. Συμβάλλουν επίσης στη θαλάσσια βιοποικιλότητα, παρέχοντας οικότοπο και τροφή για άλλα είδη. Η βιώσιμη συλλογή είναι απαραίτητη για την προστασία των πληθυσμών τους και τη διατήρηση της υγείας του οικοσυστήματος.",
        "distribution_habitat": "Βρίσκεται σε βραχώδεις θαλάσσιους πυθμένες και κοραλλιογενείς υφάλους σε ρηχά νερά. Προτιμά καθαρές, καλά φωτισμένες περιοχές όπου τα φύκια είναι άφθονα.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1mhBTx13dz2-S2hl2u_WU0lv7EVCxxEBK"]
      },
      {
        "id": 19,
        "3d_model": "https://sketchfab.com/models/8974457120d143029d44bac83ffb273b/embed",
        "type": "fish",
        "animal_name": "Λούτσος (Βόρειος Λούτσος)",
        "max_size": 150,
        "max_weight": 25,
        "max_depth": 15,
        "other_names": ["Esox lucius"],
        "colors": ["#008000", "#FFFFFF"],
        "family": "Esocidae",
        "habitat": "Λίμνες γλυκού νερού και εκβολές ποταμών",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "ζει μόνος",
        "locations": ["Βουλγαρικά ποτάμια", "Λίμνες γλυκού νερού"],
        "locations_description": "Ένα από τα αρπακτικά είδη που αλιεύονται στα εσωτερικά νερά της Βουλγαρίας.",
        "description": "Ο λούτσος (Esox lucius) είναι ένα αρπακτικό ψάρι γλυκού νερού που βρίσκεται συνήθως σε ποτάμια, λίμνες και λιμνούλες σε όλη την Ευρώπη, την Ασία και τη Βόρεια Αμερική. Συνήθως μήκους 40–120 cm και βάρους 1–20 kg, ο λούτσος έχει ένα επιμήκες σώμα, μυτερό ρύγχος και αιχμηρά δόντια, τα οποία χρησιμοποιεί για να πιάνει μικρότερα ψάρια. Ο χρωματισμός του είναι συνήθως πρασινωπός με ανοιχτότερα, κιτρινωπά μοτίβα για καμουφλάζ.\n\nΟ λούτσος εκτιμάται για τη σταθερή, λευκή σάρκα του, πλούσια σε πρωτεΐνη και χαμηλή σε λίπος. Συνήθως παρασκευάζεται ψητός στη σχάρα, ψημένος ή καπνιστός. Ως κορυφαίο αρπακτικό στα οικοσυστήματα γλυκού νερού, ο λούτσος παίζει σημαντικό ρόλο στη διατήρηση της ισορροπίας των πληθυσμών ψαριών. Οι βιώσιμες πρακτικές αλιείας είναι απαραίτητες για τη διατήρηση υγιών πληθυσμών λούτσου για το μέλλον.",
        "distribution_habitat": "Αργά ρέοντα γλυκά νερά, περιοχές με υδρόβια βλάστηση.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1agiLwwHniyY8xUjlc5zBg6dPM03DWERg"]
      },
      {
        "id": 20,
        "3d_model": "https://sketchfab.com/models/21fd636ec9a94092b0a39c9f4f0428b5/embed",
        "type": "fish",
        "animal_name": "Πέρκα (Ευρωπαϊκή Πέρκα)",
        "max_size": 60,
        "max_weight": 4,
        "max_depth": 20,
        "other_names": ["Perca fluviatilis"],
        "colors": ["#3CB371", "#FFA500"],
        "family": "Percidae",
        "habitat": "Λίμνες γλυκού νερού, ποτάμια",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "σε μικρές ομάδες",
        "locations": ["Βουλγαρικές λίμνες"],
        "locations_description": "Είδος που συχνά συναντάται στην τοπική αλιεία.",
        "description": "Η πέρκα (Perca fluviatilis) είναι ένα ψάρι γλυκού νερού που βρίσκεται συνήθως σε ποτάμια, λίμνες και λιμνούλες σε όλη την Ευρώπη και μέρη της Ασίας. Συνήθως μήκους 15–50 cm και βάρους 0,2–2 kg, η πέρκα έχει ένα πλευρικά συμπιεσμένο σώμα με πρασινωπό-καφέ χρωματισμό και χαρακτηριστικές σκούρες κάθετες ρίγες. Τρέφεται με μικρά ψάρια, έντομα και ασπόνδυλα.\n\nΗ πέρκα εκτιμάται για τη μαλακή, λευκή σάρκα της και το υψηλό περιεχόμενο πρωτεΐνης. Συνήθως παρασκευάζεται ψητή στη σχάρα, τηγανητή ή ψημένη σε πολλές κουζίνες. Ως αρπακτικό ψάρι, η πέρκα παίζει βασικό ρόλο στη διατήρηση της ισορροπίας των οικοσυστημάτων γλυκού νερού. Η βιώσιμη αλιεία βοηθά στη διασφάλιση υγιών πληθυσμών πέρκας για τις μελλοντικές γενιές.",
        "distribution_habitat": "Λίμνες γλυκού νερού και περιοχές χωρίς ρεύμα.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1O2BdQI7DuFdgO00G6d_77hKD9zH2GBVH"]
      },
      {
        "id": 21,
        "3d_model": "https://sketchfab.com/models/c710d5a183a547d8a999c721a2d906cf/embed",
        "type": "creature",
        "animal_name": "Μύδι Γλυκού Νερού",
        "max_size": 10,
        "max_weight": 0.1,
        "max_depth": 5,
        "other_names": ["Anodonta cygnea"],
        "colors": ["#000000", "#A52A2A"],
        "family": "Unionidae",
        "habitat": "Λίμνες και ρυάκια γλυκού νερού",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "ζει σε ομάδες",
        "locations": ["Βουλγαρικές λίμνες"],
        "locations_description": "Παίζει ρόλο φιλτραρίσματος στα οικοσυστήματα γλυκού νερού.",
        "description": "Το μύδι γλυκού νερού είναι ένα δίθυρο μαλάκιο που βρίσκεται σε ποτάμια, λίμνες και λιμνούλες παγκοσμίως. Συνήθως, τα μύδια προσκολλώνται σε βράχους ή ιζήματα χρησιμοποιώντας ισχυρά byssal νήματα. Τρέφονται με φιλτράρισμα πλαγκτού και οργανικών σωματιδίων, παίζοντας σημαντικό ρόλο στη διατήρηση της ποιότητας του νερού και της ισορροπίας του οικοσυστήματος.\n\nΤα μύδια γλυκού νερού είναι πλούσια σε πρωτεΐνες και μέταλλα, αν και καταναλώνονται λιγότερο από τα θαλάσσια μύδια. Εκτιμώνται επίσης για τον οικολογικό τους ρόλο, παρέχοντας οικότοπο για άλλα υδρόβια είδη και συμβάλλοντας στη βιοποικιλότητα. Η προστασία των οικοτόπων γλυκού νερού είναι απαραίτητη για τη διατήρηση των πληθυσμών μυδιών και της συνολικής υγείας των υδάτινων οικοσυστημάτων.",
        "distribution_habitat": "Πυθμένες γλυκού νερού, λασπώδη εδάφη.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Pmy-CTIY3FyxAkdy8dJRsaEnwICSkOfI"]
      },
      {
        "id": 30,
        "3d_model": "https://sketchfab.com/models/4cd0e97040c9404e90d9645fc0f69aab/embed",
        "type": "other",
        "animal_name": "Θαλάσσιο Σφουγγάρι",
        "max_size": 40,
        "max_weight": 0.8,
        "max_depth": 50,
        "other_names": ["Porifera"],
        "colors": ["#FFFF00", "#A52A2A"],
        "family": "Porifera",
        "habitat": "Ακτές του Εύξεινου Πόντου, βραχώδεις πυθμένες",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "σε αποικίες",
        "locations": ["Βουλγαρική ακτή του Εύξεινου Πόντου"],
        "locations_description": "Βρίσκεται σε παράκτιους βράχους και σπήλαια πυθμένα.",
        "description": "Το θαλάσσιο σφουγγάρι είναι ένα απλό, πορώδες θαλάσσιο ζώο που βρίσκεται σε ωκεανούς σε όλο τον κόσμο, συμπεριλαμβανομένης της Μεσογείου, του Αιγαίου και του Εύξεινου Πόντου. Προσκολλώνται σε βράχους ή στον πυθμένα της θάλασσας και φιλτράρουν νερό για να αποκτήσουν θρεπτικά συστατικά, παίζοντας σημαντικό ρόλο στη διατήρηση της υγείας του θαλάσσιου οικοσυστήματος. Τα θαλάσσια σφουγγάρια έρχονται σε διάφορα σχήματα, μεγέθη και χρώματα, παρέχοντας οικότοπο και καταφύγιο για πολλούς μικρούς θαλάσσιους οργανισμούς.\n\nΤα θαλάσσια σφουγγάρια έχουν χρησιμοποιηθεί από τους ανθρώπους για αιώνες, κυρίως για μπάνιο, καθαρισμό και καλλυντικούς σκοπούς. Είναι επίσης πλούσια σε φυσικές ενώσεις που μελετώνται για πιθανές ιατρικές εφαρμογές. Η προστασία των θαλάσσιων οικοτόπων εξασφαλίζει την επιβίωση των πληθυσμών σφουγγαριών και των ειδών που εξαρτώνται από αυτά.",
        "distribution_habitat": "Βραχώδεις και λασπώδεις περιοχές πυθμένα.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1rjP7JFadGU4u366K3cBYzzoxFgv4FUUR"]
      },
      {
        "id": 31,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Θαλάσσιο Χορτάρι",
        "max_size": 60,
        "max_weight": 1.5,
        "max_depth": 10,
        "other_names": ["Zostera marina"],
        "colors": ["#008000"],
        "family": "Zosteraceae",
        "habitat": "Ρηχές παράκτιες περιοχές, αμμώδης πυθμένας",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "σε αποικίες",
        "locations": ["Βουλγαρική ακτή του Εύξεινου Πόντου"],
        "locations_description": "Φαίνεται πυκνά σε παράκτια ρηχά νερά, πηγή τροφής για ψάρια.",
        "description": "Τα θαλάσσια φυτά είναι φωτοσυνθετικοί οργανισμοί που βρίσκονται σε ωκεανούς και θάλασσες σε όλο τον κόσμο, συμπεριλαμβανομένης της Μεσογείου, του Αιγαίου και του Εύξεινου Πόντου. Περιλαμβάνουν θαλάσσια χόρτα, φύκια και άλλα υδρόβια φυτά που αναπτύσσονται σε ρηχά νερά, είτε αγκυροβολημένα στον πυθμένα της θάλασσας είτε επιπλέοντας ελεύθερα. Τα θαλάσσια φυτά παρέχουν τροφή, καταφύγιο και οξυγόνο για πολυάριθμα θαλάσσια είδη.\n\nΤα θαλάσσια φυτά είναι πλούσια σε θρεπτικά συστατικά και παίζουν κρίσιμο ρόλο στη διατήρηση υγιών θαλάσσιων οικοσυστημάτων. Βοηθούν στην πρόληψη της παράκτιας διάβρωσης, απορροφούν διοξείδιο του άνθρακα και υποστηρίζουν τη βιοποικιλότητα. Η προστασία των θαλάσσιων φυτών είναι απαραίτητη για τη διατήρηση της υγείας του ωκεανού και των αμέτρητων ειδών που εξαρτώνται από αυτά.",
        "distribution_habitat": "Ρηχές και ήρεμες θαλάσσιες περιοχές.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
      }
    ]
  },
  {
    "country": "Ελλάδα",
    "country_image": "greece",
    "animals": [
      {
        "id": 7,
        "3d_model": "https://sketchfab.com/models/a3d0e1a597794a9bb74739a13cfc8b77/embed",
        "type": "fish",
        "animal_name": "Τσιπούρα (Sparus aurata)",
        "max_size": 70,
        "max_weight": 7,
        "max_depth": 80,
        "other_names": ["Χρυσόψαρο", "Sparus aurata"],
        "colors": ["#C0C0C0", "#FFD700"],
        "family": "Sparidae",
        "habitat": "Βραχώδεις και αμμώδεις ακτές του Αιγαίου και της Μεσογείου, λιμνοθάλασσες",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "σε κοπάδια όταν είναι νεαρή, πιο ατομική ως ενήλικη",
        "locations": ["Ακτές ελληνικών νησιών", "Αιγαίο Πέλαγος"],
        "locations_description": "Ένα ψάρι που συνηθίζεται και αλιεύεται σε εστιατόρια στην Ελλάδα.",
        "description": "Η τσιπούρα (Sparus aurata) είναι ένα δημοφιλές παράκτιο ψάρι που βρίσκεται στη Μεσόγειο Θάλασσα, το Αιγαίο Πέλαγος και τον Ανατολικό Ατλαντικό Ωκεανό. Συνήθως μήκους 20–50 cm και βάρους 0,3–2 kg, η τσιπούρα έχει ένα ασημένιο σώμα με μια χαρακτηριστική χρυσή ταινία ανάμεσα στα μάτια της. Τρέφεται με μικρά ασπόνδυλα, καρκινοειδή και φύκια.\n\nΠλούσια σε πρωτεΐνες, βιταμίνες και μέταλλα, η τσιπούρα εκτιμάται ιδιαίτερα για τη σταθερή, νόστιμη σάρκα της. Στη μεσογειακή κουζίνα, συνήθως ψήνεται στη σχάρα, ψήνεται ή μαγειρεύεται στον ατμό. Η φρέσκια τσιπούρα προσφέρει την καλύτερη γεύση και θρεπτικά οφέλη. Η βιώσιμη αλιεία είναι απαραίτητη για τη διατήρηση των φυσικών της πληθυσμών για τις μελλοντικές γενιές.",
        "distribution_habitat": "Παράκτιες βραχώδεις και αμμώδεις περιοχές, εκβολές λιμνοθαλασσών.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1yIXZXGjKKIsXpRLADY00k9G8OyASw6jA",
          "https://drive.google.com/uc?export=view&id=1_AkVeoIi2nt68BYwAPvlBj7Ym0NUEkVi"
        ]
      },
      {
        "id": 8,
        "3d_model": "https://sketchfab.com/models/fc781bee9c0e4378a109acc8b728a86b/embed",
        "type": "fish",
        "animal_name": "Ευρωπαϊκό Λαβράκι (Dicentrarchus labrax)",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Λαβράκι", "Dicentrarchus labrax"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Παράκτιες θάλασσες, κόλποι, λιμνοθάλασσες",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "κυρίως ατομικό",
        "locations": ["Ελληνικές ακτές", "Αιγαίο Πέλαγος"],
        "locations_description": "Ένα δημοφιλές είδος ψαριού στην Ελλάδα που αλιεύεται και καλλιεργείται.",
        "description": "Το ευρωπαϊκό λαβράκι (Dicentrarchus labrax) είναι ένα ευρέως εκτιμώμενο παράκτιο ψάρι που βρίσκεται στη Μεσόγειο Θάλασσα, τον Εύξεινο Πόντο και τον Ανατολικό Ατλαντικό Ωκεανό. Συνήθως μήκους 30–60 cm και βάρους 0,5–3 kg, έχει ένα αεροδυναμικό ασημί-γκρίζο σώμα με ελαφρώς πιο σκούρα ράχη. Το ευρωπαϊκό λαβράκι είναι ένα αρπακτικό ψάρι, που τρέφεται με μικρότερα ψάρια, καρκινοειδή και μαλάκια.\n\nΠλούσιο σε υψηλής ποιότητας πρωτεΐνες, λιπαρά οξέα ωμέγα-3, βιταμίνες και μέταλλα, υποστηρίζει την υγεία της καρδιάς και τη συνολική διατροφή. Στη μεσογειακή κουζίνα συνήθως ψήνεται στη σχάρα, ψήνεται ή μαγειρεύεται στον ατμό. Το φρέσκο ευρωπαϊκό λαβράκι προσφέρει εξαιρετική γεύση και θρεπτική αξία, και οι βιώσιμες πρακτικές αλιείας είναι απαραίτητες για τη διατήρηση υγιών πληθυσμών.",
        "distribution_habitat": "Παράκτιες βραχώδεις και αμμώδεις περιοχές, ρηχά έως μέτρια βάθη.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1q70Dggz_KoCODH27L_54BOJCYYk30kVk",
          "https://drive.google.com/uc?export=view&id=1VzCRvcoXi8JQJkMplm3l5vmF1-ssyw9x"
        ]
      },
      {
        "id": 9,
        "3d_model": "https://sketchfab.com/models/1ea0e1c187d743039463aa1477acb71e/embed",
        "type": "fish",
        "animal_name": "Μεσογειακό Παπαγαλόψαρο (Sparisoma cretense)",
        "max_size": 50,
        "max_weight": 3,
        "max_depth": 50,
        "other_names": ["Μεσογειακό παπαγαλόψαρο", "Sparisoma cretense"],
        "colors": ["#00CED1", "#FF0000"],
        "family": "Scaridae",
        "habitat": "Βραχώδεις περιοχές υφάλων, περιοχές πλούσιες σε μακροφύκη",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "ζει σε μικρές ομάδες",
        "locations": ["Βραχώδεις ακτές Αιγαίου Πελάγους", "Ανατολική Μεσόγειος"],
        "locations_description": "Ένα ψάρι υφάλου που βρίσκεται ειδικά σε βραχώδη παράκτια συστήματα στη Μεσόγειο.",
        "description": "Τα μεσογειακά παπαγαλόψαρα είναι πολύχρωμα θαλάσσια ψάρια που βρίσκονται στη Μεσόγειο Θάλασσα. Είναι γνωστά για τα ισχυρά δόντια τους που μοιάζουν με ράμφος, τα οποία χρησιμοποιούν για να βόσκουν φύκια και να ξύνουν επιφάνειες βράχων και κοραλλιογενών υφάλων. Συνήθως μετρούν 15–35 cm σε μήκος και επιδεικνύουν ζωντανά χρώματα που τους βοηθούν να αναμειχθούν στο περιβάλλον τους.\n\nΤα παπαγαλόψαρα παίζουν κρίσιμο ρόλο στη διατήρηση της υγείας των υφάλων ελέγχοντας την ανάπτυξη των φυκιών και συμβάλλοντας στην παραγωγή άμμου μέσω των διατροφικών τους συνηθειών. Αν και δεν καταναλώνονται συνήθως ως τροφή, θαυμάζονται για την ομορφιά και την οικολογική τους σημασία. Η προστασία των οικοτόπων τους είναι απαραίτητη για τη διατήρηση της βιοποικιλότητας των μεσογειακών θαλάσσιων οικοσυστημάτων.",
        "distribution_habitat": "Βραχώδη και πυκνά σε φύκια τμήματα, ρηχά έως μέτρια βάθη.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1AhAqpVxf7HBZafEwJGSvQKP6pQvG1swU",
          "https://drive.google.com/uc?export=view&id=183FJzwM5VBTnI3nzFqMjSm-36GR8lShF"
        ]
      },
      {
        "id": 22,
        "3d_model": "https://sketchfab.com/models/59f8a232fd794318bfff79bfe4e01213/embed",
        "type": "fish",
        "animal_name": "Μπαρμπούνι (Barbouni)",
        "max_size": 40,
        "max_weight": 1,
        "max_depth": 150,
        "other_names": ["Mullus barbatus", "Μπαρμπούνι"],
        "colors": ["#B22222", "#FFFFFF"],
        "family": "Mullidae",
        "habitat": "Ακτές Αιγαίου Πελάγους και αμμώδεις πυθμένες",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "σε μικρές ομάδες",
        "locations": ["Αιγαίο Πέλαγος"],
        "locations_description": "Κοινό στη Μεσόγειο και τις ανατολικές ατλαντικές ακτές. Το μπαρμπούνι είναι ένα δημοφιλές είδος στις περιφερειακές κουζίνες, εκτιμώμενο για το απαλό, νόστιμο κρέας του.",
        "description": "Το μπαρμπούνι (Mullus barbatus / Mullus surmuletus) είναι ένα μικρό, βενθικό ψάρι που βρίσκεται στη Μεσόγειο Θάλασσα, το Αιγαίο Πέλαγος και τον Ανατολικό Ατλαντικό Ωκεανό. Συνήθως μήκους 15–30 cm, το μπαρμπούνι έχει ένα κοκκινωπό-ροζ σώμα με δύο χαρακτηριστικά μουστάκια κάτω από το πηγούνι του, τα οποία χρησιμοποιεί για να εντοπίσει τροφή στον πυθμένα της θάλασσας. Τρέφεται με μικρά ασπόνδυλα, καρκινοειδή και σκουλήκια.\n\nΤο μπαρμπούνι εκτιμάται ιδιαίτερα για τη λεπτή, νόστιμη σάρκα του και το υψηλό περιεχόμενο πρωτεΐνης. Στη μεσογειακή κουζίνα συνήθως ψήνεται στη σχάρα, ψήνεται ή τηγανίζεται. Το φρέσκο μπαρμπούνι προσφέρει την καλύτερη γεύση και θρεπτική αξία. Οι βιώσιμες πρακτικές αλιείας είναι σημαντικές για τη διατήρηση των φυσικών του πληθυσμών και της υγείας των θαλάσσιων οικοσυστημάτων.",
        "distribution_habitat": "Ζει σε αμμώδεις και λασπώδεις θαλάσσιους πυθμένες της Μεσογείου και του Εύξεινου Πόντου, συνήθως σε βάθη μεταξύ 10 και 100 μέτρων.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1qCrfny8Obe07Sw3hNsomTy__lZRNLepu"]
      },
      {
        "id": 23,
        "3d_model": "https://sketchfab.com/models/2e7c02b1826a407dafc65be285fb3684/embed",
        "type": "fish",
        "animal_name": "Ξιφίας",
        "max_size": 450,
        "max_weight": 600,
        "max_depth": 800,
        "other_names": ["Xiphias gladius"],
        "colors": ["#191970", "#C0C0C0"],
        "family": "Xiphiidae",
        "habitat": "Ανοιχτή θάλασσα, Αιγαίο και Μεσόγειος",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "ζει μόνος",
        "locations": ["Ανοιχτά της Κρήτης", "Αιγαίο Πέλαγος"],
        "locations_description": "Διαδεδομένος σε τροπικές και εύκρατες θάλασσες. Οι ξιφίες είναι κορυφαία αρπακτικά, γνωστά για τα μακριά τους ράμφη που χρησιμοποιούν για να κόβουν θηράματα, και παίζουν ουσιαστικό ρόλο στα πελαγικά οικοσυστήματα.",
        "description": "Ο ξιφίας (Xiphias gladius) είναι ένα μεγάλο, μεταναστευτικό αρπακτικό ψάρι που βρίσκεται σε ωκεανούς σε όλο τον κόσμο, συμπεριλαμβανομένης της Μεσογείου Θάλασσας και του Ατλαντικού Ωκεανού. Συνήθως μήκους 1,5–3 μέτρα και βάρους 30–200 kg, ο ξιφίας έχει ένα μακρύ, επίπεδο, σαν σπαθί ράμφος και ένα αεροδυναμικό σώμα, το οποίο χρησιμοποιεί για να κυνηγάει μικρότερα ψάρια και καλαμάρια.\n\nΟ ξιφίας εκτιμάται ιδιαίτερα για τη σταθερή, κρεατώδη σάρκα του, πλούσια σε πρωτεΐνη και χαμηλή σε λίπος. Συνήθως ψήνεται στη σχάρα, ψήνεται ή σοτάρεται στη μεσογειακή και διεθνή κουζίνα. Ο φρέσκος ξιφίας προσφέρει εξαιρετική γεύση και θρεπτικά οφέλη. Οι βιώσιμες πρακτικές αλιείας είναι απαραίτητες για την προστασία των πληθυσμών ξιφία και τη διατήρηση της ισορροπίας του ωκεάνιου οικοσυστήματος.",
        "distribution_habitat": "Βρίσκεται σε ανοιχτά νερά του Ατλαντικού, της Μεσογείου και του Ινδικού Ωκεανού. Προτιμά ζεστά, βαθιά νερά και μεταναστεύει εποχιακά.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1Mcm71LNeIIO7KZggGx2GPPy3pUh60GE3"]
      },
      {
        "id": 24,
        "3d_model": "https://sketchfab.com/models/6515f625857041ad87bb6e2e5e5f6206/embed",
        "type": "creature",
        "animal_name": "Θαλασσοσαλιγκάρι",
        "max_size": 8,
        "max_weight": 0.1,
        "max_depth": 30,
        "other_names": ["Gastropoda"],
        "colors": ["#A52A2A", "#F5F5DC"],
        "family": "Gastropoda",
        "habitat": "Παράκτιοι βράχοι και θαλάσσιος πυθμένας",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "ζει μόνο",
        "locations": ["Αιγαίο Πέλαγος"],
        "locations_description": "Κοινό σε όλη τη Μεσόγειο και το Αιγαίο Πέλαγος. Τα θαλασσοσαλιγκάρια παίζουν σημαντικό ρόλο στον καθαρισμό του πυθμένα της θάλασσας και την ανακύκλωση θρεπτικών συστατικών στα θαλάσσια οικοσυστήματα.",
        "description": "Το θαλασσοσαλιγκάρι είναι ένα μικρό, αργοκίνητο θαλάσσιο μαλάκιο που βρίσκεται σε ωκεανούς σε όλο τον κόσμο, συμπεριλαμβανομένης της Μεσογείου, του Αιγαίου και του Εύξεινου Πόντου. Έχει ένα σπειροειδές κέλυφος που παρέχει προστασία από αρπακτικά και ένα μαλακό σώμα που χρησιμοποιεί για να κινείται και να τρέφεται με φύκια, απορρίμματα ή μικρά ασπόνδυλα.\n\nΤα θαλασσοσαλιγκάρια καταναλώνονται σε διάφορες κουζίνες, ιδιαίτερα σε μεσογειακές περιοχές, για την απαλή, νόστιμη σάρκα τους. Παίζουν επίσης σημαντικό οικολογικό ρόλο βόσκοντας φύκια και συμβάλλοντας στην ισορροπία των θαλάσσιων οικοσυστημάτων. Η προστασία των οικοτόπων τους είναι απαραίτητη για τη διατήρηση υγιών πληθυσμών και τη διατήρηση της θαλάσσιας βιοποικιλότητας.",
        "distribution_habitat": "Ζει σε ρηχές παράκτιες ζώνες, βραχώδεις ακτές και αμμώδεις θαλάσσιους πυθμένες, τρεφόμενο με φύκια και απορρίμματα.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1hczsTgmq4_EjXk-zcpH30hiwaYYZB9Bj"]
      },
      {
        "id": 32,
        "3d_model": "https://sketchfab.com/models/d521ba70ae54457faea69294757b75b5/embed",
        "type": "other",
        "animal_name": "Κοράλλι",
        "max_size": 25,
        "max_weight": 1,
        "max_depth": 20,
        "other_names": ["Corallium rubrum"],
        "colors": ["#FF0000", "#FFA500"],
        "family": "Scleractinia",
        "habitat": "Ακτές Αιγαίου Πελάγους, βραχώδεις ύφαλοι",
        "poisonous": false,
        "edible": false,
        "danger_to_human": false,
        "social_behaviour": "σε αποικίες",
        "locations": ["Αιγαίο Πέλαγος"],
        "locations_description": "Φαίνεται πυκνά σε βραχώδεις υφάλους.",
        "description": "Τα κοραλλιόψαρα είναι πολύχρωμα και ποικίλα είδη που κατοικούν σε κοραλλιογενείς υφάλους σε τροπικές και υποτροπικές θάλασσες. Ποικίλλουν ευρέως σε μέγεθος, σχήμα και χρώμα, συχνά επιδεικνύοντας ζωντανά μοτίβα που τους βοηθούν να αναμειχθούν στο περιβάλλον του υφάλου. Τα κοραλλιόψαρα τρέφονται με φύκια, πλαγκτόν και μικρά ασπόνδυλα, παίζοντας κρίσιμο ρόλο στη διατήρηση της υγείας του υφάλου.\n\nΠλούσια σε πρωτεΐνες και συχνά χαμηλά σε λίπος, ορισμένα είδη κοραλλιόψαρων καταναλώνονται τοπικά, αν και είναι πιο συνήθως θαυμαζόμενα για την ομορφιά τους σε θαλάσσια οικοσυστήματα και ενυδρεία. Η προστασία των κοραλλιογενών υφάλων είναι απαραίτητη, καθώς εξαρτώνται από υγιείς οικότοπους υφάλων για καταφύγιο, αναπαραγωγή και τροφή.",
        "distribution_habitat": "Ρηχές βραχώδεις και περιοχές υφάλων.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=1CTGsUj276H5Cx-28Gnc6xfCyVC_RmGgp"]
      },
      {
        "id": 33,
        "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
        "type": "other",
        "animal_name": "Θαλάσσια Φύκια",
        "max_size": 45,
        "max_weight": 1.2,
        "max_depth": 25,
        "other_names": ["Άλγη"],
        "colors": ["#008000", "#A52A2A"],
        "family": "Phaeophyceae",
        "habitat": "Παράκτιοι βράχοι, ρηχές θαλάσσιες περιοχές",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "σε αποικίες",
        "locations": ["Αιγαίο Πέλαγος"],
        "locations_description": "Βρίσκονται σε όλη τη Μεσόγειο, το Αιγαίο και τον Εύξεινο Πόντο. Τα θαλάσσια φυτά παρέχουν οξυγόνο, καταφύγιο και τροφή για αμέτρητους θαλάσσιους οργανισμούς και βοηθούν στη σταθεροποίηση των ιζημάτων του πυθμένα της θάλασσας.",
        "description": "Τα θαλάσσια φύκια είναι ποικίλα θαλάσσια φυτά που βρίσκονται σε ωκεανούς σε όλο τον κόσμο, συμπεριλαμβανομένης της Μεσογείου, του Αιγαίου και του Εύξεινου Πόντου. Αναπτύσσονται προσκολλημένα σε βράχους ή πυθμένες θαλασσών και έρχονται σε διάφορα χρώματα, συμπεριλαμβανομένου πράσινου, καφέ και κόκκινου. Τα θαλάσσια φύκια παρέχουν τροφή, καταφύγιο και οξυγόνο για πολυάριθμα θαλάσσια είδη.\n\nΠλούσια σε βιταμίνες, μέταλλα, φυτικές ίνες και αντιοξειδωτικά, τα θαλάσσια φύκια καταναλώνονται σε πολλές κουζίνες, ειδικά στην Ασία, και χρησιμοποιούνται επίσης σε συμπληρώματα, καλλυντικά και λιπάσματα. Πέρα από τη διατροφική τους αξία, τα θαλάσσια φύκια παίζουν ζωτικό ρόλο στα θαλάσσια οικοσυστήματα υποστηρίζοντας τη βιοποικιλότητα και διατηρώντας την ποιότητα του νερού.",
        "distribution_habitat": "Αναπτύσσεται σε ρηχά παράκτια νερά με άφθονο ηλιακό φως. Περιλαμβάνει θαλάσσια χόρτα και φύκια που ευδοκιμούν σε περιβάλλοντα πλούσια σε θρεπτικά συστατικά.",
        "image_paths": ["https://drive.google.com/uc?export=view&id=17kDgX91KiYj9IN8LgtsMCP2TWn2tpqFc"]
      }
    ]
  },
  {
    "country": "Πορτογαλία",
    "country_image": "portugal",
    "animals": [
      {
        "id": 10,
        "3d_model": "https://sketchfab.com/models/d7a2d0bd2a524d35b01e0d898b026479/embed",
        "type": "fish",
        "animal_name": "Σαρδέλα",
        "max_size": 30,
        "max_weight": 0.3,
        "max_depth": 100,
        "other_names": ["Sardina pilchardus", "Σαρδέλα"],
        "colors": ["#008080", "#C0C0C0"],
        "family": "Clupeidae",
        "habitat": "Σε κοπάδια σε ανοιχτή θάλασσα και παράκτια νερά",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "μετανάστευση και τροφοδοσία σε πυκνά κοπάδια",
        "locations": ["Πορτογαλική Ατλαντική ακτή"],
        "locations_description": "Ένα από τα πιο καταναλισκόμενα ψάρια στην Πορτογαλία",
        "description": "Η σαρδέλα (Sardina pilchardus / Sardinops sagax) είναι ένα μικρό, λιπαρό ψάρι που βρίσκεται συνήθως στη Μεσόγειο Θάλασσα, τον Ατλαντικό Ωκεανό και άλλα εύκρατα νερά. Συνήθως μήκους 15–25 cm και βάρους περίπου 0,1–0,2 kg, οι σαρδέλες έχουν ένα λεπτό, ασημένιο σώμα με μπλε-πράσινη ράχη. Συνήθως κολυμπούν σε μεγάλα κοπάδια και τρέφονται με πλαγκτόν και μικρά καρκινοειδή.\n\nΟι σαρδέλες είναι πλούσιες σε λιπαρά οξέα ωμέγα-3, πρωτεΐνες, βιταμίνες και μέταλλα, υποστηρίζοντας την υγεία της καρδιάς και τη συνολική διατροφή. Στην κουζίνα, συνήθως ψήνονται στη σχάρα, κονσερβοποιούνται ή καπνίζονται. Οι φρέσκες σαρδέλες προσφέρουν την καλύτερη γεύση και θρεπτικά οφέλη, και οι βιώσιμες πρακτικές αλιείας είναι απαραίτητες για τη διατήρηση των πληθυσμών τους.",
        "distribution_habitat": "Παράκτια ανοιχτή θάλασσα, μεταναστευτικές διαδρομές σε κοπάδια, ρηχά και μέτρια βάθη.",
        "image_paths": ["images/sardine_pt1.png", "images/sardine_pt2.png"]
      },
      {
        "id": 11,
        "3d_model": "https://sketchfab.com/models/a3d0e1a597794a9bb74739a13cfc8b77/embed",
        "type": "fish",
        "animal_name": "Τσιπούρα (Dourada / Τσιπούρα)",
        "max_size": 60,
        "max_weight": 5,
        "max_depth": 40,
        "other_names": ["Sparus aurata", "Dourada"],
        "colors": ["#C0C0C0", "#FFD700"],
        "family": "Sparidae",
        "habitat": "Παράκτιες λιμνοθάλασσες, εκβολές εκβολών, ρηχή θάλασσα",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "σε κοπάδια κατά το νεανικό στάδιο",
        "locations": ["Πορτογαλικές ακτές"],
        "locations_description": "Συχνά βρίσκεται σε όλη τη Μεσόγειο και κατά μήκος των ευρωπαϊκών ατλαντικών ακτών. Η τσιπούρα είναι ένα βασικό είδος στις τοπικές αλιείες και την υδατοκαλλιέργεια, συμβάλλοντας τόσο στην οικονομία όσο και στα παράκτια θαλάσσια οικοσυστήματα.",
        "description": "Η τσιπούρα (Sparus aurata) είναι ένα δημοφιλές παράκτιο ψάρι που βρίσκεται στη Μεσόγειο Θάλασσα, το Αιγαίο Πέλαγος και τον Ανατολικό Ατλαντικό Ωκεανό. Συνήθως μήκους 20–50 cm και βάρους 0,3–2 kg, έχει ένα ασημένιο σώμα με μια χαρακτηριστική χρυσή ταινία ανάμεσα στα μάτια της. Η τσιπούρα τρέφεται με μικρά ασπόνδυλα, καρκινοειδή και φύκια.\n\nΠλούσια σε πρωτεΐνες, βιταμίνες και μέταλλα, εκτιμάται ιδιαίτερα για τη σταθερή, νόστιμη σάρκα της. Στη μεσογειακή κουζίνα, συνήθως ψήνεται στη σχάρα, ψήνεται ή μαγειρεύεται στον ατμό. Η φρέσκια τσιπούρα προσφέρει εξαιρετική γεύση και θρεπτικά οφέλη. Η βιώσιμη αλιεία είναι απαραίτητη για τη διατήρηση των φυσικών της πληθυσμών για τις μελλοντικές γενιές.",
        "distribution_habitat": "Βρίσκεται σε ρηχά παράκτια νερά, λιμνοθάλασσες και εκβολές της Μεσογείου Θάλασσας, του Αιγαίου Πελάγους και του Ανατολικού Ατλαντικού Ωκεανού. Προτιμά αμμώδεις ή λασπώδεις πυθμένες όπου μπορεί να αναζητήσει μικρά ασπόνδυλα, καρκινοειδή και φύκια.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1yIXZXGjKKIsXpRLADY00k9G8OyASw6jA",
          "https://drive.google.com/uc?export=view&id=1_AkVeoIi2nt68BYwAPvlBj7Ym0NUEkVi"
        ]
      },
      {
        "id": 12,
        "3d_model": "https://sketchfab.com/models/fc781bee9c0e4378a109acc8b728a86b/embed",
        "type": "fish",
        "animal_name": "Ευρωπαϊκό Λαβράκι (Robalo)",
        "max_size": 100,
        "max_weight": 12,
        "max_depth": 100,
        "other_names": ["Dicentrarchus labrax", "Robalo"],
        "colors": ["#708238", "#C0C0C0"],
        "family": "Moronidae",
        "habitat": "Παράκτιες θάλασσες, εκβολές ποταμών",
        "poisonous": false,
        "edible": true,
        "danger_to_human": false,
        "social_behaviour": "ατομικό ή σε μικρές ομάδες",
        "locations": ["Πορτογαλικές Ατλαντικές ακτές"],
        "locations_description": "Ευρέως κατανεμημένο σε όλη τη Μεσόγειο, τον Εύξεινο Πόντο και κατά μήκος των ευρωπαϊκών ατλαντικών ακτών. Το ευρωπαϊκό λαβράκι είναι ένα σημαντικό είδος τόσο για την εμπορική όσο και για την ερασιτεχνική αλιεία και παίζει βασικό ρόλο ως αρπακτικό στα παράκτια οικοσυστήματα.",
        "description": "Το ευρωπαϊκό λαβράκι (Dicentrarchus labrax) είναι ένα ευρέως εκτιμώμενο παράκτιο ψάρι που βρίσκεται στη Μεσόγειο Θάλασσα, τον Εύξεινο Πόντο και τον Ανατολικό Ατλαντικό Ωκεανό. Συνήθως μήκους 30–60 cm και βάρους 0,5–3 kg, έχει ένα αεροδυναμικό ασημί-γκρίζο σώμα με ελαφρώς πιο σκούρα ράχη. Το ευρωπαϊκό λαβράκι είναι ένα αρπακτικό ψάρι, που τρέφεται με μικρότερα ψάρια, καρκινοειδή και μαλάκια.\n\nΠλούσιο σε υψηλής ποιότητας πρωτεΐνες, λιπαρά οξέα ωμέγα-3, βιταμίνες και μέταλλα, υποστηρίζει την υγεία της καρδιάς και τη συνολική διατροφή. Στη μεσογειακή κουζίνα συνήθως ψήνεται στη σχάρα, ψήνεται ή μαγειρεύεται στον ατμό. Το φρέσκο ευρωπαϊκό λαβράκι προσφέρει εξαιρετική γεύση και θρεπτική αξία, και οι βιώσιμες πρακτικές αλιείας είναι απαραίτητες για τη διατήρηση υγιών πληθυσμών.",
        "distribution_habitat": "Βρίσκεται σε παράκτια νερά, εκβολές και λιμνοθάλασσες της Μεσογείου Θάλασσας, του Εύξεινου Πόντου και του Ανατολικού Ατλαντικού Ωκεανού. Προτιμά ρηχές, προστατευμένες περιοχές με αμμώδεις ή βραχώδεις πυθμένες όπου μπορεί να κυνηγήσει μικρότερα ψάρια και καρκινοειδή.",
        "image_paths": [
          "https://drive.google.com/uc?export=view&id=1q70Dggz_KoCODH27L_54BOJCYYk30kVk",
          "https://drive.google.com/uc?export=view&id=1VzCRvcoXi8JQJkMplm3l5vmF1-ssyw9x"
        ]
      },
        {
          "id": 25,
          "3d_model": "https://sketchfab.com/models/e3860feecc4f4247826a2542f1770e92/embed",
          "type": "fish",
          "animal_name": "Βακαλάος Ατλαντικού",
          "max_size": 150,
          "max_weight": 40,
          "max_depth": 600,
          "other_names": ["Gadus morhua", "Βακαλάος"],
          "colors": ["#D2B48C", "#FFFFFF"],
          "family": "Gadidae",
          "habitat": "Βαθιά νερά του Ατλαντικού Ωκεανού",
          "poisonous": false,
          "edible": true,
          "danger_to_human": false,
          "social_behaviour": "σε μικρά κοπάδια",
          "locations": ["Ανοιχτά των ακτών της Πορτογαλίας"],
          "locations_description": "Βρίσκεται συνήθως κατά μήκος των ακτών της Νορβηγίας, της Ισλανδίας και του Καναδά. Ο βακαλάος του Ατλαντικού είναι ένα από τα πιο οικονομικά σημαντικά είδη ψαριών και βασικό στοιχείο των θαλάσσιων οικοσυστημάτων του Βόρειου Ατλαντικού.",
          "description": "Ο Βακαλάος Ατλαντικού (Gadus morhua) είναι ένα ψάρι ψυχρών υδάτων που απαντάται συνήθως στον Βόρειο Ατλαντικό Ωκεανό. Συνήθως έχει μήκος 50–100 εκ. και βάρος 2–20 κιλά, με στιβαρό και επιμήκες σώμα, ανοιχτό καφέ έως πρασινωπό χρώμα και χαρακτηριστική λευκή πλευρική γραμμή. Τρέφεται με μικρότερα ψάρια, καρκινοειδή και ασπόνδυλα.\n\nΟ βακαλάος του Ατλαντικού εκτιμάται ιδιαίτερα για το λευκό, μαλακό και νιφάδες κρέας του, πλούσιο σε πρωτεΐνη και χαμηλό σε λιπαρά. Παρασκευάζεται συνήθως ψητός, στη σχάρα ή τηγανητός. Παίζει σημαντικό ρόλο ως θηρευτής στα θαλάσσια οικοσυστήματα και οι βιώσιμες αλιευτικές πρακτικές είναι κρίσιμες για τη διατήρηση υγιών πληθυσμών και της θαλάσσιας βιοποικιλότητας.",
          "distribution_habitat": "Ζει σε ψυχρά και εύκρατα νερά του Βόρειου Ατλαντικού, κοντά στον πυθμένα σε αμμώδεις ή λασπώδεις περιοχές. Προτιμά βάθη μεταξύ 20 και 200 μέτρων.",
          "image_paths": ["https://drive.google.com/uc?export=view&id=1Kk3xifAZ9iSkh2FSgnkAprLqv-IVdFGM"]
        },
        {
          "id": 26,
          "3d_model": "https://sketchfab.com/models/6dbfc4b0a1dd4f20b628475383cc11bc/embed",
          "type": "fish",
          "animal_name": "Ψάρι-Γάλος",
          "max_size": 70,
          "max_weight": 5,
          "max_depth": 200,
          "other_names": ["Zeus faber", "Ψάρι-Γάλος"],
          "colors": ["#FFD700", "#000000"],
          "family": "Zeidae",
          "habitat": "Παράκτιες περιοχές του Ατλαντικού",
          "poisonous": false,
          "edible": true,
          "danger_to_human": false,
          "social_behaviour": "περιπλανιέται μόνο του",
          "locations": ["Δυτική ακτή της Πορτογαλίας"],
          "locations_description": "Απαντάται συχνά στη Μεσόγειο, στον Ατλαντικό και σε ορισμένες εύκρατες θάλασσες. Το ψάρι-γάλος βρίσκει ιδανικές συνθήκες για αλιεία και αναπαραγωγή σε αυτές τις περιοχές και παίζει σημαντικό ρόλο ως θηρευτής στο θαλάσσιο οικοσύστημα.",
          "description": "Το Ψάρι-Γάλος (Zeus faber) είναι ένα παράκτιο ψάρι που συναντάται στη Μεσόγειο Θάλασσα, στον Ατλαντικό Ωκεανό και σε άλλα εύκρατα νερά. Συνήθως έχει μήκος 30–65 εκ. και βάρος 0,5–3 κιλά, με πλευρικά συμπιεσμένο σώμα, χρώμα ελαιοπράσινο έως καφέ και χαρακτηριστική σκούρα κηλίδα σε κάθε πλευρά. Τρέφεται με μικρότερα ψάρια και ασπόνδυλα.\n\nΕκτιμάται για το λευκό και λεπτό κρέας του, πλούσιο σε πρωτεΐνη και χαμηλό σε λιπαρά. Παρασκευάζεται συνήθως στη σχάρα, ψητό ή στον ατμό στη μεσογειακή κουζίνα. Η βιώσιμη αλιεία είναι σημαντική για τη διατήρηση των φυσικών πληθυσμών του για τις μελλοντικές γενιές.",
          "distribution_habitat": "Βρίσκεται σε ρηχά παράκτια νερά και σε ανοιχτές θαλάσσιες περιοχές· προτιμά συνήθως περιοχές με αμμώδη ή λασπώδη βυθό. Αυτό το περιβάλλον του επιτρέπει να συλλαμβάνει εύκολα τη λεία του και να καμουφλάρεται.",
          "image_paths": ["https://drive.google.com/uc?export=view&id=1uts6OHif0EpFz2hogdZOEpdipZFr85fi"]
        },
        {
          "id": 27,
          "3d_model": "https://sketchfab.com/3d-models/deep-sea-sponge-4cd0e97040c9404e90d9645fc0f69aab",
          "type": "creature",
          "animal_name": "Θαλάσσιο Σφουγγάρι",
          "max_size": 50,
          "max_weight": 1,
          "max_depth": 100,
          "other_names": ["Porifera"],
          "colors": ["#FFFF00", "#A52A2A"],
          "family": "Porifera",
          "habitat": "Βραχώδεις βυθοί, παράκτιες σπηλιές",
          "poisonous": false,
          "edible": false,
          "danger_to_human": false,
          "social_behaviour": "ζει σε αποικίες",
          "locations": ["Ατλαντική ακτή", "Βραχώδεις περιοχές ανοιχτής θάλασσας"],
          "locations_description": "Συνηθισμένο κατά μήκος των μεσογειακών και αιγαιακών ακτών, ιδιαίτερα κοντά στην Πορτογαλία και την Ελλάδα. Τα θαλάσσια σφουγγάρια φιλτράρουν το νερό, παρέχοντας βασικές οικοσυστημικές υπηρεσίες και καταφύγιο για μικρά θαλάσσια είδη.",
          "description": "Το Θαλάσσιο Σφουγγάρι είναι ένας απλός και πορώδης θαλάσσιος οργανισμός που απαντάται σε ωκεανούς σε όλο τον κόσμο, συμπεριλαμβανομένων των θαλασσών της Μεσογείου, του Αιγαίου και της Μαύρης Θάλασσας. Προσκολλάται σε βράχους ή στον πυθμένα και φιλτράρει το νερό για να αντλήσει θρεπτικά συστατικά, παίζοντας σημαντικό ρόλο στη διατήρηση υγιών θαλάσσιων οικοσυστημάτων.\n\nΟι άνθρωποι χρησιμοποιούν τα θαλάσσια σφουγγάρια εδώ και αιώνες για μπάνιο, καθαρισμό και καλλυντικούς σκοπούς. Περιέχουν επίσης φυσικές ενώσεις που μελετώνται για πιθανές ιατρικές εφαρμογές. Η προστασία των θαλάσσιων οικοτόπων εξασφαλίζει την επιβίωση των πληθυσμών τους.",
          "distribution_habitat": "Κατοικεί σε βραχώδεις παράκτιες περιοχές και στον βυθό, προσκολλώμενο σε στερεές επιφάνειες. Προτιμά καθαρά και καλά οξυγονωμένα νερά με σταθερά ρεύματα.",
          "image_paths": ["https://drive.google.com/uc?export=view&id=1rjP7JFadGU4u366K3cBYzzoxFgv4FUUR"]
        },
        {
          "id": 35,
          "3d_model": "https://sketchfab.com/models/00d670cf071d498b9f20e6fe3e4fc347/embed",
          "type": "other",
          "animal_name": "Θαλάσσιο Χόρτο",
          "max_size": 60,
          "max_weight": 1.5,
          "max_depth": 15,
          "other_names": ["Zostera marina"],
          "colors": ["#008000"],
          "family": "Zosteraceae",
          "habitat": "Ρηχές παράκτιες περιοχές, λιμνοθάλασσες",
          "poisonous": false,
          "edible": false,
          "danger_to_human": false,
          "social_behaviour": "σε αποικίες",
          "locations": ["Πορτογαλικές ακτές"],
          "locations_description": "Βρίσκεται σε ρηχά παράκτια νερά και δημιουργεί σημαντικό βιότοπο για ψάρια και διάφορα ασπόνδυλα. Τα λιβάδια θαλάσσιων φυτών προσφέρουν καταφύγιο και υποστηρίζουν τη βιοποικιλότητα.",
          "description": "Τα Θαλάσσια Φυτά είναι φωτοσυνθετικοί οργανισμοί που απαντώνται σε ωκεανούς και θάλασσες σε όλο τον κόσμο. Περιλαμβάνουν θαλάσσια χόρτα, φύκη και άλλα υδρόβια φυτά που αναπτύσσονται σε ρηχά νερά. Παρέχουν τροφή, οξυγόνο και καταφύγιο για πολυάριθμα θαλάσσια είδη.\n\nΠαίζουν κρίσιμο ρόλο στη διατήρηση υγιών θαλάσσιων οικοσυστημάτων, συμβάλλοντας στην πρόληψη της διάβρωσης των ακτών, στην απορρόφηση διοξειδίου του άνθρακα και στην υποστήριξη της βιοποικιλότητας.",
          "distribution_habitat": "Απαντάται σε ρηχές και ήρεμες θαλάσσιες περιοχές· αναπτύσσεται συνήθως σε αμμώδεις ή βραχώδεις πυθμένες όπου υπάρχει επαρκές φως για φωτοσύνθεση.",
          "image_paths": ["https://drive.google.com/uc?export=view&id=1kgpwZrQpeK9nT7tnMYinuFXh9T68b_9q"]
        }
    ]
  }
]
