[
  {
    "id": 0,
    "sea_image" : "mediterranean_image",
    "sea_name": "Μεσόγειος Θάλασσα (Τουρκική Ακτή)",
    "area": "2.500.000 km² (συνολική Μεσόγειος Θάλασσα)",
    "max_depth": 5267,
    "location": "Η Νότια και Νοτιοδυτική ακτή της Τουρκίας, που εκτείνεται από τη Μούγλα έως την Αντάκεια",
    "main_fishes": [
      "Ευρωπαϊκή Αντσούγια (Engraulis encrasicolus)",
      "Γοφάρι (Pomatomus saltatrix)",
      "Μπαρμπούνι (Mullus surmuletus)",
      "Τσιπούρα (Sparus aurata)"
    ],
    "main_species": [
      "Κοινό Χταπόδι (Octopus vulgaris)",
      "Ευρωπαϊκό Καλαμάρι (Loligo vulgaris)",
      "Κοινή Σουπιά (Sepia officinalis)",
      "Εδώδιμος Αχινός (Paracentrotus lividus)"
    ],
    "temperature_range": "13°C - 29°C",
    "salinity": "37 PSU",
    "currents": "Κυριαρχείται από το Ρεύμα της Ανατολικής Μεσογείου και μεγάλης κλίμακας, επίμονες Δίνες της Κύπρου στη Λεβαντινή Λεκάνη",
    "ecosystem": "Ένα πλούσιο, ζεστό εύκρατο θαλάσσιο οικοσύστημα που χαρακτηρίζεται από ζωτικής σημασίας παράκτιες λιμνοθάλασσες, πυκνούς λειμώνες θαλάσσιας χλόης Posidonia oceanica και σύνθετους βραχώδεις υφάλους που υποστηρίζουν υψηλή βιοποικιλότητα",
    "coastline_features": "Δραματικοί, απότομοι βραχώδεις γκρεμοί, μεγάλες εκτάσεις αμμωδών παραλιών, πολυάριθμες εκβολές ποταμών και προστατευμένοι κόλποι (π.χ. Κόλπος της Αντάλειας)",
    "important_ports": [
      "Σμύρνη (Μεγάλο εμπορικό κέντρο)",
      "Μερσίνη (Μεγαλύτερο λιμάνι στην περιοχή)",
      "Αντάλεια (Κορυφαίο τουριστικό και εμπορικό λιμάνι)"
    ],
    "economic_activities": [
      "Εμπορική και ερασιτεχνική αλιεία (κυρίως για πελαγικά είδη)",
      "Διεθνής και παράκτιος τουρισμός (ζωτικής σημασίας για την περιφερειακή οικονομία)",
      "Ναυτιλία και διεθνείς θαλάσσιες μεταφορές"
    ],
    "description": "Η τουρκική μεσογειακή ακτή είναι ένα παγκόσμιο σημείο βιοποικιλότητας, που αντιμετωπίζει συνεχώς πιέσεις από την υπεραλίευση και την παράκτια ανάπτυξη. Οι μοναδικοί της οικότοποι, όπως οι λιβάδες θαλάσσιας χλόης Posidonia και οι κοινότητες κοραλλιών βαθέων υδάτων, είναι κρίσιμοι για πολυάριθμα ενδημικά και εμπορικά είδη, υποστηρίζοντας ένα σύνθετο θαλάσσιο τροφικό πλέγμα. Η περιοχή είναι επίσης επιρρεπής στην άφιξη επεμβατικών λεσσεψιανών ειδών από την Ερυθρά Θάλασσα.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1IuQP92XbL-EO0iAjmKF9n3WidvW7TK_D&export=view&authuser=0"
    ]
  },
  {
    "id": 1,
    "sea_image" : "black_sea_image",
    "sea_name": "Αιγαίο Πέλαγος (Τουρκία, Ελλάδα Ακτή)",
    "area": "214.000 km²",
    "max_depth": 3543,
    "location": "Βρίσκεται μεταξύ της τουρκικής ηπειρωτικής χώρας και της ελληνικής χερσονήσου, διάστικτο με χιλιάδες νησιά",
    "main_fishes": [
      "Σαρδέλα (Sardina pilchardus)",
      "Ευρωπαϊκός Μπακαλιάρος (Merluccius merluccius)",
      "Τσιπούρα (Sparus aurata)",
      "Μπαρμπούνι (Mullus surmuletus)"
    ],
    "main_species": [
      "Κοινό Χταπόδι (Octopus vulgaris)",
      "Κοινή Σουπιά (Sepia officinalis)",
      "Αστερίας (Echinodermata είδη)",
      "Ακανθωτός Αστακός (Palinurus είδη)"
    ],
    "temperature_range": "12°C - 27°C",
    "salinity": "36-38 PSU",
    "currents": "Χαρακτηρίζεται από το κυκλωνικό μοτίβο κυκλοφορίας του Αιγαίου και ισχυρά, εποχιακά, ανεμοκίνητα επιφανειακά ρεύματα που επηρεάζουν τη διανομή θρεπτικών συστατικών",
    "ecosystem": "Ένα εξαιρετικά ποικίλο, εύκρατο θαλάσσιο οικοσύστημα που διαθέτει πληθώρα νησιών, εκτεταμένους βραχώδεις υφάλους και κρίσιμα λιβάδια θαλάσσιας χλόης (Posidonia)",
    "coastline_features": "Οδοντωτές, βραχώδεις ακτές, πολυάριθμα μεγάλα και μικρά νησιά (δομή αρχιπελάγους), βαθιοί προστατευμένοι κόλποι και εκβολές ποταμών (π.χ. Μαίανδρος)",
    "important_ports": [
      "Σμύρνη (Μεγάλο τερματικό σταθμό εξαγωγών/εισαγωγών για την Τουρκία)",
      "Θεσσαλονίκη (Βόρειο ελληνικό λιμάνι πύλη)",
      "Αθήνα (Πειραιάς) (Μεγαλύτερο λιμάνι επιβατών και φορτίου στο Αιγαίο)"
    ],
    "economic_activities": [
      "Εμπορική αλιεία (ιδιαίτερα μικρά πελαγικά είδη όπως σαρδέλες)",
      "Έντονος παράκτιος και νησιωτικός τουρισμός (κρίσιμος για τις τοπικές οικονομίες)",
      "Ναυτιλία και μεταφορές με φέρι μεταξύ των νησιών και της ηπειρωτικής χώρας"
    ],
    "description": "Η πολύπλοκη βαθυμετρία του Αιγαίου Πελάγους και ο υψηλός αριθμός νησιών δημιουργούν διακριτά μικρο-οικοσυστήματα. Υποστηρίζει κρίσιμα αποθέματα μικρών πελαγικών ψαριών και είναι μια σημαντική περιοχή για παραδοσιακή και μικρής κλίμακας αλιεία. Η εμβληματική του ομορφιά οδηγεί σε σημαντικό παράκτιο τουρισμό, προκαλώντας προκλήσεις διατήρησης.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1rjfxsGj7Jm15a-BvHEgJzjagCqex_Xod&export=view&authuser=0"
    ]
  },
  {
    "id": 2,
    "sea_image" : "black_sea_image",
    "sea_name": "Εύξεινος Πόντος (Τουρκία, Βουλγαρία Ακτή)",
    "area": "436.000 km²",
    "max_depth": 2212,
    "location": "Η Βόρεια ακτή της Τουρκίας, που συνορεύει με τη Βουλγαρία, τη Ρουμανία, την Ουκρανία, τη Ρωσία και τη Γεωργία",
    "main_fishes": [
      "Γαύρος (Engraulis encrasicolus)",
      "Παπαλίνα (Sprattus sprattus)",
      "Κέφαλος (Mugilidae είδη)",
      "Καλκάνι (Psetta maxima)"
    ],
    "main_species": [
      "Χταπόδι (Octopus είδη, λιγότερο κοινό λόγω αλατότητας)",
      "Καλαμάρι (Loligo είδη, λιγότερο άφθονο)",
      "Θαλάσσιο Αγγούρι (Holothuroidea είδη)",
      "Οξύρρυγχος (Acipenser είδη, κρίσιμα απειλούμενος)"
    ],
    "temperature_range": "7°C - 27°C",
    "salinity": "17-18 PSU",
    "currents": "Κυριαρχείται από το δυναμικό, σε επίπεδο λεκάνης αντίθετα από τη φορά των δεικτών του ρολογιού Ρεύμα Χείλους που ρέει κατά μήκος των ακτογραμμών, απομονώνοντας τις κεντρικές δίνες",
    "ecosystem": "Μια ημίκλειστη θάλασσα που ορίζεται μοναδικά από μια μόνιμη αλοκλίνη, δημιουργώντας ένα ανοξικό (χωρίς οξυγόνο) βαθύ στρώμα κάτω από 150-200μ. Τα βιολογικά παραγωγικά επιφανειακά νερά υποστηρίζουν σημαντικές εμπορικές αλιείες.",
    "coastline_features": "Μεγάλες εκτάσεις αμμωδών παραλιών, σημαντικά δέλτα ποταμών (π.χ. Δούναβης) και ποικίλοι παράκτιοι γκρεμοί (π.χ. τουρκική ακτή)",
    "important_ports": [
      "Βάρνα (Κύριο θαλάσσιο λιμάνι της Βουλγαρίας)",
      "Μπουργκάς (Βασικό λιμάνι πετρελαίου και βιομηχανίας)",
      "Κωνσταντινούπολη (μέσω του Στενού του Βοσπόρου, που συνδέεται με τη Θάλασσα του Μαρμαρά)"
    ],
    "economic_activities": [
      "Μαζική εμπορική αλιεία (Η αλιεία γαύρου είναι η σημαντικότερη περιφερειακή δραστηριότητα)",
      "Διεθνής ναυτιλία και μεταφορά ενέργειας",
      "Παράκτιος τουρισμός (δημοφιλής στη Βουλγαρία, τη Ρουμανία και την Τουρκία)"
    ],
    "description": "Ο Εύξεινος Πόντος είναι οικολογικά ευαίσθητος λόγω της μοναδικής του χαμηλής αλατότητας, των ανοξικών βαθέων υδάτων και της έντονης επίδρασης από μεγάλους ευρωπαϊκούς ποταμούς. Οι αλιείες γαύρου είναι οικονομικά ύψιστης σημασίας αλλά υπόκεινται σε υψηλή μεταβλητότητα. Η ρύπανση και η υποβάθμιση του οικοτόπου από την απορροή ποταμών και τη ναυτιλία αποτελούν μεγάλες περιβαλλοντικές απειλές.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1H5yw63uKr0lomlEqY-oU2BEU2ehvJhA5&export=view&authuser=0"
    ]
  },
  {
    "id": 3,
    "sea_name": "Ατλαντικός Ωκεανός (Πορτογαλία Ακτή)",
    "sea_image" : "atlantic_image",
    "area": "Ανοιχτός Ατλαντικός ανοιχτά της δυτικής Πορτογαλίας",
    "max_depth": 8486,
    "location": "Ολόκληρη η δυτική και νότια ακτή της Πορτογαλίας, που συνορεύει με τον Βόρειο Ατλαντικό Ωκεανό",
    "main_fishes": [
      "Ατλαντικός Μπακαλιάρος (Gadus morhua - ιστορικά σημαντικός)",
      "Σαρδέλα (Sardina pilchardus - ακρογωνιαίος λίθος της τοπικής κουζίνας)",
      "Σκουμπρί (Scomber scombrus)",
      "Κόκκινος Τόνος (Thunnus thynnus - υψηλά μεταναστευτικός και πολύτιμος)"
    ],
    "main_species": [
      "Κοινό Χταπόδι (Octopus vulgaris)",
      "Ευρωπαϊκό Καλαμάρι (Loligo vulgaris)",
      "Εδώδιμος Αχινός (Paracentrotus lividus)",
      "Ευρωπαϊκός Αστακός (Homarus gammarus)"
    ],
    "temperature_range": "12°C - 22°C",
    "salinity": "35 PSU",
    "currents": "Επηρεάζεται από το ψυχρό Ρεύμα της Πορτογαλίας που ρέει νότια και τη θερμότερη Παρασύρση του Βόρειου Ατλαντικού, δημιουργώντας δυναμικές συνθήκες",
    "ecosystem": "Ένα εξαιρετικά παραγωγικό εύκρατο οικοσύστημα υφαλοκρηπίδας, που χαρακτηρίζεται από εκτεταμένους βραχώδεις υφάλους, ποικίλους αμμώδεις πυθμένες και εποχιακές παράκτιες ζώνες ανάδυσης που φέρνουν ψυχρό, πλούσιο σε θρεπτικά συστατικά νερό στην επιφάνεια, υποστηρίζοντας τεράστια αποθέματα ψαριών",
    "coastline_features": "Δραματικοί, ανεμοδαρμένοι βραχώδεις γκρεμοί (π.χ. Cabo da Roca), εκτεταμένες αμμώδεις παραλίες και σημαντικές εκβολές ποταμών (π.χ. Τάγος και Ντούρο)",
    "important_ports": [
      "Λισαβόνα (Το μεγαλύτερο και σημαντικότερο λιμάνι για εμπόριο και κρουαζιερόπλοια)",
      "Πόρτο (Βασικός βιομηχανικός και ναυτιλιακός κόμβος στον βορρά)",
      "Σετούμπαλ (Σημαντικό για αλιεία και ναυπηγική)"
    ],
    "economic_activities": [
      "Εντατική αλιεία (ιδιαίτερα για πελαγικά είδη όπως σαρδέλα και τόνος)",
      "Διεθνής ναυτιλία και θαλάσσιες υπηρεσίες (λόγω στρατηγικής ατλαντικής θέσης)",
      "Παράκτιος και σερφ τουρισμός (σε όλη την ακτή)"
    ],
    "description": "Η ατλαντική ακτή της Πορτογαλίας είναι γνωστή για το εξαιρετικά παραγωγικό θαλάσσιο περιβάλλον της που οδηγείται από την εποχιακή ανάδυση, καθιστώντας την μία από τις πλουσιότερες αλιευτικές περιοχές στην Ευρώπη. Η μακρά παράδοση κατανάλωσης μπακαλιάρου (Bacalhau), παρόλο που ο μπακαλιάρος αλιεύεται κυρίως στον Βόρειο Ατλαντικό, είναι ένα καθοριστικό πολιτιστικό στοιχείο. Η βιώσιμη διαχείριση των τοπικών αποθεμάτων σαρδέλας και τόνου είναι μια συνεχής προτεραιότητα.",
    "image_paths": [
      "https://drive.usercontent.google.com/download?id=1wD-UGo_hVK3Jc2XUmw9GIll11CJuv5CU&export=view&authuser=0"
    ]
  }
]